<abi-corpus path='/opt/spack/opt/spack/linux-ubuntu18.04-x86_64/gcc-7.5.0/python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/lib/libpython3.8.so' architecture='elf-amd-x86_64' soname='libpython3.8.so.1.0'>
  <elf-needed>
    <dependency name='libintl.so.8'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libutil.so.1'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='PyAST_Check' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_Compile' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_CompileEx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_CompileObject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_FromNode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_FromNodeObject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_Validate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_Py_PackageContext' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_SwappedOp' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_TrueStruct' size='32' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_UnhandledKeyboardInterrupt' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_abstract_hack' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ascii_whitespace' size='128' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_capitalize__doc__' size='124' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_count__doc__' size='199' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_table' size='1024' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_tolower' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_toupper' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_endswith__doc__' size='264' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_find__doc__' size='239' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_index__doc__' size='270' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isalnum__doc__' size='132' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isalpha__doc__' size='130' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isascii__doc__' size='98' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isdigit__doc__' size='126' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_islower__doc__' size='141' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isspace__doc__' size='130' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_istitle__doc__' size='230' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isupper__doc__' size='141' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_lower__doc__' size='93' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_maketrans__doc__' size='291' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_open_cloexec_works' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_path_config' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_rfind__doc__' size='241' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_rindex__doc__' size='271' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_startswith__doc__' size='268' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_swapcase__doc__' size='123' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_title__doc__' size='155' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_tracemalloc_config' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_upper__doc__' size='93' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_abc.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__abc' mangled-name='PyInit__abc' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_abc.c' line='824' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__abc'>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-1'/>
    <typedef-decl name='PyObject' type-id='type-id-3' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='108' column='1' id='type-id-2'/>
    <class-decl name='_object' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='104' column='1' id='type-id-3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_refcnt' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ob_type' type-id='type-id-5' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='107' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-5'/>
    <typedef-decl name='Py_ssize_t' type-id='type-id-7' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/pyport.h' line='105' column='1' id='type-id-4'/>
    <class-decl name='_typeobject' size-in-bits='3328' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='177' column='1' id='type-id-6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-8' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tp_name' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tp_basicsize' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tp_itemsize' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tp_dealloc' type-id='type-id-10' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tp_vectorcall_offset' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='tp_getattr' type-id='type-id-11' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tp_setattr' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='tp_as_async' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='tp_repr' type-id='type-id-14' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='tp_as_number' type-id='type-id-15' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='tp_as_sequence' type-id='type-id-16' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='tp_as_mapping' type-id='type-id-17' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='tp_hash' type-id='type-id-18' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='tp_call' type-id='type-id-19' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='tp_str' type-id='type-id-14' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='tp_getattro' type-id='type-id-20' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='tp_setattro' type-id='type-id-21' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='tp_as_buffer' type-id='type-id-22' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='tp_flags' type-id='type-id-23' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='tp_doc' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='tp_traverse' type-id='type-id-24' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='tp_clear' type-id='type-id-25' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='tp_richcompare' type-id='type-id-26' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='tp_weaklistoffset' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='tp_iter' type-id='type-id-27' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='tp_iternext' type-id='type-id-28' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='tp_methods' type-id='type-id-29' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='tp_members' type-id='type-id-30' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='tp_getset' type-id='type-id-31' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='tp_base' type-id='type-id-5' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='tp_dict' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='tp_descr_get' type-id='type-id-32' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tp_descr_set' type-id='type-id-33' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='tp_dictoffset' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='tp_init' type-id='type-id-34' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='tp_alloc' type-id='type-id-35' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='tp_new' type-id='type-id-36' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='tp_free' type-id='type-id-37' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='tp_is_gc' type-id='type-id-25' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='tp_bases' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='tp_mro' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='tp_cache' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='tp_subclasses' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='tp_weaklist' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='tp_del' type-id='type-id-10' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='tp_version_tag' type-id='type-id-38' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='tp_finalize' type-id='type-id-10' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='tp_vectorcall' type-id='type-id-39' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='tp_print' type-id='type-id-40' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='260' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ssize_t' type-id='type-id-41' filepath='/usr/include/stdio.h' line='71' column='1' id='type-id-7'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-13'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-22'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-30'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-29'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-15'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-16'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-9'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-40'/>
    <typedef-decl name='PyVarObject' type-id='type-id-52' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='116' column='1' id='type-id-8'/>
    <typedef-decl name='__ssize_t' type-id='type-id-53' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='181' column='1' id='type-id-41'/>
    <typedef-decl name='allocfunc' type-id='type-id-54' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='171' column='1' id='type-id-35'/>
    <typedef-decl name='descrgetfunc' type-id='type-id-55' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='167' column='1' id='type-id-32'/>
    <typedef-decl name='descrsetfunc' type-id='type-id-56' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='168' column='1' id='type-id-33'/>
    <typedef-decl name='destructor' type-id='type-id-57' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='157' column='1' id='type-id-10'/>
    <typedef-decl name='freefunc' type-id='type-id-58' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='156' column='1' id='type-id-37'/>
    <typedef-decl name='getattrfunc' type-id='type-id-59' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='158' column='1' id='type-id-11'/>
    <typedef-decl name='getattrofunc' type-id='type-id-60' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='159' column='1' id='type-id-20'/>
    <typedef-decl name='getiterfunc' type-id='type-id-61' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='165' column='1' id='type-id-27'/>
    <typedef-decl name='hashfunc' type-id='type-id-62' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='163' column='1' id='type-id-18'/>
    <typedef-decl name='initproc' type-id='type-id-56' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='169' column='1' id='type-id-34'/>
    <typedef-decl name='inquiry' type-id='type-id-63' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='143' column='1' id='type-id-25'/>
    <typedef-decl name='iternextfunc' type-id='type-id-61' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='166' column='1' id='type-id-28'/>
    <typedef-decl name='newfunc' type-id='type-id-64' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='170' column='1' id='type-id-36'/>
    <typedef-decl name='reprfunc' type-id='type-id-61' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='162' column='1' id='type-id-14'/>
    <typedef-decl name='richcmpfunc' type-id='type-id-65' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='164' column='1' id='type-id-26'/>
    <typedef-decl name='setattrfunc' type-id='type-id-66' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='160' column='1' id='type-id-12'/>
    <typedef-decl name='setattrofunc' type-id='type-id-56' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='161' column='1' id='type-id-21'/>
    <typedef-decl name='ternaryfunc' type-id='type-id-55' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='142' column='1' id='type-id-19'/>
    <typedef-decl name='traverseproc' type-id='type-id-67' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='153' column='1' id='type-id-24'/>
    <typedef-decl name='vectorcallfunc' type-id='type-id-68' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='58' column='1' id='type-id-39'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-38'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-23'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-61'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-68'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-60'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-55'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-65'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-59'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-64'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-54'/>
    <class-decl name='PyGetSetDef' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/descrobject.h' line='11' column='1' id='type-id-44'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/descrobject.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='get' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/descrobject.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='set' type-id='type-id-78' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/descrobject.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='doc' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/descrobject.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='closure' type-id='type-id-79' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/descrobject.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyMemberDef' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/structmember.h' line='18' column='1' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/structmember.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/structmember.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offset' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/structmember.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flags' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/structmember.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='doc' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/structmember.h' line='23' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyMethodDef' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/methodobject.h' line='51' column='1' id='type-id-47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ml_name' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/methodobject.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ml_meth' type-id='type-id-81' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/methodobject.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ml_flags' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/methodobject.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ml_doc' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/methodobject.h' line='56' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-8' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='113' column='1' id='type-id-52'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-2' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ob_size' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='115' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-82' const='yes' id='type-id-50'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-63'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-56'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-66'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-67'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-53'/>
    <typedef-decl name='PyAsyncMethods' type-id='type-id-87' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='166' column='1' id='type-id-42'/>
    <typedef-decl name='PyBufferProcs' type-id='type-id-88' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='171' column='1' id='type-id-43'/>
    <typedef-decl name='PyMappingMethods' type-id='type-id-89' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='160' column='1' id='type-id-45'/>
    <typedef-decl name='PyNumberMethods' type-id='type-id-90' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='140' column='1' id='type-id-48'/>
    <typedef-decl name='PySequenceMethods' type-id='type-id-91' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='154' column='1' id='type-id-49'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-62'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-57'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-58'/>
    <type-decl name='char' size-in-bits='8' id='type-id-82'/>
    <class-decl name='__anonymous_struct__2' size-in-bits='2304' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-48' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='95' column='1' id='type-id-90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_add' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nb_subtract' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nb_multiply' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nb_remainder' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nb_divmod' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nb_power' type-id='type-id-19' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nb_negative' type-id='type-id-96' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nb_positive' type-id='type-id-96' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nb_absolute' type-id='type-id-96' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='nb_bool' type-id='type-id-25' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='nb_invert' type-id='type-id-96' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='nb_lshift' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='nb_rshift' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='nb_and' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='nb_xor' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='nb_or' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='nb_int' type-id='type-id-96' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='nb_reserved' type-id='type-id-79' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='nb_float' type-id='type-id-96' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='nb_inplace_add' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='nb_inplace_subtract' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='nb_inplace_multiply' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='nb_inplace_remainder' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='nb_inplace_power' type-id='type-id-19' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='nb_inplace_lshift' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='nb_inplace_rshift' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='nb_inplace_and' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='nb_inplace_xor' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='nb_inplace_or' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='nb_floor_divide' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='nb_true_divide' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='nb_inplace_floor_divide' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='nb_inplace_true_divide' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='nb_index' type-id='type-id-96' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='nb_matrix_multiply' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='nb_inplace_matrix_multiply' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='139' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-43' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='168' column='1' id='type-id-88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bf_getbuffer' type-id='type-id-97' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bf_releasebuffer' type-id='type-id-98' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='170' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-45' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='156' column='1' id='type-id-89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mp_length' type-id='type-id-99' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp_subscript' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mp_ass_subscript' type-id='type-id-100' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='159' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='640' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-49' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='142' column='1' id='type-id-91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sq_length' type-id='type-id-99' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sq_concat' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sq_repeat' type-id='type-id-101' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sq_item' type-id='type-id-101' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='was_sq_slice' type-id='type-id-79' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='sq_ass_item' type-id='type-id-102' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='was_sq_ass_slice' type-id='type-id-79' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='sq_contains' type-id='type-id-103' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='sq_inplace_concat' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='sq_inplace_repeat' type-id='type-id-101' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='153' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-42' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='162' column='1' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='am_await' type-id='type-id-96' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='am_aiter' type-id='type-id-96' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='am_anext' type-id='type-id-96' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='165' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-80'/>
    <typedef-decl name='PyCFunction' type-id='type-id-60' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/methodobject.h' line='18' column='1' id='type-id-81'/>
    <typedef-decl name='getter' type-id='type-id-104' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/descrobject.h' line='8' column='1' id='type-id-77'/>
    <typedef-decl name='setter' type-id='type-id-105' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/descrobject.h' line='9' column='1' id='type-id-78'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-104'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-105'/>
    <typedef-decl name='binaryfunc' type-id='type-id-60' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='141' column='1' id='type-id-95'/>
    <typedef-decl name='getbufferproc' type-id='type-id-109' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='55' column='1' id='type-id-97'/>
    <typedef-decl name='lenfunc' type-id='type-id-110' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='144' column='1' id='type-id-99'/>
    <typedef-decl name='objobjargproc' type-id='type-id-56' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='149' column='1' id='type-id-100'/>
    <typedef-decl name='objobjproc' type-id='type-id-111' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='151' column='1' id='type-id-103'/>
    <typedef-decl name='releasebufferproc' type-id='type-id-112' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='56' column='1' id='type-id-98'/>
    <typedef-decl name='ssizeargfunc' type-id='type-id-113' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='145' column='1' id='type-id-101'/>
    <typedef-decl name='ssizeobjargproc' type-id='type-id-114' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='147' column='1' id='type-id-102'/>
    <typedef-decl name='unaryfunc' type-id='type-id-61' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/object.h' line='140' column='1' id='type-id-96'/>
    <type-decl name='void' id='type-id-106'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-113'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-111'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-109'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-114'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-110'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-112'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_codecsmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__codecs' mangled-name='PyInit__codecs' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_codecsmodule.c' line='1055' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__codecs'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_collectionsmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__collections' mangled-name='PyInit__collections' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_collectionsmodule.c' line='2535' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__collections'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_functoolsmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__functools' mangled-name='PyInit__functools' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_functoolsmodule.c' line='1393' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__functools'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <typedef-decl name='_PyIO_State' type-id='type-id-121' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='145' column='1' id='type-id-122'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-122' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='140' column='1' id='type-id-121'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='initialized' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='locale_module' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='unsupported_operation' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='144' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='Py_off_t' type-id='type-id-123' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='104' column='1' id='type-id-124'/>
    <typedef-decl name='off_t' type-id='type-id-125' filepath='/usr/include/stdio.h' line='59' column='1' id='type-id-123'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-126'/>
    <var-decl name='_PyIO_str_close' type-id='type-id-1' mangled-name='_PyIO_str_close' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='157' column='1' elf-symbol-id='_PyIO_str_close'/>
    <var-decl name='_PyIO_str_closed' type-id='type-id-1' mangled-name='_PyIO_str_closed' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='158' column='1' elf-symbol-id='_PyIO_str_closed'/>
    <var-decl name='_PyIO_str_decode' type-id='type-id-1' mangled-name='_PyIO_str_decode' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='159' column='1' elf-symbol-id='_PyIO_str_decode'/>
    <var-decl name='_PyIO_str_encode' type-id='type-id-1' mangled-name='_PyIO_str_encode' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='160' column='1' elf-symbol-id='_PyIO_str_encode'/>
    <var-decl name='_PyIO_str_fileno' type-id='type-id-1' mangled-name='_PyIO_str_fileno' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='161' column='1' elf-symbol-id='_PyIO_str_fileno'/>
    <var-decl name='_PyIO_str_flush' type-id='type-id-1' mangled-name='_PyIO_str_flush' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='162' column='1' elf-symbol-id='_PyIO_str_flush'/>
    <var-decl name='_PyIO_str_getstate' type-id='type-id-1' mangled-name='_PyIO_str_getstate' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='163' column='1' elf-symbol-id='_PyIO_str_getstate'/>
    <var-decl name='_PyIO_str_isatty' type-id='type-id-1' mangled-name='_PyIO_str_isatty' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='164' column='1' elf-symbol-id='_PyIO_str_isatty'/>
    <var-decl name='_PyIO_str_newlines' type-id='type-id-1' mangled-name='_PyIO_str_newlines' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='165' column='1' elf-symbol-id='_PyIO_str_newlines'/>
    <var-decl name='_PyIO_str_nl' type-id='type-id-1' mangled-name='_PyIO_str_nl' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='166' column='1' elf-symbol-id='_PyIO_str_nl'/>
    <var-decl name='_PyIO_str_peek' type-id='type-id-1' mangled-name='_PyIO_str_peek' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='167' column='1' elf-symbol-id='_PyIO_str_peek'/>
    <var-decl name='_PyIO_str_read' type-id='type-id-1' mangled-name='_PyIO_str_read' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='168' column='1' elf-symbol-id='_PyIO_str_read'/>
    <var-decl name='_PyIO_str_read1' type-id='type-id-1' mangled-name='_PyIO_str_read1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='169' column='1' elf-symbol-id='_PyIO_str_read1'/>
    <var-decl name='_PyIO_str_readable' type-id='type-id-1' mangled-name='_PyIO_str_readable' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='170' column='1' elf-symbol-id='_PyIO_str_readable'/>
    <var-decl name='_PyIO_str_readall' type-id='type-id-1' mangled-name='_PyIO_str_readall' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='171' column='1' elf-symbol-id='_PyIO_str_readall'/>
    <var-decl name='_PyIO_str_readinto' type-id='type-id-1' mangled-name='_PyIO_str_readinto' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='172' column='1' elf-symbol-id='_PyIO_str_readinto'/>
    <var-decl name='_PyIO_str_readline' type-id='type-id-1' mangled-name='_PyIO_str_readline' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='173' column='1' elf-symbol-id='_PyIO_str_readline'/>
    <var-decl name='_PyIO_str_reset' type-id='type-id-1' mangled-name='_PyIO_str_reset' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='174' column='1' elf-symbol-id='_PyIO_str_reset'/>
    <var-decl name='_PyIO_str_seek' type-id='type-id-1' mangled-name='_PyIO_str_seek' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='175' column='1' elf-symbol-id='_PyIO_str_seek'/>
    <var-decl name='_PyIO_str_seekable' type-id='type-id-1' mangled-name='_PyIO_str_seekable' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='176' column='1' elf-symbol-id='_PyIO_str_seekable'/>
    <var-decl name='_PyIO_str_setstate' type-id='type-id-1' mangled-name='_PyIO_str_setstate' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='177' column='1' elf-symbol-id='_PyIO_str_setstate'/>
    <var-decl name='_PyIO_str_tell' type-id='type-id-1' mangled-name='_PyIO_str_tell' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='178' column='1' elf-symbol-id='_PyIO_str_tell'/>
    <var-decl name='_PyIO_str_truncate' type-id='type-id-1' mangled-name='_PyIO_str_truncate' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='179' column='1' elf-symbol-id='_PyIO_str_truncate'/>
    <var-decl name='_PyIO_str_writable' type-id='type-id-1' mangled-name='_PyIO_str_writable' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='180' column='1' elf-symbol-id='_PyIO_str_writable'/>
    <var-decl name='_PyIO_str_write' type-id='type-id-1' mangled-name='_PyIO_str_write' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='181' column='1' elf-symbol-id='_PyIO_str_write'/>
    <var-decl name='_PyIO_empty_str' type-id='type-id-1' mangled-name='_PyIO_empty_str' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='183' column='1' elf-symbol-id='_PyIO_empty_str'/>
    <var-decl name='_PyIO_empty_bytes' type-id='type-id-1' mangled-name='_PyIO_empty_bytes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='184' column='1' elf-symbol-id='_PyIO_empty_bytes'/>
    <var-decl name='_PyIO_Module' type-id='type-id-127' mangled-name='_PyIO_Module' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='138' column='1' elf-symbol-id='_PyIO_Module'/>
    <function-decl name='PyInit__io' mangled-name='PyInit__io' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.c' line='669' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__io'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyIO_get_locale_module' mangled-name='_PyIO_get_locale_module' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.c' line='590' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIO_get_locale_module'>
      <parameter type-id='type-id-126' name='state' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.c' line='590' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyIO_get_module_state' mangled-name='_PyIO_get_module_state' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.c' line='576' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIO_get_module_state'>
      <return type-id='type-id-126'/>
    </function-decl>
    <function-decl name='PyNumber_AsOff_t' mangled-name='PyNumber_AsOff_t' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.c' line='531' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_AsOff_t'>
      <parameter type-id='type-id-1' name='item' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.c' line='531' column='1'/>
      <parameter type-id='type-id-1' name='err' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.c' line='531' column='1'/>
      <return type-id='type-id-124'/>
    </function-decl>
    <typedef-decl name='PyModuleDef' type-id='type-id-128' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/moduleobject.h' line='85' column='1' id='type-id-127'/>
    <typedef-decl name='__off64_t' type-id='type-id-53' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='141' column='1' id='type-id-125'/>
    <class-decl name='PyModuleDef' size-in-bits='832' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/moduleobject.h' line='75' column='1' id='type-id-128'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_base' type-id='type-id-129' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/moduleobject.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='m_name' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/moduleobject.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='m_doc' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/moduleobject.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='m_size' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/moduleobject.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='m_methods' type-id='type-id-29' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/moduleobject.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='m_slots' type-id='type-id-130' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/moduleobject.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='m_traverse' type-id='type-id-24' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/moduleobject.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='m_clear' type-id='type-id-25' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/moduleobject.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='m_free' type-id='type-id-37' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/moduleobject.h' line='84' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-130'/>
    <typedef-decl name='PyModuleDef_Base' type-id='type-id-132' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/moduleobject.h' line='49' column='1' id='type-id-129'/>
    <class-decl name='PyModuleDef_Base' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/moduleobject.h' line='44' column='1' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-2' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/moduleobject.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='m_init' type-id='type-id-133' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/moduleobject.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='m_index' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/moduleobject.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='m_copy' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/moduleobject.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyModuleDef_Slot' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/moduleobject.h' line='61' column='1' id='type-id-131'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='slot' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/moduleobject.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value' type-id='type-id-79' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/moduleobject.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-133'/>
    <function-type size-in-bits='64' id='type-id-134'>
      <return type-id='type-id-1'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/bufferedio.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyBufferedIOBase_Type' type-id='type-id-135' mangled-name='PyBufferedIOBase_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='8' column='1' elf-symbol-id='PyBufferedIOBase_Type'/>
    <var-decl name='PyBufferedReader_Type' type-id='type-id-135' mangled-name='PyBufferedReader_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='15' column='1' elf-symbol-id='PyBufferedReader_Type'/>
    <var-decl name='PyBufferedWriter_Type' type-id='type-id-135' mangled-name='PyBufferedWriter_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='16' column='1' elf-symbol-id='PyBufferedWriter_Type'/>
    <var-decl name='PyBufferedRWPair_Type' type-id='type-id-135' mangled-name='PyBufferedRWPair_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='17' column='1' elf-symbol-id='PyBufferedRWPair_Type'/>
    <var-decl name='PyBufferedRandom_Type' type-id='type-id-135' mangled-name='PyBufferedRandom_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='18' column='1' elf-symbol-id='PyBufferedRandom_Type'/>
    <function-decl name='_PyIO_trap_eintr' mangled-name='_PyIO_trap_eintr' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/bufferedio.c' line='764' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIO_trap_eintr'>
      <return type-id='type-id-80'/>
    </function-decl>
    <typedef-decl name='PyTypeObject' type-id='type-id-6' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/object.h' line='270' column='1' id='type-id-135'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/bytesio.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyBytesIO_Type' type-id='type-id-135' mangled-name='PyBytesIO_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='13' column='1' elf-symbol-id='PyBytesIO_Type'/>
    <var-decl name='_PyBytesIOBuffer_Type' type-id='type-id-135' mangled-name='_PyBytesIOBuffer_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='186' column='1' elf-symbol-id='_PyBytesIOBuffer_Type'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/fileio.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyFileIO_Type' type-id='type-id-135' mangled-name='PyFileIO_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='12' column='1' elf-symbol-id='PyFileIO_Type'/>
    <function-decl name='_PyFileIO_closed' mangled-name='_PyFileIO_closed' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/fileio.c' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyFileIO_closed'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/fileio.c' line='81' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/iobase.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyIOBase_Type' type-id='type-id-135' mangled-name='PyIOBase_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='6' column='1' elf-symbol-id='PyIOBase_Type'/>
    <var-decl name='PyRawIOBase_Type' type-id='type-id-135' mangled-name='PyRawIOBase_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='7' column='1' elf-symbol-id='PyRawIOBase_Type'/>
    <function-decl name='_PyIOBase_finalize' mangled-name='_PyIOBase_finalize' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/iobase.c' line='312' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIOBase_finalize'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/iobase.c' line='312' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='_PyIOBase_check_seekable' mangled-name='_PyIOBase_check_seekable' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/iobase.c' line='384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIOBase_check_seekable'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/iobase.c' line='384' column='1'/>
      <parameter type-id='type-id-1' name='args' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/iobase.c' line='384' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyIOBase_check_writable' mangled-name='_PyIOBase_check_writable' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/iobase.c' line='450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIOBase_check_writable'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/iobase.c' line='450' column='1'/>
      <parameter type-id='type-id-1' name='args' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/iobase.c' line='450' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyIOBase_check_readable' mangled-name='_PyIOBase_check_readable' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/iobase.c' line='417' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIOBase_check_readable'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/iobase.c' line='417' column='1'/>
      <parameter type-id='type-id-1' name='args' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/iobase.c' line='417' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyIOBase_check_closed' mangled-name='_PyIOBase_check_closed' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/iobase.c' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIOBase_check_closed'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/iobase.c' line='201' column='1'/>
      <parameter type-id='type-id-1' name='args' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/iobase.c' line='201' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/stringio.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyStringIO_Type' type-id='type-id-135' mangled-name='PyStringIO_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='14' column='1' elf-symbol-id='PyStringIO_Type'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/textio.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyTextIOBase_Type' type-id='type-id-135' mangled-name='PyTextIOBase_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='9' column='1' elf-symbol-id='PyTextIOBase_Type'/>
    <var-decl name='PyIncrementalNewlineDecoder_Type' type-id='type-id-135' mangled-name='PyIncrementalNewlineDecoder_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='20' column='1' elf-symbol-id='PyIncrementalNewlineDecoder_Type'/>
    <var-decl name='PyTextIOWrapper_Type' type-id='type-id-135' mangled-name='PyTextIOWrapper_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/_iomodule.h' line='19' column='1' elf-symbol-id='PyTextIOWrapper_Type'/>
    <function-decl name='_PyIO_find_line_ending' mangled-name='_PyIO_find_line_ending' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/textio.c' line='2002' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIO_find_line_ending'>
      <parameter type-id='type-id-80' name='translated' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/textio.c' line='2003' column='1'/>
      <parameter type-id='type-id-80' name='universal' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/textio.c' line='2003' column='1'/>
      <parameter type-id='type-id-1' name='readnl' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/textio.c' line='2003' column='1'/>
      <parameter type-id='type-id-80' name='kind' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/textio.c' line='2004' column='1'/>
      <parameter type-id='type-id-9' name='start' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/textio.c' line='2004' column='1'/>
      <parameter type-id='type-id-9' name='end' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/textio.c' line='2004' column='1'/>
      <parameter type-id='type-id-136' name='consumed' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/textio.c' line='2004' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyIncrementalNewlineDecoder_decode' mangled-name='_PyIncrementalNewlineDecoder_decode' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/textio.c' line='304' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIncrementalNewlineDecoder_decode'>
      <parameter type-id='type-id-1' name='myself' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/textio.c' line='304' column='1'/>
      <parameter type-id='type-id-1' name='input' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/textio.c' line='305' column='1'/>
      <parameter type-id='type-id-80' name='final' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_io/textio.c' line='305' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-136'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_localemodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__locale' mangled-name='PyInit__locale' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_localemodule.c' line='727' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__locale'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_operator.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__operator' mangled-name='PyInit__operator' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_operator.c' line='1765' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__operator'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_sre.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__sre' mangled-name='PyInit__sre' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_sre.c' line='2768' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__sre'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_stat.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__stat' mangled-name='PyInit__stat' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_stat.c' line='508' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__stat'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_threadmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__thread' mangled-name='PyInit__thread' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_threadmodule.c' line='1511' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__thread'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_tracemalloc.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='_PyTraceMalloc_GetTraceback' mangled-name='_PyTraceMalloc_GetTraceback' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_tracemalloc.c' line='1759' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyTraceMalloc_GetTraceback'>
      <parameter type-id='type-id-38' name='domain' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_tracemalloc.c' line='1759' column='1'/>
      <parameter type-id='type-id-137' name='ptr' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_tracemalloc.c' line='1759' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyTraceMalloc_NewReference' mangled-name='_PyTraceMalloc_NewReference' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_tracemalloc.c' line='1710' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyTraceMalloc_NewReference'>
      <parameter type-id='type-id-1' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_tracemalloc.c' line='1710' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyTraceMalloc_Untrack' mangled-name='PyTraceMalloc_Untrack' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_tracemalloc.c' line='1689' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyTraceMalloc_Untrack'>
      <parameter type-id='type-id-38' name='domain' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_tracemalloc.c' line='1689' column='1'/>
      <parameter type-id='type-id-137' name='ptr' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_tracemalloc.c' line='1689' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyTraceMalloc_Track' mangled-name='PyTraceMalloc_Track' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_tracemalloc.c' line='1666' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyTraceMalloc_Track'>
      <parameter type-id='type-id-38' name='domain' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_tracemalloc.c' line='1666' column='1'/>
      <parameter type-id='type-id-137' name='ptr' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_tracemalloc.c' line='1666' column='1'/>
      <parameter type-id='type-id-138' name='size' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_tracemalloc.c' line='1667' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='_PyTraceMalloc_Fini' mangled-name='_PyTraceMalloc_Fini' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_tracemalloc.c' line='1659' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyTraceMalloc_Fini'>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='_PyTraceMalloc_Init' mangled-name='_PyTraceMalloc_Init' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_tracemalloc.c' line='1648' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyTraceMalloc_Init'>
      <parameter type-id='type-id-80' name='nframe' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_tracemalloc.c' line='1648' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyInit__tracemalloc' mangled-name='PyInit__tracemalloc' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_tracemalloc.c' line='1633' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__tracemalloc'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyMem_DumpTraceback' mangled-name='_PyMem_DumpTraceback' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_tracemalloc.c' line='1470' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyMem_DumpTraceback'>
      <parameter type-id='type-id-80' name='fd' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_tracemalloc.c' line='1470' column='1'/>
      <parameter type-id='type-id-79' name='ptr' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_tracemalloc.c' line='1470' column='1'/>
      <return type-id='type-id-106'/>
    </function-decl>
    <typedef-decl name='size_t' type-id='type-id-23' filepath='/usr/lib/gcc/x86_64-linux-gnu/7/include/stddef.h' line='216' column='1' id='type-id-138'/>
    <typedef-decl name='uintptr_t' type-id='type-id-23' filepath='/usr/include/stdint.h' line='100' column='1' id='type-id-137'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_weakref.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__weakref' mangled-name='PyInit__weakref' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/_weakref.c' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__weakref'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/atexitmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit_atexit' mangled-name='PyInit_atexit' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/atexitmodule.c' line='351' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_atexit'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/errnomodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit_errno' mangled-name='PyInit_errno' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/errnomodule.c' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_errno'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/faulthandler.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='_PyFaulthandler_Fini' mangled-name='_PyFaulthandler_Fini' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/faulthandler.c' line='1360' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyFaulthandler_Fini'>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='_PyFaulthandler_Init' mangled-name='_PyFaulthandler_Init' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/faulthandler.c' line='1319' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyFaulthandler_Init'>
      <parameter type-id='type-id-80' name='enable' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/faulthandler.c' line='1319' column='1'/>
      <return type-id='type-id-139'/>
    </function-decl>
    <function-decl name='PyInit_faulthandler' mangled-name='PyInit_faulthandler' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/faulthandler.c' line='1269' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_faulthandler'>
      <return type-id='type-id-1'/>
    </function-decl>
    <typedef-decl name='PyStatus' type-id='type-id-140' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='19' column='1' id='type-id-139'/>
    <class-decl name='__anonymous_struct__' size-in-bits='256' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-139' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='10' column='1' id='type-id-140'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_type' type-id='type-id-141' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='func' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='err_msg' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='exitcode' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='18' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='11' column='1' id='type-id-141'>
      <underlying-type type-id='type-id-142'/>
      <enumerator name='_PyStatus_TYPE_OK' value='0'/>
      <enumerator name='_PyStatus_TYPE_ERROR' value='1'/>
      <enumerator name='_PyStatus_TYPE_EXIT' value='2'/>
    </enum-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-144'/>
    <function-decl name='PyObject_GC_Del' mangled-name='PyObject_GC_Del' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='2041' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_Del'>
      <parameter type-id='type-id-79' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='2041' column='1'/>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='_PyObject_GC_Resize' mangled-name='_PyObject_GC_Resize' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='2023' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_Resize'>
      <parameter type-id='type-id-145' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='2023' column='1'/>
      <parameter type-id='type-id-4' name='nitems' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='2023' column='1'/>
      <return type-id='type-id-145'/>
    </function-decl>
    <function-decl name='_PyObject_GC_NewVar' mangled-name='_PyObject_GC_NewVar' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='2006' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_NewVar'>
      <parameter type-id='type-id-146' name='tp' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='2006' column='1'/>
      <parameter type-id='type-id-4' name='nitems' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='2006' column='1'/>
      <return type-id='type-id-145'/>
    </function-decl>
    <function-decl name='_PyObject_GC_New' mangled-name='_PyObject_GC_New' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='1997' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_New'>
      <parameter type-id='type-id-146' name='tp' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='1997' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyObject_GC_Calloc' mangled-name='_PyObject_GC_Calloc' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='1991' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_Calloc'>
      <parameter type-id='type-id-138' name='basicsize' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='1991' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyObject_GC_Malloc' mangled-name='_PyObject_GC_Malloc' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='1985' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_Malloc'>
      <parameter type-id='type-id-138' name='basicsize' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='1985' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyObject_GC_UnTrack' mangled-name='PyObject_GC_UnTrack' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='1940' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_UnTrack'>
      <parameter type-id='type-id-79' name='op_raw' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='1940' column='1'/>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='PyObject_GC_Track' mangled-name='PyObject_GC_Track' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='1928' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_Track'>
      <parameter type-id='type-id-79' name='op_raw' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='1928' column='1'/>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='_PyGC_Dump' mangled-name='_PyGC_Dump' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='1919' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyGC_Dump'>
      <parameter type-id='type-id-147' name='g' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='1919' column='1'/>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='_PyGC_Fini' mangled-name='_PyGC_Fini' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='1910' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyGC_Fini'>
      <parameter type-id='type-id-148' name='runtime' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='1910' column='1'/>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='_PyGC_DumpShutdownStats' mangled-name='_PyGC_DumpShutdownStats' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='1873' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyGC_DumpShutdownStats'>
      <parameter type-id='type-id-148' name='runtime' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='1873' column='1'/>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='_PyGC_CollectNoFail' mangled-name='_PyGC_CollectNoFail' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='1848' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyGC_CollectNoFail'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyGC_CollectIfEnabled' mangled-name='_PyGC_CollectIfEnabled' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='1842' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyGC_CollectIfEnabled'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyInit_gc' mangled-name='PyInit_gc' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='1776' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_gc'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyGC_Initialize' mangled-name='_PyGC_Initialize' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyGC_Initialize'>
      <parameter type-id='type-id-144' name='state' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='129' column='1'/>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='PyGC_Collect' mangled-name='PyGC_Collect' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/gcmodule.c' line='1817' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyGC_Collect'>
      <return type-id='type-id-4'/>
    </function-decl>
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-147'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-146'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-145'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-148'/>
    <class-decl name='_gc_runtime_state' size-in-bits='1920' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pymem.h' line='114' column='1' id='type-id-143'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='trash_delete_later' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pymem.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='trash_delete_nesting' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pymem.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='enabled' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pymem.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='debug' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pymem.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='generations' type-id='type-id-151' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pymem.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='generation0' type-id='type-id-147' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pymem.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='permanent_generation' type-id='type-id-152' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pymem.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='generation_stats' type-id='type-id-153' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pymem.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='collecting' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pymem.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='garbage' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pymem.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='callbacks' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pymem.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='long_lived_total' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pymem.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='long_lived_pending' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pymem.h' line='145' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='gc_generation' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pymem.h' line='97' column='1' id='type-id-152'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-149' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pymem.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='threshold' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pymem.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='count' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pymem.h' line='100' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-152' size-in-bits='576' id='type-id-151'>
      <subrange length='3' type-id='type-id-23' id='type-id-154'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-155' size-in-bits='576' id='type-id-153'>
      <subrange length='3' type-id='type-id-23' id='type-id-154'/>
    </array-type-def>
    <typedef-decl name='PyGC_Head' type-id='type-id-156' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/objimpl.h' line='54' column='1' id='type-id-149'/>
    <typedef-decl name='_PyRuntimeState' type-id='type-id-157' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='249' column='1' id='type-id-150'/>
    <class-decl name='gc_generation_stats' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pymem.h' line='105' column='1' id='type-id-155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='collections' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pymem.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='collected' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pymem.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uncollectable' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pymem.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='pyruntimestate' size-in-bits='11712' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='195' column='1' id='type-id-157'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='preinitializing' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='preinitialized' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='core_initialized' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='initialized' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='finalizing' type-id='type-id-158' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='interpreters' type-id='type-id-159' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='xidregistry' type-id='type-id-160' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='main_thread' type-id='type-id-23' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='exitfuncs' type-id='type-id-161' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='nexitfuncs' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='gc' type-id='type-id-143' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='ceval' type-id='type-id-162' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10880'>
        <var-decl name='gilstate' type-id='type-id-163' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11200'>
        <var-decl name='preconfig' type-id='type-id-164' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11520'>
        <var-decl name='open_code_hook' type-id='type-id-165' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11584'>
        <var-decl name='open_code_userdata' type-id='type-id-79' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11648'>
        <var-decl name='audit_hook_head' type-id='type-id-166' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='246' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-149' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/objimpl.h' line='46' column='1' id='type-id-156'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_gc_next' type-id='type-id-137' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/objimpl.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_gc_prev' type-id='type-id-137' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/objimpl.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-167' size-in-bits='64' id='type-id-158'/>
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-166'/>
    <class-decl name='_ceval_runtime_state' size-in-bits='6208' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='43' column='1' id='type-id-162'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='recursion_limit' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tracing_possible' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='eval_breaker' type-id='type-id-169' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='gil_drop_request' type-id='type-id-169' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pending' type-id='type-id-170' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='signals_pending' type-id='type-id-169' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='gil' type-id='type-id-171' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_gilstate_runtime_state' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='171' column='1' id='type-id-163'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='check_enabled' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tstate_current' type-id='type-id-172' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='getframe' type-id='type-id-173' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='autoInterpreterState' type-id='type-id-174' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='autoTSSkey' type-id='type-id-175' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='182' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_xidregistry' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='227' column='1' id='type-id-160'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mutex' type-id='type-id-176' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='head' type-id='type-id-177' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='229' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='pyinterpreters' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='212' column='1' id='type-id-159'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mutex' type-id='type-id-176' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='head' type-id='type-id-174' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='main' type-id='type-id-174' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='next_id' type-id='type-id-178' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='224' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyPreConfig' type-id='type-id-179' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='121' column='1' id='type-id-164'/>
    <typedef-decl name='Py_OpenCodeHookFunction' type-id='type-id-104' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/fileobject.h' line='24' column='1' id='type-id-165'/>
    <array-type-def dimensions='1' type-id='type-id-180' size-in-bits='2048' id='type-id-161'>
      <subrange length='32' type-id='type-id-23' id='type-id-181'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-174'/>
    <pointer-type-def type-id='type-id-183' size-in-bits='64' id='type-id-177'/>
    <class-decl name='_Py_AuditHookEntry' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='163' column='1' id='type-id-168'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-166' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hookCFunction' type-id='type-id-184' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='userData' type-id='type-id-79' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='166' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_gil_runtime_state' size-in-bits='1664' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_gil.h' line='23' column='1' id='type-id-171'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='interval' type-id='type-id-23' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_gil.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='last_holder' type-id='type-id-172' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_gil.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='locked' type-id='type-id-169' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_gil.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='switch_number' type-id='type-id-23' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_gil.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cond' type-id='type-id-185' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_gil.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='mutex' type-id='type-id-186' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_gil.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='switch_cond' type-id='type-id-185' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_gil.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='switch_mutex' type-id='type-id-186' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_gil.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_pending_calls' size-in-bits='4352' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='25' column='1' id='type-id-170'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='finishing' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lock' type-id='type-id-176' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='calls_to_do' type-id='type-id-169' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='async_exc' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='calls' type-id='type-id-187' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='first' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4320'>
        <var-decl name='last' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='40' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='320' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-164' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='47' column='1' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_config_init' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='parse_argv' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='isolated' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='use_environment' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='configure_locale' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='coerce_c_locale' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='coerce_c_locale_warn' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='utf8_mode' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dev_mode' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='allocator' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='120' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyThreadFrameGetter' type-id='type-id-188' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='188' column='1' id='type-id-173'/>
    <typedef-decl name='PyThreadState' type-id='type-id-189' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/pystate.h' line='23' column='1' id='type-id-167'/>
    <typedef-decl name='PyThread_type_lock' type-id='type-id-79' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/pythread.h' line='5' column='1' id='type-id-176'/>
    <typedef-decl name='Py_tss_t' type-id='type-id-190' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/pythread.h' line='115' column='1' id='type-id-175'/>
    <typedef-decl name='_Py_atomic_address' type-id='type-id-191' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_atomic.h' line='48' column='1' id='type-id-172'/>
    <typedef-decl name='_Py_atomic_int' type-id='type-id-192' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_atomic.h' line='52' column='1' id='type-id-169'/>
    <typedef-decl name='int64_t' type-id='type-id-193' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='27' column='1' id='type-id-178'/>
    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-180'/>
    <array-type-def dimensions='1' type-id='type-id-195' size-in-bits='4096' id='type-id-187'>
      <subrange length='32' type-id='type-id-23' id='type-id-181'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-196' size-in-bits='64' id='type-id-188'/>
    <class-decl name='_Py_atomic_address' size-in-bits='64' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_atomic.h' line='46' column='1' id='type-id-191'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_value' type-id='type-id-197' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_atomic.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_Py_atomic_int' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_atomic.h' line='50' column='1' id='type-id-192'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_value' type-id='type-id-198' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_atomic.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_Py_tss_t' size-in-bits='64' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/pythread.h' line='135' column='1' id='type-id-190'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_is_initialized' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/pythread.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='_key' type-id='type-id-199' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/pythread.h' line='137' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_ts' size-in-bits='2112' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='51' column='1' id='type-id-189'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prev' type-id='type-id-200' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-200' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='interp' type-id='type-id-174' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='frame' type-id='type-id-201' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='recursion_depth' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='overflowed' type-id='type-id-82' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='296'>
        <var-decl name='recursion_critical' type-id='type-id-82' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='stackcheck_counter' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='tracing' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='use_tracing' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='c_profilefunc' type-id='type-id-202' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='c_tracefunc' type-id='type-id-202' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='c_profileobj' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='c_traceobj' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='curexc_type' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='curexc_value' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='curexc_traceback' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='exc_state' type-id='type-id-203' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='exc_info' type-id='type-id-204' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='dict' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='gilstate_counter' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='async_exc' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='thread_id' type-id='type-id-23' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='trash_delete_nesting' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='trash_delete_later' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='on_delete' type-id='type-id-58' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='on_delete_data' type-id='type-id-79' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='coroutine_origin_tracking_depth' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='async_gen_firstiter' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='async_gen_finalizer' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='context' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='context_ver' type-id='type-id-205' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='id' type-id='type-id-205' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='136' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_xidregitem' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='155' column='1' id='type-id-183'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cls' type-id='type-id-146' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='getdata' type-id='type-id-206' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='next' type-id='type-id-177' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='158' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyInterpreterState' type-id='type-id-207' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/pystate.h' line='25' column='1' id='type-id-182'/>
    <typedef-decl name='Py_AuditHookFunction' type-id='type-id-208' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/sysmodule.h' line='14' column='1' id='type-id-184'/>
    <typedef-decl name='__int64_t' type-id='type-id-53' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='43' column='1' id='type-id-193'/>
    <typedef-decl name='pthread_cond_t' type-id='type-id-209' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='80' column='1' id='type-id-185'/>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-210' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='72' column='1' id='type-id-186'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-204'/>
    <pointer-type-def type-id='type-id-211' size-in-bits='64' id='type-id-201'/>
    <pointer-type-def type-id='type-id-189' size-in-bits='64' id='type-id-200'/>
    <type-decl name='atomic_int' size-in-bits='32' id='type-id-198'/>
    <type-decl name='atomic_uintptr_t' size-in-bits='64' id='type-id-197'/>
    <class-decl name='_is' size-in-bits='21696' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='67' column='1' id='type-id-207'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-212' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tstate_head' type-id='type-id-200' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='id' type-id='type-id-178' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='id_refcount' type-id='type-id-178' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='requires_idref' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='id_mutex' type-id='type-id-176' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='finalizing' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='modules' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='modules_by_index' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='sysdict' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='builtins' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='importlib' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='check_interval' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='num_threads' type-id='type-id-53' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='pythread_stacksize' type-id='type-id-138' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='codec_search_path' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='codec_search_cache' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='codec_error_registry' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='codecs_initialized' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='fs_codec' type-id='type-id-213' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='config' type-id='type-id-214' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='dlopenflags' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='dict' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='builtins_copy' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='import_func' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='eval_frame' type-id='type-id-215' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='co_extra_user_count' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='co_extra_freefuncs' type-id='type-id-216' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20992'>
        <var-decl name='before_forkers' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21056'>
        <var-decl name='after_forkers_parent' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21120'>
        <var-decl name='after_forkers_child' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21184'>
        <var-decl name='pyexitfunc' type-id='type-id-57' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21248'>
        <var-decl name='pyexitmodule' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21312'>
        <var-decl name='tstate_next_unique_id' type-id='type-id-205' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21376'>
        <var-decl name='warnings' type-id='type-id-217' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21632'>
        <var-decl name='audit_hooks' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='137' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='35' column='1' id='type-id-195'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='func' type-id='type-id-218' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-79' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='37' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-208'/>
    <typedef-decl name='Py_tracefunc' type-id='type-id-220' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='19' column='1' id='type-id-202'/>
    <typedef-decl name='_PyErr_StackItem' type-id='type-id-221' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='47' column='1' id='type-id-203'/>
    <typedef-decl name='crossinterpdatafunc' type-id='type-id-222' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='244' column='1' id='type-id-206'/>
    <typedef-decl name='pthread_key_t' type-id='type-id-38' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='49' column='1' id='type-id-199'/>
    <typedef-decl name='uint64_t' type-id='type-id-223' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='27' column='1' id='type-id-205'/>
    <union-decl name='__anonymous_union__' size-in-bits='384' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='75' column='1' id='type-id-209'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-224' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='77' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-225' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='78' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-226' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='79' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__3' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='67' column='1' id='type-id-210'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-227' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-228' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-53' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-212'/>
    <array-type-def dimensions='1' type-id='type-id-82' size-in-bits='320' id='type-id-228'>
      <subrange length='40' type-id='type-id-23' id='type-id-229'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-82' size-in-bits='384' id='type-id-225'>
      <subrange length='48' type-id='type-id-23' id='type-id-230'/>
    </array-type-def>
    <class-decl name='__pthread_cond_s' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='171' column='1' id='type-id-224'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-231' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='type-id-232' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__g_refs' type-id='type-id-233' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__g_size' type-id='type-id-233' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='__g1_orig_size' type-id='type-id-38' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__wrefs' type-id='type-id-38' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='__g_signals' type-id='type-id-233' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='195' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='118' column='1' id='type-id-227'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-80' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-38' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-80' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-38' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-80' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-234' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-234' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-235' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='155' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_err_stackitem' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='36' column='1' id='type-id-221'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='exc_type' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='exc_value' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='exc_traceback' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='previous_item' type-id='type-id-236' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/pystate.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_frame' size-in-bits='2944' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/frameobject.h' line='16' column='1' id='type-id-211'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-8' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/frameobject.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='f_back' type-id='type-id-201' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/frameobject.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='f_code' type-id='type-id-237' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/frameobject.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='f_builtins' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/frameobject.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='f_globals' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/frameobject.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='f_locals' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/frameobject.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='f_valuestack' type-id='type-id-238' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/frameobject.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='f_stacktop' type-id='type-id-238' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/frameobject.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='f_trace' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/frameobject.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='f_trace_lines' type-id='type-id-82' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/frameobject.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='712'>
        <var-decl name='f_trace_opcodes' type-id='type-id-82' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/frameobject.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='f_gen' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/frameobject.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='f_lasti' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/frameobject.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='f_lineno' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/frameobject.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='f_iblock' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/frameobject.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='f_executing' type-id='type-id-82' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/frameobject.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='f_blockstack' type-id='type-id-239' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/frameobject.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='f_localsplus' type-id='type-id-240' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/frameobject.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_warnings_runtime_state' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_warnings.h' line='13' column='1' id='type-id-217'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='filters' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_warnings.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='once_registry' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_warnings.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='default_action' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_warnings.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='filters_version' type-id='type-id-53' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_warnings.h' line='19' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='103' column='1' id='type-id-213'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='encoding' type-id='type-id-241' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='errors' type-id='type-id-241' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='error_handler' type-id='type-id-242' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='106' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-37' size-in-bits='16320' id='type-id-216'>
      <subrange length='255' type-id='type-id-23' id='type-id-243'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-244' size-in-bits='64' id='type-id-220'/>
    <pointer-type-def type-id='type-id-245' size-in-bits='64' id='type-id-222'/>
    <pointer-type-def type-id='type-id-246' size-in-bits='64' id='type-id-218'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-226'/>
    <typedef-decl name='PyConfig' type-id='type-id-247' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='405' column='1' id='type-id-214'/>
    <typedef-decl name='_PyFrameEvalFunction' type-id='type-id-248' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pystate.h' line='64' column='1' id='type-id-215'/>
    <typedef-decl name='__uint64_t' type-id='type-id-23' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='44' column='1' id='type-id-223'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-237'/>
    <pointer-type-def type-id='type-id-250' size-in-bits='64' id='type-id-248'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-238'/>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='64' id='type-id-240'>
      <subrange length='1' type-id='type-id-23' id='type-id-251'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-252' size-in-bits='1920' id='type-id-239'>
      <subrange length='20' type-id='type-id-23' id='type-id-253'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-221' size-in-bits='64' id='type-id-236'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-241'/>
    <class-decl name='__anonymous_struct__7' size-in-bits='2880' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-214' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='129' column='1' id='type-id-247'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_config_init' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='isolated' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='use_environment' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dev_mode' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='install_signal_handlers' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='use_hash_seed' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='hash_seed' type-id='type-id-23' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='faulthandler' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='tracemalloc' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='import_time' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='show_ref_count' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='show_alloc_count' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='dump_refs' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='malloc_stats' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='filesystem_encoding' type-id='type-id-254' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='filesystem_errors' type-id='type-id-254' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='pycache_prefix' type-id='type-id-254' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='parse_argv' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='argv' type-id='type-id-255' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='program_name' type-id='type-id-254' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='xoptions' type-id='type-id-255' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='warnoptions' type-id='type-id-255' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='site_import' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='bytes_warning' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='inspect' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='interactive' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='optimization_level' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='parser_debug' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='write_bytecode' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='verbose' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='quiet' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='user_site_directory' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='configure_c_stdio' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='buffered_stdio' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='stdio_encoding' type-id='type-id-254' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='stdio_errors' type-id='type-id-254' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='check_hash_pycs_mode' type-id='type-id-254' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='pathconfig_warnings' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='pythonpath_env' type-id='type-id-254' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='367' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='home' type-id='type-id-254' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='368' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='module_search_paths_set' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='module_search_paths' type-id='type-id-255' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='374' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='executable' type-id='type-id-254' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='base_executable' type-id='type-id-254' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='379' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='prefix' type-id='type-id-254' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='base_prefix' type-id='type-id-254' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='381' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='exec_prefix' type-id='type-id-254' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='382' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='base_exec_prefix' type-id='type-id-254' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='skip_source_first_line' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='run_command' type-id='type-id-254' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='run_module' type-id='type-id-254' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='run_filename' type-id='type-id-254' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='395' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='_install_importlib' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2848'>
        <var-decl name='_init_main' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='404' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-234'/>
    <typedef-decl name='_Py_error_handler' type-id='type-id-256' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/fileutils.h' line='33' column='1' id='type-id-242'/>
    <typedef-decl name='__pthread_list_t' type-id='type-id-257' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='86' column='1' id='type-id-235'/>
    <union-decl name='__anonymous_union__2' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='182' column='1' id='type-id-232'>
      <data-member access='private'>
        <var-decl name='__g1_start' type-id='type-id-258' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='184' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__g1_start32' type-id='type-id-259' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='189' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='173' column='1' id='type-id-231'>
      <data-member access='private'>
        <var-decl name='__wseq' type-id='type-id-258' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='175' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__wseq32' type-id='type-id-259' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='180' column='1'/>
      </data-member>
    </union-decl>
    <array-type-def dimensions='1' type-id='type-id-38' size-in-bits='64' id='type-id-233'>
      <subrange length='2' type-id='type-id-23' id='type-id-260'/>
    </array-type-def>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='82' column='1' id='type-id-257'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-261' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-261' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='85' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='185' column='1' id='type-id-259'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__low' type-id='type-id-38' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__high' type-id='type-id-38' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='188' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/fileutils.h' line='23' column='1' id='type-id-256'>
      <underlying-type type-id='type-id-142'/>
      <enumerator name='_Py_ERROR_UNKNOWN' value='0'/>
      <enumerator name='_Py_ERROR_STRICT' value='1'/>
      <enumerator name='_Py_ERROR_SURROGATEESCAPE' value='2'/>
      <enumerator name='_Py_ERROR_REPLACE' value='3'/>
      <enumerator name='_Py_ERROR_IGNORE' value='4'/>
      <enumerator name='_Py_ERROR_BACKSLASHREPLACE' value='5'/>
      <enumerator name='_Py_ERROR_SURROGATEPASS' value='6'/>
      <enumerator name='_Py_ERROR_XMLCHARREFREPLACE' value='7'/>
      <enumerator name='_Py_ERROR_OTHER' value='8'/>
    </enum-decl>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-258'/>
    <typedef-decl name='PyCodeObject' type-id='type-id-262' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='69' column='1' id='type-id-249'/>
    <typedef-decl name='PyTryBlock' type-id='type-id-263' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/frameobject.h' line='14' column='1' id='type-id-252'/>
    <typedef-decl name='PyWideStringList' type-id='type-id-264' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='36' column='1' id='type-id-255'/>
    <pointer-type-def type-id='type-id-265' size-in-bits='64' id='type-id-254'/>
    <pointer-type-def type-id='type-id-257' size-in-bits='64' id='type-id-261'/>
    <class-decl name='__anonymous_struct__' size-in-bits='1408' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-249' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='23' column='1' id='type-id-262'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-2' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='co_argcount' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='co_posonlyargcount' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='co_kwonlyargcount' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='co_nlocals' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='co_stacksize' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='co_flags' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='co_firstlineno' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='co_code' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='co_consts' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='co_names' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='co_varnames' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='co_freevars' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='co_cellvars' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='co_cell2arg' type-id='type-id-136' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='co_filename' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='co_name' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='co_lnotab' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='co_zombieframe' type-id='type-id-79' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='co_weakreflist' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='co_extra' type-id='type-id-79' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='co_opcache_map' type-id='type-id-266' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='co_opcache' type-id='type-id-267' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='co_opcache_flag' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='co_opcache_size' type-id='type-id-268' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='68' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-255' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='31' column='1' id='type-id-264'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='items' type-id='type-id-269' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/cpython/initconfig.h' line='35' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='96' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-252' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/frameobject.h' line='10' column='1' id='type-id-263'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='b_type' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/frameobject.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='b_handler' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/frameobject.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='b_level' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/frameobject.h' line='13' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wchar_t' type-id='type-id-80' filepath='/usr/lib/gcc/x86_64-linux-gnu/7/include/stddef.h' line='328' column='1' id='type-id-265'/>
    <pointer-type-def type-id='type-id-270' size-in-bits='64' id='type-id-267'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-268'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-266'/>
    <pointer-type-def type-id='type-id-254' size-in-bits='64' id='type-id-269'/>
    <typedef-decl name='_PyOpcache' type-id='type-id-271' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/code.h' line='20' column='1' id='type-id-270'/>
    <class-decl name='_PyOpcache' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_code.h' line='13' column='1' id='type-id-271'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='u' type-id='type-id-272' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_code.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='optimized' type-id='type-id-82' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_code.h' line='17' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='192' is-anonymous='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_code.h' line='14' column='1' id='type-id-272'>
      <data-member access='private'>
        <var-decl name='lg' type-id='type-id-273' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_code.h' line='15' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='_PyOpcache_LoadGlobal' type-id='type-id-274' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_code.h' line='11' column='1' id='type-id-273'/>
    <class-decl name='__anonymous_struct__1' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-273' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_code.h' line='7' column='1' id='type-id-274'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ptr' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_code.h' line='8' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='globals_ver' type-id='type-id-205' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_code.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='builtins_ver' type-id='type-id-205' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_code.h' line='10' column='1'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/getbuildinfo.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='type-id-82'/>
    <type-decl name='void' id='type-id-106'/>
    <qualified-type-def type-id='type-id-82' const='yes' id='type-id-50'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-9'/>
    <function-decl name='Py_GetBuildInfo' mangled-name='Py_GetBuildInfo' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/getbuildinfo.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetBuildInfo'>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_Py_gitidentifier' mangled-name='_Py_gitidentifier' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/getbuildinfo.c' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_gitidentifier'>
      <return type-id='type-id-9'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/getpath.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <pointer-type-def type-id='type-id-275' size-in-bits='64' id='type-id-276'/>
    <function-decl name='_PyPathConfig_Calculate' mangled-name='_PyPathConfig_Calculate' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/getpath.c' line='1342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyPathConfig_Calculate'>
      <parameter type-id='type-id-276' name='pathconfig' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/getpath.c' line='1342' column='1'/>
      <parameter type-id='type-id-277' name='config' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/getpath.c' line='1342' column='1'/>
      <return type-id='type-id-139'/>
    </function-decl>
    <pointer-type-def type-id='type-id-278' size-in-bits='64' id='type-id-277'/>
    <typedef-decl name='_PyPathConfig' type-id='type-id-279' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pathconfig.h' line='31' column='1' id='type-id-275'/>
    <class-decl name='_PyPathConfig' size-in-bits='384' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pathconfig.h' line='11' column='1' id='type-id-279'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='program_full_path' type-id='type-id-254' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pathconfig.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prefix' type-id='type-id-254' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pathconfig.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='exec_prefix' type-id='type-id-254' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pathconfig.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='module_search_path' type-id='type-id-254' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pathconfig.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='program_name' type-id='type-id-254' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pathconfig.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='home' type-id='type-id-254' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/internal/pycore_pathconfig.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-214' const='yes' id='type-id-278'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <typedef-decl name='_Py_hashtable_t' type-id='type-id-280' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.h' line='102' column='1' id='type-id-281'/>
    <class-decl name='_Py_hashtable_t' size-in-bits='576' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.h' line='92' column='1' id='type-id-280'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num_buckets' type-id='type-id-138' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='entries' type-id='type-id-138' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='buckets' type-id='type-id-282' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='key_size' type-id='type-id-138' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='data_size' type-id='type-id-138' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='hash_func' type-id='type-id-283' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='compare_func' type-id='type-id-284' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='alloc' type-id='type-id-285' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.h' line='101' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_Py_slist_t' type-id='type-id-286' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.h' line='14' column='1' id='type-id-287'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-287' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.h' line='12' column='1' id='type-id-286'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-288' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.h' line='13' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_Py_slist_item_t' type-id='type-id-289' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.h' line='10' column='1' id='type-id-290'/>
    <class-decl name='_Py_slist_item_s' size-in-bits='64' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.h' line='8' column='1' id='type-id-289'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-291' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.h' line='9' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_Py_hashtable_hash_func' type-id='type-id-292' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.h' line='75' column='1' id='type-id-283'/>
    <typedef-decl name='Py_uhash_t' type-id='type-id-138' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Include/pyport.h' line='117' column='1' id='type-id-293'/>
    <typedef-decl name='_Py_hashtable_compare_func' type-id='type-id-294' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.h' line='77' column='1' id='type-id-284'/>
    <typedef-decl name='_Py_hashtable_entry_t' type-id='type-id-295' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.h' line='30' column='1' id='type-id-296'/>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-296' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.h' line='23' column='1' id='type-id-295'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_Py_slist_item' type-id='type-id-290' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='key_hash' type-id='type-id-293' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.h' line='27' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_Py_hashtable_allocator_t' type-id='type-id-297' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.h' line='87' column='1' id='type-id-285'/>
    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-285' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.h' line='81' column='1' id='type-id-297'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='malloc' type-id='type-id-298' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='free' type-id='type-id-58' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.h' line='86' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_Py_hashtable_foreach_func' type-id='type-id-299' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.h' line='136' column='1' id='type-id-300'/>
    <pointer-type-def type-id='type-id-285' size-in-bits='64' id='type-id-301'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' id='type-id-302'/>
    <pointer-type-def type-id='type-id-280' size-in-bits='64' id='type-id-303'/>
    <pointer-type-def type-id='type-id-289' size-in-bits='64' id='type-id-291'/>
    <pointer-type-def type-id='type-id-290' size-in-bits='64' id='type-id-288'/>
    <pointer-type-def type-id='type-id-287' size-in-bits='64' id='type-id-282'/>
    <qualified-type-def type-id='type-id-296' const='yes' id='type-id-304'/>
    <pointer-type-def type-id='type-id-304' size-in-bits='64' id='type-id-305'/>
    <pointer-type-def type-id='type-id-306' size-in-bits='64' id='type-id-299'/>
    <pointer-type-def type-id='type-id-307' size-in-bits='64' id='type-id-294'/>
    <pointer-type-def type-id='type-id-308' size-in-bits='64' id='type-id-292'/>
    <pointer-type-def type-id='type-id-309' size-in-bits='64' id='type-id-298'/>
    <function-decl name='_Py_hashtable_copy' mangled-name='_Py_hashtable_copy' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='494' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_copy'>
      <parameter type-id='type-id-303' name='src' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='494' column='1'/>
      <return type-id='type-id-303'/>
    </function-decl>
    <function-decl name='_Py_hashtable_destroy' mangled-name='_Py_hashtable_destroy' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='475' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_destroy'>
      <parameter type-id='type-id-303' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='475' column='1'/>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='_Py_hashtable_clear' mangled-name='_Py_hashtable_clear' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='457' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_clear'>
      <parameter type-id='type-id-303' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='457' column='1'/>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='_Py_hashtable_foreach' mangled-name='_Py_hashtable_foreach' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='394' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_foreach'>
      <parameter type-id='type-id-303' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='394' column='1'/>
      <parameter type-id='type-id-300' name='func' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='395' column='1'/>
      <parameter type-id='type-id-79' name='arg' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='396' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='_Py_hashtable_pop' mangled-name='_Py_hashtable_pop' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_pop'>
      <parameter type-id='type-id-303' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='370' column='1'/>
      <parameter type-id='type-id-138' name='key_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='370' column='1'/>
      <parameter type-id='type-id-79' name='pkey' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='370' column='1'/>
      <parameter type-id='type-id-138' name='data_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='371' column='1'/>
      <parameter type-id='type-id-79' name='data' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='371' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='_Py_hashtable_get' mangled-name='_Py_hashtable_get' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='354' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_get'>
      <parameter type-id='type-id-303' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='354' column='1'/>
      <parameter type-id='type-id-138' name='key_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='354' column='1'/>
      <parameter type-id='type-id-79' name='pkey' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='354' column='1'/>
      <parameter type-id='type-id-138' name='data_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='355' column='1'/>
      <parameter type-id='type-id-79' name='data' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='355' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='_Py_hashtable_set' mangled-name='_Py_hashtable_set' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='312' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_set'>
      <parameter type-id='type-id-303' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='312' column='1'/>
      <parameter type-id='type-id-138' name='key_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='312' column='1'/>
      <parameter type-id='type-id-79' name='pkey' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='312' column='1'/>
      <parameter type-id='type-id-138' name='data_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='313' column='1'/>
      <parameter type-id='type-id-79' name='data' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='313' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='_Py_hashtable_get_entry' mangled-name='_Py_hashtable_get_entry' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_get_entry'>
      <parameter type-id='type-id-303' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='253' column='1'/>
      <parameter type-id='type-id-138' name='key_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='254' column='1'/>
      <parameter type-id='type-id-79' name='pkey' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='254' column='1'/>
      <return type-id='type-id-302'/>
    </function-decl>
    <function-decl name='_Py_hashtable_size' mangled-name='_Py_hashtable_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_size'>
      <parameter type-id='type-id-303' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='195' column='1'/>
      <return type-id='type-id-138'/>
    </function-decl>
    <function-decl name='_Py_hashtable_new' mangled-name='_Py_hashtable_new' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='183' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_new'>
      <parameter type-id='type-id-138' name='key_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='183' column='1'/>
      <parameter type-id='type-id-138' name='data_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='183' column='1'/>
      <parameter type-id='type-id-283' name='hash_func' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='184' column='1'/>
      <parameter type-id='type-id-284' name='compare_func' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='185' column='1'/>
      <return type-id='type-id-303'/>
    </function-decl>
    <function-decl name='_Py_hashtable_new_full' mangled-name='_Py_hashtable_new_full' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_new_full'>
      <parameter type-id='type-id-138' name='key_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='141' column='1'/>
      <parameter type-id='type-id-138' name='data_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='141' column='1'/>
      <parameter type-id='type-id-138' name='init_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='142' column='1'/>
      <parameter type-id='type-id-283' name='hash_func' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='143' column='1'/>
      <parameter type-id='type-id-284' name='compare_func' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='144' column='1'/>
      <parameter type-id='type-id-301' name='allocator' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='145' column='1'/>
      <return type-id='type-id-303'/>
    </function-decl>
    <function-decl name='_Py_hashtable_compare_direct' mangled-name='_Py_hashtable_compare_direct' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_compare_direct'>
      <parameter type-id='type-id-303' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='118' column='1'/>
      <parameter type-id='type-id-79' name='pkey' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='118' column='1'/>
      <parameter type-id='type-id-305' name='entry' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='119' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='_Py_hashtable_hash_ptr' mangled-name='_Py_hashtable_hash_ptr' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_hash_ptr'>
      <parameter type-id='type-id-303' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='108' column='1'/>
      <parameter type-id='type-id-79' name='pkey' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/hashtable.c' line='108' column='1'/>
      <return type-id='type-id-293'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-306'>
      <parameter type-id='type-id-303'/>
      <parameter type-id='type-id-302'/>
      <parameter type-id='type-id-79'/>
      <return type-id='type-id-80'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-307'>
      <parameter type-id='type-id-303'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-305'/>
      <return type-id='type-id-80'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-308'>
      <parameter type-id='type-id-303'/>
      <parameter type-id='type-id-79'/>
      <return type-id='type-id-293'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-309'>
      <parameter type-id='type-id-138'/>
      <return type-id='type-id-79'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/itertoolsmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit_itertools' mangled-name='PyInit_itertools' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/itertoolsmodule.c' line='4721' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_itertools'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/main.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='Py_BytesMain' mangled-name='Py_BytesMain' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/main.c' line='691' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_BytesMain'>
      <parameter type-id='type-id-80' name='argc' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/main.c' line='691' column='1'/>
      <parameter type-id='type-id-310' name='argv' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/main.c' line='691' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='Py_Main' mangled-name='Py_Main' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/main.c' line='679' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_Main'>
      <parameter type-id='type-id-80' name='argc' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/main.c' line='679' column='1'/>
      <parameter type-id='type-id-269' name='argv' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/main.c' line='679' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='Py_RunMain' mangled-name='Py_RunMain' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/main.c' line='640' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_RunMain'>
      <return type-id='type-id-80'/>
    </function-decl>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-310'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/posixmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <typedef-decl name='uid_t' type-id='type-id-311' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='80' column='1' id='type-id-312'/>
    <typedef-decl name='gid_t' type-id='type-id-313' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='65' column='1' id='type-id-314'/>
    <function-decl name='PyInit_posix' mangled-name='PyInit_posix' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/posixmodule.c' line='14389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_posix'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_Gid_Converter' mangled-name='_Py_Gid_Converter' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/posixmodule.c' line='633' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_Gid_Converter'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/posixmodule.c' line='633' column='1'/>
      <parameter type-id='type-id-79' name='p' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/posixmodule.c' line='633' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='_Py_Uid_Converter' mangled-name='_Py_Uid_Converter' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/posixmodule.c' line='527' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_Uid_Converter'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/posixmodule.c' line='527' column='1'/>
      <parameter type-id='type-id-79' name='p' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/posixmodule.c' line='527' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyOS_AfterFork' mangled-name='PyOS_AfterFork' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/posixmodule.c' line='493' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_AfterFork'>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='PyOS_AfterFork_Child' mangled-name='PyOS_AfterFork_Child' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/posixmodule.c' line='464' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_AfterFork_Child'>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='PyOS_AfterFork_Parent' mangled-name='PyOS_AfterFork_Parent' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/posixmodule.c' line='455' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_AfterFork_Parent'>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='PyOS_BeforeFork' mangled-name='PyOS_BeforeFork' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/posixmodule.c' line='447' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_BeforeFork'>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='_PyLong_FromUid' mangled-name='_PyLong_FromUid' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/posixmodule.c' line='511' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyLong_FromUid'>
      <parameter type-id='type-id-312' name='uid' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/posixmodule.c' line='511' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyLong_FromGid' mangled-name='_PyLong_FromGid' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/posixmodule.c' line='519' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyLong_FromGid'>
      <parameter type-id='type-id-314' name='gid' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/posixmodule.c' line='519' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_Sigset_Converter' mangled-name='_Py_Sigset_Converter' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/posixmodule.c' line='1286' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_Sigset_Converter'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/posixmodule.c' line='1286' column='1'/>
      <parameter type-id='type-id-79' name='addr' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/posixmodule.c' line='1286' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyOS_FSPath' mangled-name='PyOS_FSPath' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/posixmodule.c' line='13311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_FSPath'>
      <parameter type-id='type-id-1' name='path' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/posixmodule.c' line='13311' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <typedef-decl name='__gid_t' type-id='type-id-38' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='135' column='1' id='type-id-313'/>
    <typedef-decl name='__uid_t' type-id='type-id-38' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='134' column='1' id='type-id-311'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/pwdmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit_pwd' mangled-name='PyInit_pwd' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/pwdmodule.c' line='327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_pwd'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/signalmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='_PyOS_IsMainThread' mangled-name='_PyOS_IsMainThread' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/signalmodule.c' line='1761' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyOS_IsMainThread'>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='_PySignal_AfterFork' mangled-name='_PySignal_AfterFork' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/signalmodule.c' line='1752' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySignal_AfterFork'>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='PyOS_InterruptOccurred' mangled-name='PyOS_InterruptOccurred' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/signalmodule.c' line='1726' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_InterruptOccurred'>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyOS_FiniInterrupts' mangled-name='PyOS_FiniInterrupts' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/signalmodule.c' line='1720' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_FiniInterrupts'>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='PyOS_InitInterrupts' mangled-name='PyOS_InitInterrupts' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/signalmodule.c' line='1711' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_InitInterrupts'>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='PyErr_SetInterrupt' mangled-name='PyErr_SetInterrupt' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/signalmodule.c' line='1702' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_SetInterrupt'>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='PyErr_CheckSignals' mangled-name='PyErr_CheckSignals' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/signalmodule.c' line='1632' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_CheckSignals'>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyInit__signal' mangled-name='PyInit__signal' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/signalmodule.c' line='1330' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__signal'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySignal_SetWakeupFd' mangled-name='PySignal_SetWakeupFd' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/signalmodule.c' line='788' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySignal_SetWakeupFd'>
      <parameter type-id='type-id-80' name='fd' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/signalmodule.c' line='788' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='_PyErr_CheckSignals' mangled-name='_PyErr_CheckSignals' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/signalmodule.c' line='1645' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyErr_CheckSignals'>
      <return type-id='type-id-80'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/symtablemodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__symtable' mangled-name='PyInit__symtable' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/symtablemodule.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__symtable'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/timemodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit_time' mangled-name='PyInit_time' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/timemodule.c' line='1753' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_time'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/xxsubtype.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit_xxsubtype' mangled-name='PyInit_xxsubtype' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Modules/xxsubtype.c' line='311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_xxsubtype'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/spack-build' language='LANG_C99'>
    <qualified-type-def type-id='type-id-241' const='yes' id='type-id-315'/>
    <pointer-type-def type-id='type-id-315' size-in-bits='64' id='type-id-316'/>
    <qualified-type-def type-id='type-id-317' const='yes' id='type-id-318'/>
    <pointer-type-def type-id='type-id-318' size-in-bits='64' id='type-id-319'/>
    <qualified-type-def type-id='type-id-4' const='yes' id='type-id-320'/>
    <pointer-type-def type-id='type-id-320' size-in-bits='64' id='type-id-321'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-322'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-323'/>
    <function-decl name='_Py_FreeCharPArray' mangled-name='_Py_FreeCharPArray' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2686' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_FreeCharPArray'>
      <parameter type-id='type-id-316' name='array' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2686' column='1'/>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='_PySequence_BytesToCharpArray' mangled-name='_PySequence_BytesToCharpArray' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2627' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySequence_BytesToCharpArray'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2627' column='1'/>
      <return type-id='type-id-316'/>
    </function-decl>
    <function-decl name='PyIter_Check' mangled-name='PyIter_Check' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2592' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyIter_Check'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2592' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='_PyObject_RealIsSubclass' mangled-name='_PyObject_RealIsSubclass' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2558' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_RealIsSubclass'>
      <parameter type-id='type-id-1' name='derived' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2558' column='1'/>
      <parameter type-id='type-id-1' name='cls' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2558' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='_PyObject_RealIsInstance' mangled-name='_PyObject_RealIsInstance' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2552' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_RealIsInstance'>
      <parameter type-id='type-id-1' name='inst' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2552' column='1'/>
      <parameter type-id='type-id-1' name='cls' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2552' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyObject_IsSubclass' mangled-name='PyObject_IsSubclass' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2496' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_IsSubclass'>
      <parameter type-id='type-id-1' name='derived' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2496' column='1'/>
      <parameter type-id='type-id-1' name='cls' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2496' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyObject_IsInstance' mangled-name='PyObject_IsInstance' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2421' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_IsInstance'>
      <parameter type-id='type-id-1' name='inst' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2421' column='1'/>
      <parameter type-id='type-id-1' name='cls' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2421' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyMapping_Values' mangled-name='PyMapping_Values' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2275' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Values'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2275' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyMapping_Items' mangled-name='PyMapping_Items' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2261' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Items'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2261' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyMapping_Keys' mangled-name='PyMapping_Keys' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Keys'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2247' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyMapping_HasKey' mangled-name='PyMapping_HasKey' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2202' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_HasKey'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2202' column='1'/>
      <parameter type-id='type-id-1' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2202' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyMapping_HasKeyString' mangled-name='PyMapping_HasKeyString' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_HasKeyString'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2188' column='1'/>
      <parameter type-id='type-id-9' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2188' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyMapping_SetItemString' mangled-name='PyMapping_SetItemString' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2169' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_SetItemString'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2169' column='1'/>
      <parameter type-id='type-id-9' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2169' column='1'/>
      <parameter type-id='type-id-1' name='value' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2169' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyMapping_Length' mangled-name='PyMapping_Length' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Length'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2145' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyMapping_Check' mangled-name='PyMapping_Check' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Check'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2111' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PySequence_Index' mangled-name='PySequence_Index' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2103' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Index'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2103' column='1'/>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2103' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySequence_In' mangled-name='PySequence_In' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2097' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_In'>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2097' column='1'/>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2097' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PySequence_Count' mangled-name='PySequence_Count' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2075' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Count'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2075' column='1'/>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='2075' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySequence_Fast' mangled-name='PySequence_Fast' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='1959' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Fast'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='1959' column='1'/>
      <parameter type-id='type-id-9' name='m' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='1959' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_Tuple' mangled-name='PySequence_Tuple' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='1852' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Tuple'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='1852' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_DelSlice' mangled-name='PySequence_DelSlice' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='1828' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_DelSlice'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='1828' column='1'/>
      <parameter type-id='type-id-4' name='i1' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='1828' column='1'/>
      <parameter type-id='type-id-4' name='i2' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='1828' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PySequence_SetSlice' mangled-name='PySequence_SetSlice' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='1803' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_SetSlice'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='1803' column='1'/>
      <parameter type-id='type-id-4' name='i1' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='1803' column='1'/>
      <parameter type-id='type-id-4' name='i2' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='1803' column='1'/>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.8.0-febktcqyep6adau6h5zhzhkngchsviwn/spack-src/Objects/abstract.c' line='1803' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
