<abi-corpus path='/opt/spack/opt/spack/linux-ubuntu18.04-x86_64/gcc-7.5.0/python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/lib/libpython3.5m.so' architecture='elf-amd-x86_64' soname='libpython3.5m.so.1.0'>
  <elf-needed>
    <dependency name='libssl.so.1.0.0'/>
    <dependency name='libcrypto.so.1.0.0'/>
    <dependency name='libintl.so.8'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libutil.so.1'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='PyAST_Check' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_Compile' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_CompileEx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_CompileObject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_FromNode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_FromNodeObject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_Validate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_PyWeakref_ProxyType' size='400' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyWeakref_RefType' size='400' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_CheckRecursionLimit' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_EllipsisObject' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_FalseStruct' size='32' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_Finalizing' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_HashSecret' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_M__importlib' size='31758' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_M__importlib_external' size='41483' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_NoneStruct' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_NotImplementedStruct' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_PackageContext' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_SwappedOp' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_TrueStruct' size='32' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_abstract_hack' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ascii_whitespace' size='128' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_capitalize__doc__' size='124' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_table' size='1024' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_tolower' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_toupper' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isalnum__doc__' size='132' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isalpha__doc__' size='130' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isdigit__doc__' size='126' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_islower__doc__' size='141' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isspace__doc__' size='130' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_istitle__doc__' size='230' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isupper__doc__' size='141' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_lower__doc__' size='93' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_maketrans__doc__' size='291' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_open_cloexec_works' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_swapcase__doc__' size='123' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_title__doc__' size='155' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_upper__doc__' size='93' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_codecsmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__codecs' mangled-name='PyInit__codecs' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_codecsmodule.c' line='1241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__codecs'>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-1'/>
    <typedef-decl name='PyObject' type-id='type-id-3' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='110' column='1' id='type-id-2'/>
    <class-decl name='_object' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='106' column='1' id='type-id-3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_refcnt' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ob_type' type-id='type-id-5' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-5'/>
    <typedef-decl name='Py_ssize_t' type-id='type-id-7' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/pyport.h' line='177' column='1' id='type-id-4'/>
    <class-decl name='_typeobject' size-in-bits='3200' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='343' column='1' id='type-id-6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-8' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='344' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tp_name' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='345' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tp_basicsize' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tp_itemsize' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tp_dealloc' type-id='type-id-10' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='350' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tp_print' type-id='type-id-11' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='tp_getattr' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='352' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tp_setattr' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='353' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='tp_as_async' type-id='type-id-14' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='354' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='tp_repr' type-id='type-id-15' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='355' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='tp_as_number' type-id='type-id-16' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='tp_as_sequence' type-id='type-id-17' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='360' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='tp_as_mapping' type-id='type-id-18' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='361' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='tp_hash' type-id='type-id-19' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='tp_call' type-id='type-id-20' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='366' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='tp_str' type-id='type-id-15' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='367' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='tp_getattro' type-id='type-id-21' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='368' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='tp_setattro' type-id='type-id-22' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='369' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='tp_as_buffer' type-id='type-id-23' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='tp_flags' type-id='type-id-24' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='375' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='tp_doc' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='377' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='tp_traverse' type-id='type-id-25' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='381' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='tp_clear' type-id='type-id-26' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='384' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='tp_richcompare' type-id='type-id-27' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='388' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='tp_weaklistoffset' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='tp_iter' type-id='type-id-28' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='tp_iternext' type-id='type-id-29' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='395' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='tp_methods' type-id='type-id-30' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='398' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='tp_members' type-id='type-id-31' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='tp_getset' type-id='type-id-32' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='400' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='tp_base' type-id='type-id-5' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='tp_dict' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='tp_descr_get' type-id='type-id-33' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tp_descr_set' type-id='type-id-34' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='tp_dictoffset' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='tp_init' type-id='type-id-35' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='tp_alloc' type-id='type-id-36' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='tp_new' type-id='type-id-37' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='tp_free' type-id='type-id-38' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='tp_is_gc' type-id='type-id-26' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='tp_bases' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='tp_mro' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='tp_cache' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='tp_subclasses' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='tp_weaklist' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='tp_del' type-id='type-id-10' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='tp_version_tag' type-id='type-id-39' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='tp_finalize' type-id='type-id-10' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='421' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ssize_t' type-id='type-id-40' filepath='/usr/include/stdio.h' line='71' column='1' id='type-id-7'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-14'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-23'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-32'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-30'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-16'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-9'/>
    <typedef-decl name='PyVarObject' type-id='type-id-50' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='115' column='1' id='type-id-8'/>
    <typedef-decl name='__ssize_t' type-id='type-id-51' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='181' column='1' id='type-id-40'/>
    <typedef-decl name='allocfunc' type-id='type-id-52' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='338' column='1' id='type-id-36'/>
    <typedef-decl name='descrgetfunc' type-id='type-id-53' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='334' column='1' id='type-id-33'/>
    <typedef-decl name='descrsetfunc' type-id='type-id-54' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='335' column='1' id='type-id-34'/>
    <typedef-decl name='destructor' type-id='type-id-55' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='317' column='1' id='type-id-10'/>
    <typedef-decl name='freefunc' type-id='type-id-56' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='316' column='1' id='type-id-38'/>
    <typedef-decl name='getattrfunc' type-id='type-id-57' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='325' column='1' id='type-id-12'/>
    <typedef-decl name='getattrofunc' type-id='type-id-58' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='326' column='1' id='type-id-21'/>
    <typedef-decl name='getiterfunc' type-id='type-id-59' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='332' column='1' id='type-id-28'/>
    <typedef-decl name='hashfunc' type-id='type-id-60' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='330' column='1' id='type-id-19'/>
    <typedef-decl name='initproc' type-id='type-id-54' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='336' column='1' id='type-id-35'/>
    <typedef-decl name='inquiry' type-id='type-id-61' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='169' column='1' id='type-id-26'/>
    <typedef-decl name='iternextfunc' type-id='type-id-59' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='333' column='1' id='type-id-29'/>
    <typedef-decl name='newfunc' type-id='type-id-62' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='337' column='1' id='type-id-37'/>
    <typedef-decl name='printfunc' type-id='type-id-63' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='323' column='1' id='type-id-11'/>
    <typedef-decl name='reprfunc' type-id='type-id-59' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='329' column='1' id='type-id-15'/>
    <typedef-decl name='richcmpfunc' type-id='type-id-64' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='331' column='1' id='type-id-27'/>
    <typedef-decl name='setattrfunc' type-id='type-id-65' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='327' column='1' id='type-id-13'/>
    <typedef-decl name='setattrofunc' type-id='type-id-54' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='328' column='1' id='type-id-22'/>
    <typedef-decl name='ternaryfunc' type-id='type-id-53' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='168' column='1' id='type-id-20'/>
    <typedef-decl name='traverseproc' type-id='type-id-66' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='234' column='1' id='type-id-25'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-39'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-24'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-59'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-58'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-53'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-64'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-57'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-62'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-52'/>
    <class-decl name='PyGetSetDef' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/descrobject.h' line='11' column='1' id='type-id-43'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-74' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/descrobject.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='get' type-id='type-id-75' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/descrobject.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='set' type-id='type-id-76' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/descrobject.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='doc' type-id='type-id-74' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/descrobject.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='closure' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/descrobject.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyMemberDef' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/structmember.h' line='18' column='1' id='type-id-45'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-74' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/structmember.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-78' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/structmember.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offset' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/structmember.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flags' type-id='type-id-78' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/structmember.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='doc' type-id='type-id-74' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/structmember.h' line='23' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyMethodDef' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/methodobject.h' line='40' column='1' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ml_name' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/methodobject.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ml_meth' type-id='type-id-79' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/methodobject.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ml_flags' type-id='type-id-78' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/methodobject.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ml_doc' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/methodobject.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-8' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='112' column='1' id='type-id-50'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-2' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ob_size' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='114' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-80' const='yes' id='type-id-49'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-61'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-63'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-54'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-65'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-66'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-51'/>
    <typedef-decl name='PyAsyncMethods' type-id='type-id-86' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='308' column='1' id='type-id-41'/>
    <typedef-decl name='PyBufferProcs' type-id='type-id-87' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='313' column='1' id='type-id-42'/>
    <typedef-decl name='PyMappingMethods' type-id='type-id-88' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='302' column='1' id='type-id-44'/>
    <typedef-decl name='PyNumberMethods' type-id='type-id-89' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='282' column='1' id='type-id-47'/>
    <typedef-decl name='PySequenceMethods' type-id='type-id-90' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='296' column='1' id='type-id-48'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-60'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-55'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-56'/>
    <type-decl name='char' size-in-bits='8' id='type-id-80'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-74'/>
    <class-decl name='__anonymous_struct__2' size-in-bits='2304' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-47' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='237' column='1' id='type-id-89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_add' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nb_subtract' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nb_multiply' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nb_remainder' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nb_divmod' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nb_power' type-id='type-id-20' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nb_negative' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nb_positive' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nb_absolute' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='nb_bool' type-id='type-id-26' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='nb_invert' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='nb_lshift' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='nb_rshift' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='nb_and' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='nb_xor' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='nb_or' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='nb_int' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='nb_reserved' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='nb_float' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='nb_inplace_add' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='nb_inplace_subtract' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='nb_inplace_multiply' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='nb_inplace_remainder' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='nb_inplace_power' type-id='type-id-20' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='nb_inplace_lshift' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='nb_inplace_rshift' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='nb_inplace_and' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='nb_inplace_xor' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='nb_inplace_or' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='nb_floor_divide' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='nb_true_divide' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='nb_inplace_floor_divide' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='nb_inplace_true_divide' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='nb_index' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='nb_matrix_multiply' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='nb_inplace_matrix_multiply' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='281' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-42' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='310' column='1' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bf_getbuffer' type-id='type-id-96' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bf_releasebuffer' type-id='type-id-97' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='312' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-44' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='298' column='1' id='type-id-88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mp_length' type-id='type-id-98' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp_subscript' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mp_ass_subscript' type-id='type-id-99' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='301' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='640' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-48' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='284' column='1' id='type-id-90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sq_length' type-id='type-id-98' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sq_concat' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sq_repeat' type-id='type-id-100' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sq_item' type-id='type-id-100' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='was_sq_slice' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='sq_ass_item' type-id='type-id-101' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='was_sq_ass_slice' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='sq_contains' type-id='type-id-102' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='sq_inplace_concat' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='sq_inplace_repeat' type-id='type-id-100' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='295' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-41' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='304' column='1' id='type-id-86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='am_await' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='am_aiter' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='am_anext' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='307' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-78'/>
    <typedef-decl name='PyCFunction' type-id='type-id-58' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/methodobject.h' line='18' column='1' id='type-id-79'/>
    <typedef-decl name='getter' type-id='type-id-103' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/descrobject.h' line='8' column='1' id='type-id-75'/>
    <typedef-decl name='setter' type-id='type-id-104' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/descrobject.h' line='9' column='1' id='type-id-76'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-77'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-103'/>
    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-104'/>
    <typedef-decl name='binaryfunc' type-id='type-id-58' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='167' column='1' id='type-id-94'/>
    <typedef-decl name='getbufferproc' type-id='type-id-108' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='194' column='1' id='type-id-96'/>
    <typedef-decl name='lenfunc' type-id='type-id-109' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='170' column='1' id='type-id-98'/>
    <typedef-decl name='objobjargproc' type-id='type-id-54' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='175' column='1' id='type-id-99'/>
    <typedef-decl name='objobjproc' type-id='type-id-110' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='232' column='1' id='type-id-102'/>
    <typedef-decl name='releasebufferproc' type-id='type-id-111' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='195' column='1' id='type-id-97'/>
    <typedef-decl name='ssizeargfunc' type-id='type-id-112' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='171' column='1' id='type-id-100'/>
    <typedef-decl name='ssizeobjargproc' type-id='type-id-113' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='173' column='1' id='type-id-101'/>
    <typedef-decl name='unaryfunc' type-id='type-id-59' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='166' column='1' id='type-id-95'/>
    <type-decl name='void' id='type-id-105'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-112'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-110'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-108'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-113'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-109'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-111'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_collectionsmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__collections' mangled-name='PyInit__collections' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_collectionsmodule.c' line='2249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__collections'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_functoolsmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__functools' mangled-name='PyInit__functools' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_functoolsmodule.c' line='1168' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__functools'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <typedef-decl name='_PyIO_State' type-id='type-id-120' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='135' column='1' id='type-id-121'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-121' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='130' column='1' id='type-id-120'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='initialized' type-id='type-id-78' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='locale_module' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='unsupported_operation' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='134' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='Py_off_t' type-id='type-id-122' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='94' column='1' id='type-id-123'/>
    <typedef-decl name='off_t' type-id='type-id-124' filepath='/usr/include/stdio.h' line='59' column='1' id='type-id-122'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-125'/>
    <var-decl name='_PyIO_str_close' type-id='type-id-1' mangled-name='_PyIO_str_close' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='143' column='1' elf-symbol-id='_PyIO_str_close'/>
    <var-decl name='_PyIO_str_closed' type-id='type-id-1' mangled-name='_PyIO_str_closed' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='144' column='1' elf-symbol-id='_PyIO_str_closed'/>
    <var-decl name='_PyIO_str_decode' type-id='type-id-1' mangled-name='_PyIO_str_decode' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='145' column='1' elf-symbol-id='_PyIO_str_decode'/>
    <var-decl name='_PyIO_str_encode' type-id='type-id-1' mangled-name='_PyIO_str_encode' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='146' column='1' elf-symbol-id='_PyIO_str_encode'/>
    <var-decl name='_PyIO_str_fileno' type-id='type-id-1' mangled-name='_PyIO_str_fileno' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='147' column='1' elf-symbol-id='_PyIO_str_fileno'/>
    <var-decl name='_PyIO_str_flush' type-id='type-id-1' mangled-name='_PyIO_str_flush' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='148' column='1' elf-symbol-id='_PyIO_str_flush'/>
    <var-decl name='_PyIO_str_getstate' type-id='type-id-1' mangled-name='_PyIO_str_getstate' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='149' column='1' elf-symbol-id='_PyIO_str_getstate'/>
    <var-decl name='_PyIO_str_isatty' type-id='type-id-1' mangled-name='_PyIO_str_isatty' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='150' column='1' elf-symbol-id='_PyIO_str_isatty'/>
    <var-decl name='_PyIO_str_newlines' type-id='type-id-1' mangled-name='_PyIO_str_newlines' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='151' column='1' elf-symbol-id='_PyIO_str_newlines'/>
    <var-decl name='_PyIO_str_nl' type-id='type-id-1' mangled-name='_PyIO_str_nl' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='152' column='1' elf-symbol-id='_PyIO_str_nl'/>
    <var-decl name='_PyIO_str_read' type-id='type-id-1' mangled-name='_PyIO_str_read' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='153' column='1' elf-symbol-id='_PyIO_str_read'/>
    <var-decl name='_PyIO_str_read1' type-id='type-id-1' mangled-name='_PyIO_str_read1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='154' column='1' elf-symbol-id='_PyIO_str_read1'/>
    <var-decl name='_PyIO_str_readable' type-id='type-id-1' mangled-name='_PyIO_str_readable' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='155' column='1' elf-symbol-id='_PyIO_str_readable'/>
    <var-decl name='_PyIO_str_readall' type-id='type-id-1' mangled-name='_PyIO_str_readall' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='156' column='1' elf-symbol-id='_PyIO_str_readall'/>
    <var-decl name='_PyIO_str_readinto' type-id='type-id-1' mangled-name='_PyIO_str_readinto' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='157' column='1' elf-symbol-id='_PyIO_str_readinto'/>
    <var-decl name='_PyIO_str_readline' type-id='type-id-1' mangled-name='_PyIO_str_readline' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='158' column='1' elf-symbol-id='_PyIO_str_readline'/>
    <var-decl name='_PyIO_str_reset' type-id='type-id-1' mangled-name='_PyIO_str_reset' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='159' column='1' elf-symbol-id='_PyIO_str_reset'/>
    <var-decl name='_PyIO_str_seek' type-id='type-id-1' mangled-name='_PyIO_str_seek' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='160' column='1' elf-symbol-id='_PyIO_str_seek'/>
    <var-decl name='_PyIO_str_seekable' type-id='type-id-1' mangled-name='_PyIO_str_seekable' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='161' column='1' elf-symbol-id='_PyIO_str_seekable'/>
    <var-decl name='_PyIO_str_setstate' type-id='type-id-1' mangled-name='_PyIO_str_setstate' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='162' column='1' elf-symbol-id='_PyIO_str_setstate'/>
    <var-decl name='_PyIO_str_tell' type-id='type-id-1' mangled-name='_PyIO_str_tell' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='163' column='1' elf-symbol-id='_PyIO_str_tell'/>
    <var-decl name='_PyIO_str_truncate' type-id='type-id-1' mangled-name='_PyIO_str_truncate' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='164' column='1' elf-symbol-id='_PyIO_str_truncate'/>
    <var-decl name='_PyIO_str_writable' type-id='type-id-1' mangled-name='_PyIO_str_writable' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='165' column='1' elf-symbol-id='_PyIO_str_writable'/>
    <var-decl name='_PyIO_str_write' type-id='type-id-1' mangled-name='_PyIO_str_write' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='166' column='1' elf-symbol-id='_PyIO_str_write'/>
    <var-decl name='_PyIO_empty_str' type-id='type-id-1' mangled-name='_PyIO_empty_str' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='168' column='1' elf-symbol-id='_PyIO_empty_str'/>
    <var-decl name='_PyIO_empty_bytes' type-id='type-id-1' mangled-name='_PyIO_empty_bytes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='169' column='1' elf-symbol-id='_PyIO_empty_bytes'/>
    <var-decl name='_PyIO_zero' type-id='type-id-1' mangled-name='_PyIO_zero' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='170' column='1' elf-symbol-id='_PyIO_zero'/>
    <var-decl name='_PyIO_Module' type-id='type-id-126' mangled-name='_PyIO_Module' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='128' column='1' elf-symbol-id='_PyIO_Module'/>
    <function-decl name='PyInit__io' mangled-name='PyInit__io' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.c' line='632' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__io'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyIO_get_locale_module' mangled-name='_PyIO_get_locale_module' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.c' line='554' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIO_get_locale_module'>
      <parameter type-id='type-id-125' name='state' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.c' line='554' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyIO_get_module_state' mangled-name='_PyIO_get_module_state' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.c' line='540' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIO_get_module_state'>
      <return type-id='type-id-125'/>
    </function-decl>
    <function-decl name='_PyIO_ConvertSsize_t' mangled-name='_PyIO_ConvertSsize_t' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.c' line='518' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIO_ConvertSsize_t'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.c' line='518' column='1'/>
      <parameter type-id='type-id-77' name='result' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.c' line='518' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyNumber_AsOff_t' mangled-name='PyNumber_AsOff_t' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.c' line='472' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_AsOff_t'>
      <parameter type-id='type-id-1' name='item' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.c' line='472' column='1'/>
      <parameter type-id='type-id-1' name='err' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.c' line='472' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <typedef-decl name='PyModuleDef' type-id='type-id-127' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/moduleobject.h' line='80' column='1' id='type-id-126'/>
    <typedef-decl name='__off64_t' type-id='type-id-51' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='141' column='1' id='type-id-124'/>
    <class-decl name='PyModuleDef' size-in-bits='832' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/moduleobject.h' line='70' column='1' id='type-id-127'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_base' type-id='type-id-128' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/moduleobject.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='m_name' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/moduleobject.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='m_doc' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/moduleobject.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='m_size' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/moduleobject.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='m_methods' type-id='type-id-30' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/moduleobject.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='m_slots' type-id='type-id-129' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/moduleobject.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='m_traverse' type-id='type-id-25' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/moduleobject.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='m_clear' type-id='type-id-26' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/moduleobject.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='m_free' type-id='type-id-38' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/moduleobject.h' line='79' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-129'/>
    <typedef-decl name='PyModuleDef_Base' type-id='type-id-131' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/moduleobject.h' line='44' column='1' id='type-id-128'/>
    <class-decl name='PyModuleDef_Base' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/moduleobject.h' line='39' column='1' id='type-id-131'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-2' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/moduleobject.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='m_init' type-id='type-id-132' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/moduleobject.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='m_index' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/moduleobject.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='m_copy' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/moduleobject.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyModuleDef_Slot' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/moduleobject.h' line='56' column='1' id='type-id-130'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='slot' type-id='type-id-78' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/moduleobject.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/moduleobject.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-132'/>
    <function-type size-in-bits='64' id='type-id-133'>
      <return type-id='type-id-1'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/bufferedio.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyBufferedIOBase_Type' type-id='type-id-134' mangled-name='PyBufferedIOBase_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='8' column='1' elf-symbol-id='PyBufferedIOBase_Type'/>
    <var-decl name='PyBufferedReader_Type' type-id='type-id-134' mangled-name='PyBufferedReader_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='15' column='1' elf-symbol-id='PyBufferedReader_Type'/>
    <var-decl name='PyBufferedWriter_Type' type-id='type-id-134' mangled-name='PyBufferedWriter_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='16' column='1' elf-symbol-id='PyBufferedWriter_Type'/>
    <var-decl name='PyBufferedRWPair_Type' type-id='type-id-134' mangled-name='PyBufferedRWPair_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='17' column='1' elf-symbol-id='PyBufferedRWPair_Type'/>
    <var-decl name='PyBufferedRandom_Type' type-id='type-id-134' mangled-name='PyBufferedRandom_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='18' column='1' elf-symbol-id='PyBufferedRandom_Type'/>
    <function-decl name='_PyIO_trap_eintr' mangled-name='_PyIO_trap_eintr' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/bufferedio.c' line='790' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIO_trap_eintr'>
      <return type-id='type-id-78'/>
    </function-decl>
    <typedef-decl name='PyTypeObject' type-id='type-id-6' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='431' column='1' id='type-id-134'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/bytesio.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyBytesIO_Type' type-id='type-id-134' mangled-name='PyBytesIO_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='13' column='1' elf-symbol-id='PyBytesIO_Type'/>
    <var-decl name='_PyBytesIOBuffer_Type' type-id='type-id-134' mangled-name='_PyBytesIOBuffer_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='172' column='1' elf-symbol-id='_PyBytesIOBuffer_Type'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/fileio.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyFileIO_Type' type-id='type-id-134' mangled-name='PyFileIO_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='12' column='1' elf-symbol-id='PyFileIO_Type'/>
    <function-decl name='_PyFileIO_closed' mangled-name='_PyFileIO_closed' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/fileio.c' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyFileIO_closed'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/fileio.c' line='81' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/iobase.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyIOBase_Type' type-id='type-id-134' mangled-name='PyIOBase_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='6' column='1' elf-symbol-id='PyIOBase_Type'/>
    <var-decl name='PyRawIOBase_Type' type-id='type-id-134' mangled-name='PyRawIOBase_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='7' column='1' elf-symbol-id='PyRawIOBase_Type'/>
    <function-decl name='_PyIOBase_finalize' mangled-name='_PyIOBase_finalize' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/iobase.c' line='278' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIOBase_finalize'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/iobase.c' line='278' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='_PyIOBase_check_closed' mangled-name='_PyIOBase_check_closed' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/iobase.c' line='184' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIOBase_check_closed'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/iobase.c' line='184' column='1'/>
      <parameter type-id='type-id-1' name='args' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/iobase.c' line='184' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyIOBase_check_seekable' mangled-name='_PyIOBase_check_seekable' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/iobase.c' line='350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIOBase_check_seekable'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/iobase.c' line='350' column='1'/>
      <parameter type-id='type-id-1' name='args' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/iobase.c' line='350' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyIOBase_check_writable' mangled-name='_PyIOBase_check_writable' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/iobase.c' line='416' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIOBase_check_writable'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/iobase.c' line='416' column='1'/>
      <parameter type-id='type-id-1' name='args' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/iobase.c' line='416' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyIOBase_check_readable' mangled-name='_PyIOBase_check_readable' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/iobase.c' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIOBase_check_readable'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/iobase.c' line='383' column='1'/>
      <parameter type-id='type-id-1' name='args' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/iobase.c' line='383' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/stringio.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyStringIO_Type' type-id='type-id-134' mangled-name='PyStringIO_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='14' column='1' elf-symbol-id='PyStringIO_Type'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/textio.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyTextIOBase_Type' type-id='type-id-134' mangled-name='PyTextIOBase_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='9' column='1' elf-symbol-id='PyTextIOBase_Type'/>
    <var-decl name='PyIncrementalNewlineDecoder_Type' type-id='type-id-134' mangled-name='PyIncrementalNewlineDecoder_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='20' column='1' elf-symbol-id='PyIncrementalNewlineDecoder_Type'/>
    <var-decl name='PyTextIOWrapper_Type' type-id='type-id-134' mangled-name='PyTextIOWrapper_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/_iomodule.h' line='19' column='1' elf-symbol-id='PyTextIOWrapper_Type'/>
    <function-decl name='_PyIO_find_line_ending' mangled-name='_PyIO_find_line_ending' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/textio.c' line='1670' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIO_find_line_ending'>
      <parameter type-id='type-id-78' name='translated' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/textio.c' line='1671' column='1'/>
      <parameter type-id='type-id-78' name='universal' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/textio.c' line='1671' column='1'/>
      <parameter type-id='type-id-1' name='readnl' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/textio.c' line='1671' column='1'/>
      <parameter type-id='type-id-78' name='kind' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/textio.c' line='1672' column='1'/>
      <parameter type-id='type-id-74' name='start' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/textio.c' line='1672' column='1'/>
      <parameter type-id='type-id-74' name='end' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/textio.c' line='1672' column='1'/>
      <parameter type-id='type-id-135' name='consumed' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/textio.c' line='1672' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyIncrementalNewlineDecoder_decode' mangled-name='_PyIncrementalNewlineDecoder_decode' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/textio.c' line='311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIncrementalNewlineDecoder_decode'>
      <parameter type-id='type-id-1' name='myself' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/textio.c' line='311' column='1'/>
      <parameter type-id='type-id-1' name='input' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/textio.c' line='312' column='1'/>
      <parameter type-id='type-id-78' name='final' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_io/textio.c' line='312' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-135'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_localemodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__locale' mangled-name='PyInit__locale' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_localemodule.c' line='622' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__locale'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_operator.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__operator' mangled-name='PyInit__operator' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_operator.c' line='1205' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__operator'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_sre.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__sre' mangled-name='PyInit__sre' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_sre.c' line='2849' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__sre'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_ssl.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__ssl' mangled-name='PyInit__ssl' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_ssl.c' line='4463' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__ssl'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_stat.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__stat' mangled-name='PyInit__stat' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_stat.c' line='508' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__stat'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_threadmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__thread' mangled-name='PyInit__thread' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_threadmodule.c' line='1353' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__thread'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_tracemalloc.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='_PyTraceMalloc_Fini' mangled-name='_PyTraceMalloc_Fini' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_tracemalloc.c' line='1456' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyTraceMalloc_Fini'>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='_PyTraceMalloc_Init' mangled-name='_PyTraceMalloc_Init' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_tracemalloc.c' line='1398' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyTraceMalloc_Init'>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyInit__tracemalloc' mangled-name='PyInit__tracemalloc' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_tracemalloc.c' line='1356' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__tracemalloc'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_weakref.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__weakref' mangled-name='PyInit__weakref' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/_weakref.c' line='112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__weakref'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/atexitmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit_atexit' mangled-name='PyInit_atexit' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/atexitmodule.c' line='327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_atexit'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/errnomodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit_errno' mangled-name='PyInit_errno' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/errnomodule.c' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_errno'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/faulthandler.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='_PyFaulthandler_Fini' mangled-name='_PyFaulthandler_Fini' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/faulthandler.c' line='1168' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyFaulthandler_Fini'>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='_PyFaulthandler_Init' mangled-name='_PyFaulthandler_Init' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/faulthandler.c' line='1134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyFaulthandler_Init'>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyInit_faulthandler' mangled-name='PyInit_faulthandler' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/faulthandler.c' line='1089' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_faulthandler'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/gcmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <typedef-decl name='PyGC_Head' type-id='type-id-136' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/objimpl.h' line='254' column='1' id='type-id-137'/>
    <union-decl name='_gc_head' size-in-bits='192' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/objimpl.h' line='247' column='1' id='type-id-136'>
      <data-member access='private'>
        <var-decl name='gc' type-id='type-id-138' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/objimpl.h' line='252' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='dummy' type-id='type-id-139' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/objimpl.h' line='253' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/objimpl.h' line='248' column='1' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gc_next' type-id='type-id-140' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/objimpl.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='gc_prev' type-id='type-id-140' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/objimpl.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='gc_refs' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/objimpl.h' line='251' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-141'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-140'/>
    <var-decl name='_PyGC_generation0' type-id='type-id-141' mangled-name='_PyGC_generation0' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/objimpl.h' line='256' column='1' elf-symbol-id='_PyGC_generation0'/>
    <function-decl name='PyObject_GC_Del' mangled-name='PyObject_GC_Del' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/gcmodule.c' line='1769' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_Del'>
      <parameter type-id='type-id-77' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/gcmodule.c' line='1769' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='_PyObject_GC_Resize' mangled-name='_PyObject_GC_Resize' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/gcmodule.c' line='1754' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_Resize'>
      <parameter type-id='type-id-142' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/gcmodule.c' line='1754' column='1'/>
      <parameter type-id='type-id-4' name='nitems' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/gcmodule.c' line='1754' column='1'/>
      <return type-id='type-id-142'/>
    </function-decl>
    <function-decl name='_PyObject_GC_NewVar' mangled-name='_PyObject_GC_NewVar' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/gcmodule.c' line='1737' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_NewVar'>
      <parameter type-id='type-id-143' name='tp' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/gcmodule.c' line='1737' column='1'/>
      <parameter type-id='type-id-4' name='nitems' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/gcmodule.c' line='1737' column='1'/>
      <return type-id='type-id-142'/>
    </function-decl>
    <function-decl name='_PyObject_GC_New' mangled-name='_PyObject_GC_New' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/gcmodule.c' line='1728' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_New'>
      <parameter type-id='type-id-143' name='tp' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/gcmodule.c' line='1728' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyObject_GC_Calloc' mangled-name='_PyObject_GC_Calloc' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/gcmodule.c' line='1722' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_Calloc'>
      <parameter type-id='type-id-144' name='basicsize' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/gcmodule.c' line='1722' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyObject_GC_Malloc' mangled-name='_PyObject_GC_Malloc' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/gcmodule.c' line='1716' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_Malloc'>
      <parameter type-id='type-id-144' name='basicsize' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/gcmodule.c' line='1716' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyObject_GC_UnTrack' mangled-name='PyObject_GC_UnTrack' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/gcmodule.c' line='1675' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_UnTrack'>
      <parameter type-id='type-id-77' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/gcmodule.c' line='1675' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='PyObject_GC_Track' mangled-name='PyObject_GC_Track' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/gcmodule.c' line='1669' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_Track'>
      <parameter type-id='type-id-77' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/gcmodule.c' line='1669' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='_PyGC_Dump' mangled-name='_PyGC_Dump' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/gcmodule.c' line='1655' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyGC_Dump'>
      <parameter type-id='type-id-141' name='g' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/gcmodule.c' line='1655' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='_PyGC_Fini' mangled-name='_PyGC_Fini' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/gcmodule.c' line='1648' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyGC_Fini'>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='_PyGC_DumpShutdownStats' mangled-name='_PyGC_DumpShutdownStats' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/gcmodule.c' line='1612' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyGC_DumpShutdownStats'>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='_PyGC_CollectNoFail' mangled-name='_PyGC_CollectNoFail' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/gcmodule.c' line='1591' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyGC_CollectNoFail'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyGC_Collect' mangled-name='PyGC_Collect' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/gcmodule.c' line='1575' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyGC_Collect'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyInit_gc' mangled-name='PyInit_gc' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/gcmodule.c' line='1536' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_gc'>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-143'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-142'/>
    <type-decl name='double' size-in-bits='64' id='type-id-139'/>
    <typedef-decl name='size_t' type-id='type-id-24' filepath='/usr/lib/gcc/x86_64-linux-gnu/7/include/stddef.h' line='216' column='1' id='type-id-144'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/getbuildinfo.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='type-id-80'/>
    <type-decl name='void' id='type-id-105'/>
    <qualified-type-def type-id='type-id-80' const='yes' id='type-id-49'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-9'/>
    <function-decl name='Py_GetBuildInfo' mangled-name='Py_GetBuildInfo' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/getbuildinfo.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetBuildInfo'>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_Py_hgidentifier' mangled-name='_Py_hgidentifier' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/getbuildinfo.c' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hgidentifier'>
      <return type-id='type-id-9'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/getpath.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='Py_GetProgramFullPath' mangled-name='Py_GetProgramFullPath' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/getpath.c' line='883' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetProgramFullPath'>
      <return type-id='type-id-145'/>
    </function-decl>
    <function-decl name='Py_GetExecPrefix' mangled-name='Py_GetExecPrefix' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/getpath.c' line='875' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetExecPrefix'>
      <return type-id='type-id-145'/>
    </function-decl>
    <function-decl name='Py_GetPrefix' mangled-name='Py_GetPrefix' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/getpath.c' line='867' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetPrefix'>
      <return type-id='type-id-145'/>
    </function-decl>
    <function-decl name='Py_GetPath' mangled-name='Py_GetPath' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/getpath.c' line='859' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetPath'>
      <return type-id='type-id-145'/>
    </function-decl>
    <function-decl name='Py_SetPath' mangled-name='Py_SetPath' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/getpath.c' line='841' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_SetPath'>
      <parameter type-id='type-id-146' name='path' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/getpath.c' line='841' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-146'/>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-145'/>
    <qualified-type-def type-id='type-id-148' const='yes' id='type-id-147'/>
    <typedef-decl name='wchar_t' type-id='type-id-78' filepath='/usr/lib/gcc/x86_64-linux-gnu/7/include/stddef.h' line='328' column='1' id='type-id-148'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <typedef-decl name='_Py_hashtable_t' type-id='type-id-149' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='67' column='1' id='type-id-150'/>
    <class-decl name='__anonymous_struct__' size-in-bits='704' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-150' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='55' column='1' id='type-id-149'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num_buckets' type-id='type-id-144' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='entries' type-id='type-id-144' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='buckets' type-id='type-id-151' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='data_size' type-id='type-id-144' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='hash_func' type-id='type-id-152' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='compare_func' type-id='type-id-153' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='copy_data_func' type-id='type-id-154' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='free_data_func' type-id='type-id-155' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='get_data_size_func' type-id='type-id-156' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='alloc' type-id='type-id-157' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_Py_slist_t' type-id='type-id-158' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='13' column='1' id='type-id-159'/>
    <class-decl name='__anonymous_struct__1' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-159' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='11' column='1' id='type-id-158'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-160' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='12' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_Py_slist_item_t' type-id='type-id-161' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='9' column='1' id='type-id-162'/>
    <class-decl name='_Py_slist_item_s' size-in-bits='64' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='7' column='1' id='type-id-161'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-163' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='8' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_Py_hashtable_hash_func' type-id='type-id-164' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='41' column='1' id='type-id-152'/>
    <typedef-decl name='Py_uhash_t' type-id='type-id-144' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/pyport.h' line='189' column='1' id='type-id-165'/>
    <typedef-decl name='_Py_hashtable_compare_func' type-id='type-id-166' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='42' column='1' id='type-id-153'/>
    <typedef-decl name='_Py_hashtable_entry_t' type-id='type-id-167' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='27' column='1' id='type-id-168'/>
    <class-decl name='__anonymous_struct__2' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-168' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='19' column='1' id='type-id-167'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_Py_slist_item' type-id='type-id-162' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='key' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='key_hash' type-id='type-id-165' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_Py_hashtable_copy_data_func' type-id='type-id-169' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='43' column='1' id='type-id-154'/>
    <typedef-decl name='_Py_hashtable_free_data_func' type-id='type-id-56' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='44' column='1' id='type-id-155'/>
    <typedef-decl name='_Py_hashtable_get_data_size_func' type-id='type-id-170' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='45' column='1' id='type-id-156'/>
    <typedef-decl name='_Py_hashtable_allocator_t' type-id='type-id-171' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='53' column='1' id='type-id-157'/>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-157' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='47' column='1' id='type-id-171'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='malloc' type-id='type-id-172' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='free' type-id='type-id-56' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-173'/>
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-174'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-175'/>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-163'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-160'/>
    <pointer-type-def type-id='type-id-159' size-in-bits='64' id='type-id-151'/>
    <qualified-type-def type-id='type-id-168' const='yes' id='type-id-176'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-177'/>
    <pointer-type-def type-id='type-id-178' size-in-bits='64' id='type-id-179'/>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-166'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-164'/>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-170'/>
    <pointer-type-def type-id='type-id-183' size-in-bits='64' id='type-id-172'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-169'/>
    <function-decl name='_Py_hashtable_copy' mangled-name='_Py_hashtable_copy' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='480' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_copy'>
      <parameter type-id='type-id-175' name='src' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='480' column='1'/>
      <return type-id='type-id-175'/>
    </function-decl>
    <function-decl name='_Py_hashtable_destroy' mangled-name='_Py_hashtable_destroy' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='459' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_destroy'>
      <parameter type-id='type-id-175' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='459' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='_Py_hashtable_clear' mangled-name='_Py_hashtable_clear' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='440' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_clear'>
      <parameter type-id='type-id-175' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='440' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='_Py_hashtable_foreach' mangled-name='_Py_hashtable_foreach' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='380' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_foreach'>
      <parameter type-id='type-id-175' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='380' column='1'/>
      <parameter type-id='type-id-179' name='func' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='381' column='1'/>
      <parameter type-id='type-id-77' name='arg' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='382' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='_Py_hashtable_delete' mangled-name='_Py_hashtable_delete' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='366' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_delete'>
      <parameter type-id='type-id-175' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='366' column='1'/>
      <parameter type-id='type-id-77' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='366' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='_Py_hashtable_pop' mangled-name='_Py_hashtable_pop' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='357' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_pop'>
      <parameter type-id='type-id-175' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='357' column='1'/>
      <parameter type-id='type-id-77' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='357' column='1'/>
      <parameter type-id='type-id-77' name='data' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='357' column='1'/>
      <parameter type-id='type-id-144' name='data_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='357' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='_Py_hashtable_get' mangled-name='_Py_hashtable_get' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_get'>
      <parameter type-id='type-id-175' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='343' column='1'/>
      <parameter type-id='type-id-77' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='343' column='1'/>
      <parameter type-id='type-id-77' name='data' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='343' column='1'/>
      <parameter type-id='type-id-144' name='data_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='343' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='_Py_hashtable_set' mangled-name='_Py_hashtable_set' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='301' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_set'>
      <parameter type-id='type-id-175' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='301' column='1'/>
      <parameter type-id='type-id-77' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='301' column='1'/>
      <parameter type-id='type-id-77' name='data' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='302' column='1'/>
      <parameter type-id='type-id-144' name='data_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='302' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='_Py_hashtable_get_entry' mangled-name='_Py_hashtable_get_entry' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='248' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_get_entry'>
      <parameter type-id='type-id-175' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='248' column='1'/>
      <parameter type-id='type-id-77' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='248' column='1'/>
      <return type-id='type-id-174'/>
    </function-decl>
    <function-decl name='_Py_hashtable_size' mangled-name='_Py_hashtable_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='177' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_size'>
      <parameter type-id='type-id-175' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='177' column='1'/>
      <return type-id='type-id-144'/>
    </function-decl>
    <function-decl name='_Py_hashtable_new' mangled-name='_Py_hashtable_new' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_new'>
      <parameter type-id='type-id-144' name='data_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='167' column='1'/>
      <parameter type-id='type-id-152' name='hash_func' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='168' column='1'/>
      <parameter type-id='type-id-153' name='compare_func' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='169' column='1'/>
      <return type-id='type-id-175'/>
    </function-decl>
    <function-decl name='_Py_hashtable_new_full' mangled-name='_Py_hashtable_new_full' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_new_full'>
      <parameter type-id='type-id-144' name='data_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='122' column='1'/>
      <parameter type-id='type-id-144' name='init_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='122' column='1'/>
      <parameter type-id='type-id-152' name='hash_func' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='123' column='1'/>
      <parameter type-id='type-id-153' name='compare_func' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='124' column='1'/>
      <parameter type-id='type-id-154' name='copy_data_func' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='125' column='1'/>
      <parameter type-id='type-id-155' name='free_data_func' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='126' column='1'/>
      <parameter type-id='type-id-156' name='get_data_size_func' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='127' column='1'/>
      <parameter type-id='type-id-173' name='allocator' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='128' column='1'/>
      <return type-id='type-id-175'/>
    </function-decl>
    <function-decl name='_Py_hashtable_compare_direct' mangled-name='_Py_hashtable_compare_direct' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='103' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_compare_direct'>
      <parameter type-id='type-id-77' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='103' column='1'/>
      <parameter type-id='type-id-177' name='entry' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='103' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='_Py_hashtable_hash_ptr' mangled-name='_Py_hashtable_hash_ptr' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_hash_ptr'>
      <parameter type-id='type-id-77' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='97' column='1'/>
      <return type-id='type-id-165'/>
    </function-decl>
    <function-decl name='_Py_hashtable_hash_int' mangled-name='_Py_hashtable_hash_int' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_hash_int'>
      <parameter type-id='type-id-77' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/hashtable.c' line='91' column='1'/>
      <return type-id='type-id-165'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-178'>
      <parameter type-id='type-id-174'/>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-78'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-180'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-177'/>
      <return type-id='type-id-78'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-181'>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-165'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-182'>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-144'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-183'>
      <parameter type-id='type-id-144'/>
      <return type-id='type-id-77'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-184'>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-77'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/itertoolsmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit_itertools' mangled-name='PyInit_itertools' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/itertoolsmodule.c' line='4581' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_itertools'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/main.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-186'/>
    <function-decl name='Py_GetArgcArgv' mangled-name='Py_GetArgcArgv' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/main.c' line='814' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetArgcArgv'>
      <parameter type-id='type-id-187' name='argc' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/main.c' line='814' column='1'/>
      <parameter type-id='type-id-186' name='argv' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/main.c' line='814' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='Py_Main' mangled-name='Py_Main' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/main.c' line='327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_Main'>
      <parameter type-id='type-id-78' name='argc' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/main.c' line='327' column='1'/>
      <parameter type-id='type-id-185' name='argv' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/main.c' line='327' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-187'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-185'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/posixmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <typedef-decl name='uid_t' type-id='type-id-188' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='80' column='1' id='type-id-189'/>
    <typedef-decl name='gid_t' type-id='type-id-190' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='65' column='1' id='type-id-191'/>
    <function-decl name='PyInit_posix' mangled-name='PyInit_posix' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/posixmodule.c' line='12954' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_posix'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_Gid_Converter' mangled-name='_Py_Gid_Converter' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/posixmodule.c' line='527' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_Gid_Converter'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/posixmodule.c' line='527' column='1'/>
      <parameter type-id='type-id-77' name='p' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/posixmodule.c' line='527' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='_Py_Uid_Converter' mangled-name='_Py_Uid_Converter' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/posixmodule.c' line='421' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_Uid_Converter'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/posixmodule.c' line='421' column='1'/>
      <parameter type-id='type-id-77' name='p' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/posixmodule.c' line='421' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='_PyLong_FromUid' mangled-name='_PyLong_FromUid' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/posixmodule.c' line='405' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyLong_FromUid'>
      <parameter type-id='type-id-189' name='uid' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/posixmodule.c' line='405' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyLong_FromGid' mangled-name='_PyLong_FromGid' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/posixmodule.c' line='413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyLong_FromGid'>
      <parameter type-id='type-id-191' name='gid' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/posixmodule.c' line='413' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <typedef-decl name='__gid_t' type-id='type-id-39' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='135' column='1' id='type-id-190'/>
    <typedef-decl name='__uid_t' type-id='type-id-39' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='134' column='1' id='type-id-188'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/pwdmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit_pwd' mangled-name='PyInit_pwd' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/pwdmodule.c' line='222' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_pwd'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/signalmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='_PyOS_IsMainThread' mangled-name='_PyOS_IsMainThread' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/signalmodule.c' line='1665' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyOS_IsMainThread'>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyOS_AfterFork' mangled-name='PyOS_AfterFork' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/signalmodule.c' line='1646' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_AfterFork'>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='PyOS_InterruptOccurred' mangled-name='PyOS_InterruptOccurred' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/signalmodule.c' line='1620' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_InterruptOccurred'>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyOS_FiniInterrupts' mangled-name='PyOS_FiniInterrupts' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/signalmodule.c' line='1614' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_FiniInterrupts'>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='PyOS_InitInterrupts' mangled-name='PyOS_InitInterrupts' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/signalmodule.c' line='1605' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_InitInterrupts'>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='PyErr_SetInterrupt' mangled-name='PyErr_SetInterrupt' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/signalmodule.c' line='1599' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_SetInterrupt'>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='PyInit__signal' mangled-name='PyInit__signal' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/signalmodule.c' line='1194' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__signal'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySignal_SetWakeupFd' mangled-name='PySignal_SetWakeupFd' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/signalmodule.c' line='649' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySignal_SetWakeupFd'>
      <parameter type-id='type-id-78' name='fd' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/signalmodule.c' line='649' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyErr_CheckSignals' mangled-name='PyErr_CheckSignals' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/signalmodule.c' line='1541' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_CheckSignals'>
      <return type-id='type-id-78'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/symtablemodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__symtable' mangled-name='PyInit__symtable' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/symtablemodule.c' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__symtable'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/timemodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit_time' mangled-name='PyInit_time' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/timemodule.c' line='1339' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_time'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/xxsubtype.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit_xxsubtype' mangled-name='PyInit_xxsubtype' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/xxsubtype.c' line='311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_xxsubtype'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/zipimport.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit_zipimport' mangled-name='PyInit_zipimport' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Modules/zipimport.c' line='1472' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_zipimport'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <type-decl name='variadic parameter type' id='type-id-192'/>
    <class-decl name='_Py_Identifier' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='141' column='1' id='type-id-193'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-194' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='string' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='object' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='144' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_Py_Identifier' type-id='type-id-193' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='145' column='1' id='type-id-195'/>
    <pointer-type-def type-id='type-id-193' size-in-bits='64' id='type-id-194'/>
    <qualified-type-def type-id='type-id-74' const='yes' id='type-id-196'/>
    <pointer-type-def type-id='type-id-196' size-in-bits='64' id='type-id-197'/>
    <qualified-type-def type-id='type-id-198' const='yes' id='type-id-199'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' id='type-id-200'/>
    <qualified-type-def type-id='type-id-4' const='yes' id='type-id-201'/>
    <pointer-type-def type-id='type-id-201' size-in-bits='64' id='type-id-202'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-203'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-204'/>
    <function-decl name='_Py_FreeCharPArray' mangled-name='_Py_FreeCharPArray' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2837' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_FreeCharPArray'>
      <parameter type-id='type-id-197' name='array' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2837' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='_PySequence_BytesToCharpArray' mangled-name='_PySequence_BytesToCharpArray' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2778' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySequence_BytesToCharpArray'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2778' column='1'/>
      <return type-id='type-id-197'/>
    </function-decl>
    <function-decl name='_PyObject_RealIsSubclass' mangled-name='_PyObject_RealIsSubclass' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2718' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_RealIsSubclass'>
      <parameter type-id='type-id-1' name='derived' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2718' column='1'/>
      <parameter type-id='type-id-1' name='cls' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2718' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='_PyObject_RealIsInstance' mangled-name='_PyObject_RealIsInstance' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2712' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_RealIsInstance'>
      <parameter type-id='type-id-1' name='inst' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2712' column='1'/>
      <parameter type-id='type-id-1' name='cls' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2712' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyObject_IsSubclass' mangled-name='PyObject_IsSubclass' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2656' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_IsSubclass'>
      <parameter type-id='type-id-1' name='derived' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2656' column='1'/>
      <parameter type-id='type-id-1' name='cls' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2656' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyObject_IsInstance' mangled-name='PyObject_IsInstance' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2581' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_IsInstance'>
      <parameter type-id='type-id-1' name='inst' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2581' column='1'/>
      <parameter type-id='type-id-1' name='cls' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2581' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyObject_CallFunctionObjArgs' mangled-name='PyObject_CallFunctionObjArgs' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallFunctionObjArgs'>
      <parameter type-id='type-id-1' name='callable' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2413' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyObject_CallMethodIdObjArgs' mangled-name='_PyObject_CallMethodIdObjArgs' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_CallMethodIdObjArgs'>
      <parameter type-id='type-id-1' name='callable' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2384' column='1'/>
      <parameter type-id='type-id-194' name='name' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2385' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyObject_CallMethodObjArgs' mangled-name='PyObject_CallMethodObjArgs' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2356' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallMethodObjArgs'>
      <parameter type-id='type-id-1' name='callable' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2356' column='1'/>
      <parameter type-id='type-id-1' name='name' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2356' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyObject_CallMethodId_SizeT' mangled-name='_PyObject_CallMethodId_SizeT' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_CallMethodId_SizeT'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2313' column='1'/>
      <parameter type-id='type-id-194' name='name' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2313' column='1'/>
      <parameter type-id='type-id-9' name='format' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2314' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyObject_CallMethod_SizeT' mangled-name='_PyObject_CallMethod_SizeT' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_CallMethod_SizeT'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2293' column='1'/>
      <parameter type-id='type-id-9' name='name' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2293' column='1'/>
      <parameter type-id='type-id-9' name='format' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2294' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyObject_CallMethodId' mangled-name='_PyObject_CallMethodId' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2272' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_CallMethodId'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2272' column='1'/>
      <parameter type-id='type-id-194' name='name' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2272' column='1'/>
      <parameter type-id='type-id-9' name='format' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2273' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyObject_CallMethod' mangled-name='PyObject_CallMethod' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2252' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallMethod'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2252' column='1'/>
      <parameter type-id='type-id-9' name='name' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2252' column='1'/>
      <parameter type-id='type-id-9' name='format' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2252' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyObject_CallFunction_SizeT' mangled-name='_PyObject_CallFunction_SizeT' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_CallFunction_SizeT'>
      <parameter type-id='type-id-1' name='callable' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2203' column='1'/>
      <parameter type-id='type-id-9' name='format' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2203' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyObject_CallFunction' mangled-name='PyObject_CallFunction' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallFunction'>
      <parameter type-id='type-id-1' name='callable' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2181' column='1'/>
      <parameter type-id='type-id-9' name='format' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2181' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyObject_Call' mangled-name='PyObject_Call' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Call'>
      <parameter type-id='type-id-1' name='func' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2127' column='1'/>
      <parameter type-id='type-id-1' name='arg' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2127' column='1'/>
      <parameter type-id='type-id-1' name='kw' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2127' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyObject_CallObject' mangled-name='PyObject_CallObject' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2071' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallObject'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2071' column='1'/>
      <parameter type-id='type-id-1' name='a' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2071' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyMapping_Values' mangled-name='PyMapping_Values' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2050' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Values'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2050' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyMapping_Items' mangled-name='PyMapping_Items' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2033' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Items'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2033' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyMapping_Keys' mangled-name='PyMapping_Keys' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2016' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Keys'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2016' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyMapping_HasKey' mangled-name='PyMapping_HasKey' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2002' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_HasKey'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2002' column='1'/>
      <parameter type-id='type-id-1' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2002' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyMapping_HasKeyString' mangled-name='PyMapping_HasKeyString' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1988' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_HasKeyString'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1988' column='1'/>
      <parameter type-id='type-id-9' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1988' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyMapping_SetItemString' mangled-name='PyMapping_SetItemString' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1969' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_SetItemString'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1969' column='1'/>
      <parameter type-id='type-id-9' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1969' column='1'/>
      <parameter type-id='type-id-1' name='value' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1969' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyMapping_Length' mangled-name='PyMapping_Length' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1946' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Length'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1946' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyMapping_Check' mangled-name='PyMapping_Check' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1920' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Check'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1920' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PySequence_Index' mangled-name='PySequence_Index' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1912' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Index'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1912' column='1'/>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1912' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySequence_In' mangled-name='PySequence_In' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1906' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_In'>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1906' column='1'/>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1906' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PySequence_Count' mangled-name='PySequence_Count' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1884' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Count'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1884' column='1'/>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1884' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySequence_Tuple' mangled-name='PySequence_Tuple' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1665' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Tuple'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1665' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_DelSlice' mangled-name='PySequence_DelSlice' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1641' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_DelSlice'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1641' column='1'/>
      <parameter type-id='type-id-4' name='i1' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1641' column='1'/>
      <parameter type-id='type-id-4' name='i2' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1641' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PySequence_SetSlice' mangled-name='PySequence_SetSlice' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1616' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_SetSlice'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1616' column='1'/>
      <parameter type-id='type-id-4' name='i1' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1616' column='1'/>
      <parameter type-id='type-id-4' name='i2' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1616' column='1'/>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1616' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PySequence_GetSlice' mangled-name='PySequence_GetSlice' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1541' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_GetSlice'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1541' column='1'/>
      <parameter type-id='type-id-4' name='i1' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1541' column='1'/>
      <parameter type-id='type-id-4' name='i2' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1541' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_InPlaceRepeat' mangled-name='PySequence_InPlaceRepeat' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1488' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_InPlaceRepeat'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1488' column='1'/>
      <parameter type-id='type-id-4' name='count' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1488' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_InPlaceConcat' mangled-name='PySequence_InPlaceConcat' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1464' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_InPlaceConcat'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1464' column='1'/>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1464' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_Repeat' mangled-name='PySequence_Repeat' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Repeat'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1435' column='1'/>
      <parameter type-id='type-id-4' name='count' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1435' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_Concat' mangled-name='PySequence_Concat' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Concat'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1411' column='1'/>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1411' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_Length' mangled-name='PySequence_Length' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Length'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1404' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySequence_Check' mangled-name='PySequence_Check' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1376' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Check'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1376' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyNumber_ToBase' mangled-name='PyNumber_ToBase' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1354' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_ToBase'>
      <parameter type-id='type-id-1' name='n' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1354' column='1'/>
      <parameter type-id='type-id-78' name='base' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1354' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Float' mangled-name='PyNumber_Float' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Float'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1327' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Long' mangled-name='PyNumber_Long' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1266' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Long'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1266' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_AsSsize_t' mangled-name='PyNumber_AsSsize_t' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1221' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_AsSsize_t'>
      <parameter type-id='type-id-1' name='item' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1221' column='1'/>
      <parameter type-id='type-id-1' name='err' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1221' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyNumber_Index' mangled-name='PyNumber_Index' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Index'>
      <parameter type-id='type-id-1' name='item' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1181' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Absolute' mangled-name='PyNumber_Absolute' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Absolute'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1163' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Invert' mangled-name='PyNumber_Invert' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Invert'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1149' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Positive' mangled-name='PyNumber_Positive' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Positive'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1135' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Negative' mangled-name='PyNumber_Negative' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1121' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Negative'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1121' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlacePower' mangled-name='PyNumber_InPlacePower' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlacePower'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1106' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1106' column='1'/>
      <parameter type-id='type-id-1' name='z' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1106' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceRemainder' mangled-name='PyNumber_InPlaceRemainder' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1099' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceRemainder'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1099' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1099' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceMultiply' mangled-name='PyNumber_InPlaceMultiply' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1063' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceMultiply'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1063' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1063' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceAdd' mangled-name='PyNumber_InPlaceAdd' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1042' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceAdd'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1042' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1042' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceTrueDivide' mangled-name='PyNumber_InPlaceTrueDivide' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1035' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceTrueDivide'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1035' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1035' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceFloorDivide' mangled-name='PyNumber_InPlaceFloorDivide' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1028' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceFloorDivide'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1028' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1028' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceSubtract' mangled-name='PyNumber_InPlaceSubtract' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1024' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceSubtract'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1024' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1024' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceRshift' mangled-name='PyNumber_InPlaceRshift' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1023' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceRshift'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1023' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1023' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceLshift' mangled-name='PyNumber_InPlaceLshift' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1022' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceLshift'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1022' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1022' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceAnd' mangled-name='PyNumber_InPlaceAnd' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1021' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceAnd'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1021' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1021' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceXor' mangled-name='PyNumber_InPlaceXor' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1020' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceXor'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1020' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1020' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceOr' mangled-name='PyNumber_InPlaceOr' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1019' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceOr'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1019' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1019' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Power' mangled-name='PyNumber_Power' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='963' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Power'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='963' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='963' column='1'/>
      <parameter type-id='type-id-1' name='z' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='963' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Remainder' mangled-name='PyNumber_Remainder' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='957' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Remainder'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='957' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='957' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_TrueDivide' mangled-name='PyNumber_TrueDivide' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='951' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_TrueDivide'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='951' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='951' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_FloorDivide' mangled-name='PyNumber_FloorDivide' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='945' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_FloorDivide'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='945' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='945' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_MatrixMultiply' mangled-name='PyNumber_MatrixMultiply' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='939' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_MatrixMultiply'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='939' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='939' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Multiply' mangled-name='PyNumber_Multiply' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='920' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Multiply'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='920' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='920' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Add' mangled-name='PyNumber_Add' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='889' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Add'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='889' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='889' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Divmod' mangled-name='PyNumber_Divmod' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='886' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Divmod'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='886' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='886' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Subtract' mangled-name='PyNumber_Subtract' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='885' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Subtract'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='885' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='885' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Rshift' mangled-name='PyNumber_Rshift' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='884' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Rshift'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='884' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='884' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Lshift' mangled-name='PyNumber_Lshift' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='883' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Lshift'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='883' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='883' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_And' mangled-name='PyNumber_And' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='882' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_And'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='882' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='882' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Xor' mangled-name='PyNumber_Xor' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='881' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Xor'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='881' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='881' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Or' mangled-name='PyNumber_Or' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='880' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Or'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='880' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='880' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Check' mangled-name='PyNumber_Check' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='708' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Check'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='708' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyObject_Format' mangled-name='PyObject_Format' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='665' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Format'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='665' column='1'/>
      <parameter type-id='type-id-1' name='format_spec' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='665' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyBuffer_Release' mangled-name='PyBuffer_Release' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='651' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_Release'>
      <parameter type-id='type-id-205' name='view' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='651' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='PyBuffer_FillInfo' mangled-name='PyBuffer_FillInfo' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='612' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FillInfo'>
      <parameter type-id='type-id-205' name='view' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='612' column='1'/>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='612' column='1'/>
      <parameter type-id='type-id-77' name='buf' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='612' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='612' column='1'/>
      <parameter type-id='type-id-78' name='readonly' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='613' column='1'/>
      <parameter type-id='type-id-78' name='flags' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='613' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyBuffer_FillContiguousStrides' mangled-name='PyBuffer_FillContiguousStrides' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='588' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FillContiguousStrides'>
      <parameter type-id='type-id-78' name='nd' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='588' column='1'/>
      <parameter type-id='type-id-135' name='shape' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='588' column='1'/>
      <parameter type-id='type-id-135' name='strides' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='589' column='1'/>
      <parameter type-id='type-id-78' name='itemsize' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='589' column='1'/>
      <parameter type-id='type-id-80' name='fort' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='590' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='PyObject_CopyData' mangled-name='PyObject_CopyData' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='517' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CopyData'>
      <parameter type-id='type-id-1' name='dest' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='517' column='1'/>
      <parameter type-id='type-id-1' name='src' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='517' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyBuffer_FromContiguous' mangled-name='PyBuffer_FromContiguous' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='466' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FromContiguous'>
      <parameter type-id='type-id-205' name='view' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='466' column='1'/>
      <parameter type-id='type-id-77' name='buf' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='466' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='466' column='1'/>
      <parameter type-id='type-id-80' name='fort' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='466' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='_Py_add_one_to_index_C' mangled-name='_Py_add_one_to_index_C' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_add_one_to_index_C'>
      <parameter type-id='type-id-78' name='nd' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='450' column='1'/>
      <parameter type-id='type-id-135' name='index' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='450' column='1'/>
      <parameter type-id='type-id-202' name='shape' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='450' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='_Py_add_one_to_index_F' mangled-name='_Py_add_one_to_index_F' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_add_one_to_index_F'>
      <parameter type-id='type-id-78' name='nd' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='434' column='1'/>
      <parameter type-id='type-id-135' name='index' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='434' column='1'/>
      <parameter type-id='type-id-202' name='shape' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='434' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='PyBuffer_GetPointer' mangled-name='PyBuffer_GetPointer' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='418' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_GetPointer'>
      <parameter type-id='type-id-205' name='view' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='418' column='1'/>
      <parameter type-id='type-id-135' name='indices' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='418' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyObject_GetBuffer' mangled-name='PyObject_GetBuffer' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='321' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetBuffer'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='321' column='1'/>
      <parameter type-id='type-id-205' name='view' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='321' column='1'/>
      <parameter type-id='type-id-78' name='flags' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='321' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyObject_AsWriteBuffer' mangled-name='PyObject_AsWriteBuffer' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='292' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsWriteBuffer'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='292' column='1'/>
      <parameter type-id='type-id-204' name='buffer' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='293' column='1'/>
      <parameter type-id='type-id-135' name='buffer_len' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='294' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyObject_CheckReadBuffer' mangled-name='PyObject_CheckReadBuffer' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='257' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CheckReadBuffer'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='257' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyObject_AsCharBuffer' mangled-name='PyObject_AsCharBuffer' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsCharBuffer'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='249' column='1'/>
      <parameter type-id='type-id-203' name='buffer' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='250' column='1'/>
      <parameter type-id='type-id-135' name='buffer_len' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='251' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyObject_DelItemString' mangled-name='PyObject_DelItemString' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='228' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_DelItemString'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='228' column='1'/>
      <parameter type-id='type-id-9' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='228' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='_PyObject_HasLen' mangled-name='_PyObject_HasLen' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_HasLen'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='68' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyObject_Length' mangled-name='PyObject_Length' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Length'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='61' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_Type' mangled-name='PyObject_Type' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='31' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Type'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='31' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyBuffer_IsContiguous' mangled-name='PyBuffer_IsContiguous' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='402' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_IsContiguous'>
      <parameter type-id='type-id-200' name='view' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='402' column='1'/>
      <parameter type-id='type-id-80' name='order' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='402' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyObject_AsReadBuffer' mangled-name='PyObject_AsReadBuffer' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsReadBuffer'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='273' column='1'/>
      <parameter type-id='type-id-204' name='buffer' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='274' column='1'/>
      <parameter type-id='type-id-135' name='buffer_len' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='275' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceMatrixMultiply' mangled-name='PyNumber_InPlaceMatrixMultiply' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1092' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceMatrixMultiply'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1092' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1092' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_Size' mangled-name='PySequence_Size' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1385' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Size'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1385' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySequence_GetItem' mangled-name='PySequence_GetItem' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1517' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_GetItem'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1517' column='1'/>
      <parameter type-id='type-id-4' name='i' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1517' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyObject_GetItem' mangled-name='PyObject_GetItem' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='136' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetItem'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='136' column='1'/>
      <parameter type-id='type-id-1' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='136' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_SetItem' mangled-name='PySequence_SetItem' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1562' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_SetItem'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1562' column='1'/>
      <parameter type-id='type-id-4' name='i' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1562' column='1'/>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1562' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyObject_SetItem' mangled-name='PyObject_SetItem' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_SetItem'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='164' column='1'/>
      <parameter type-id='type-id-1' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='164' column='1'/>
      <parameter type-id='type-id-1' name='value' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='164' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PySequence_DelItem' mangled-name='PySequence_DelItem' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1589' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_DelItem'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1589' column='1'/>
      <parameter type-id='type-id-4' name='i' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1589' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyObject_DelItem' mangled-name='PyObject_DelItem' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='196' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_DelItem'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='196' column='1'/>
      <parameter type-id='type-id-1' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='196' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PySequence_List' mangled-name='PySequence_List' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1747' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_List'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1747' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyMapping_Size' mangled-name='PyMapping_Size' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1927' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Size'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1927' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_Size' mangled-name='PyObject_Size' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Size'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='43' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyMapping_GetItemString' mangled-name='PyMapping_GetItemString' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1953' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_GetItemString'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1953' column='1'/>
      <parameter type-id='type-id-9' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1953' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_CheckFunctionResult' mangled-name='_Py_CheckFunctionResult' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2077' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_CheckFunctionResult'>
      <parameter type-id='type-id-1' name='func' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2077' column='1'/>
      <parameter type-id='type-id-1' name='result' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2077' column='1'/>
      <parameter type-id='type-id-9' name='where' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2077' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyObject_LengthHint' mangled-name='PyObject_LengthHint' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_LengthHint'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='80' column='1'/>
      <parameter type-id='type-id-4' name='defaultvalue' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='80' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_GetIter' mangled-name='PyObject_GetIter' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2725' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetIter'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2725' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_Fast' mangled-name='PySequence_Fast' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1769' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Fast'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1769' column='1'/>
      <parameter type-id='type-id-9' name='m' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1769' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyIter_Next' mangled-name='PyIter_Next' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2757' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyIter_Next'>
      <parameter type-id='type-id-1' name='iter' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='2757' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PySequence_IterSearch' mangled-name='_PySequence_IterSearch' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1801' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySequence_IterSearch'>
      <parameter type-id='type-id-1' name='seq' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1801' column='1'/>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1801' column='1'/>
      <parameter type-id='type-id-78' name='operation' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1801' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySequence_Contains' mangled-name='PySequence_Contains' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1893' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Contains'>
      <parameter type-id='type-id-1' name='seq' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1893' column='1'/>
      <parameter type-id='type-id-1' name='ob' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/abstract.c' line='1893' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <pointer-type-def type-id='type-id-198' size-in-bits='64' id='type-id-205'/>
    <typedef-decl name='Py_buffer' type-id='type-id-206' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='192' column='1' id='type-id-198'/>
    <class-decl name='bufferinfo' size-in-bits='640' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='179' column='1' id='type-id-206'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='obj' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='len' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='itemsize' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='readonly' type-id='type-id-78' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ndim' type-id='type-id-78' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='format' type-id='type-id-74' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='shape' type-id='type-id-135' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='strides' type-id='type-id-135' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='suboffsets' type-id='type-id-135' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='internal' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='191' column='1'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/accu.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <typedef-decl name='_PyAccu' type-id='type-id-207' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/accu.h' line='24' column='1' id='type-id-208'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-208' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/accu.h' line='21' column='1' id='type-id-207'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='large' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/accu.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='small' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/accu.h' line='23' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-208' size-in-bits='64' id='type-id-209'/>
    <function-decl name='_PyAccu_Destroy' mangled-name='_PyAccu_Destroy' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/accu.c' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Destroy'>
      <parameter type-id='type-id-209' name='acc' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/accu.c' line='111' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='_PyAccu_Finish' mangled-name='_PyAccu_Finish' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/accu.c' line='93' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Finish'>
      <parameter type-id='type-id-209' name='acc' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/accu.c' line='93' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyAccu_Accumulate' mangled-name='_PyAccu_Accumulate' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/accu.c' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Accumulate'>
      <parameter type-id='type-id-209' name='acc' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/accu.c' line='55' column='1'/>
      <parameter type-id='type-id-1' name='unicode' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/accu.c' line='55' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='_PyAccu_Init' mangled-name='_PyAccu_Init' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/accu.c' line='18' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Init'>
      <parameter type-id='type-id-209' name='acc' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/accu.c' line='18' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='_PyAccu_FinishAsList' mangled-name='_PyAccu_FinishAsList' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/accu.c' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_FinishAsList'>
      <parameter type-id='type-id-209' name='acc' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/accu.c' line='76' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/boolobject.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-210' size-in-bits='32' id='type-id-211'>
      <subrange length='1' type-id='type-id-24' id='type-id-212'/>
    </array-type-def>
    <typedef-decl name='PyTypeObject' type-id='type-id-6' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/object.h' line='431' column='1' id='type-id-134'/>
    <class-decl name='_longobject' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/longintrepr.h' line='89' column='1' id='type-id-213'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-8' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/longintrepr.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ob_digit' type-id='type-id-211' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/longintrepr.h' line='91' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='digit' type-id='type-id-214' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/longintrepr.h' line='49' column='1' id='type-id-210'/>
    <typedef-decl name='uint32_t' type-id='type-id-215' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-214'/>
    <typedef-decl name='__uint32_t' type-id='type-id-39' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='41' column='1' id='type-id-215'/>
    <var-decl name='PyBool_Type' type-id='type-id-134' mangled-name='PyBool_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/boolobject.h' line='10' column='1' elf-symbol-id='PyBool_Type'/>
    <var-decl name='_Py_FalseStruct' type-id='type-id-213' mangled-name='_Py_FalseStruct' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/boolobject.h' line='18' column='1' elf-symbol-id='_Py_FalseStruct'/>
    <var-decl name='_Py_TrueStruct' type-id='type-id-213' mangled-name='_Py_TrueStruct' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/boolobject.h' line='18' column='1' elf-symbol-id='_Py_TrueStruct'/>
    <function-decl name='PyBool_FromLong' mangled-name='PyBool_FromLong' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/boolobject.c' line='28' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBool_FromLong'>
      <parameter type-id='type-id-51' name='ok' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/boolobject.c' line='28' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytearrayobject.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-80' size-in-bits='infinite' id='type-id-216'>
      <subrange length='infinite' id='type-id-217'/>
    </array-type-def>
    <var-decl name='_PyByteArray_empty_string' type-id='type-id-216' mangled-name='_PyByteArray_empty_string' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/bytearrayobject.h' line='56' column='1' elf-symbol-id='_PyByteArray_empty_string'/>
    <var-decl name='PyByteArray_Type' type-id='type-id-134' mangled-name='PyByteArray_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/bytearrayobject.h' line='34' column='1' elf-symbol-id='PyByteArray_Type'/>
    <var-decl name='PyByteArrayIter_Type' type-id='type-id-134' mangled-name='PyByteArrayIter_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/bytearrayobject.h' line='35' column='1' elf-symbol-id='PyByteArrayIter_Type'/>
    <function-decl name='PyByteArray_Concat' mangled-name='PyByteArray_Concat' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytearrayobject.c' line='247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Concat'>
      <parameter type-id='type-id-1' name='a' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytearrayobject.c' line='247' column='1'/>
      <parameter type-id='type-id-1' name='b' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytearrayobject.c' line='247' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyByteArray_Resize' mangled-name='PyByteArray_Resize' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytearrayobject.c' line='168' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Resize'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytearrayobject.c' line='168' column='1'/>
      <parameter type-id='type-id-4' name='requested_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytearrayobject.c' line='168' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyByteArray_AsString' mangled-name='PyByteArray_AsString' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytearrayobject.c' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_AsString'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytearrayobject.c' line='159' column='1'/>
      <return type-id='type-id-74'/>
    </function-decl>
    <function-decl name='PyByteArray_Size' mangled-name='PyByteArray_Size' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytearrayobject.c' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Size'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytearrayobject.c' line='150' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyByteArray_FromObject' mangled-name='PyByteArray_FromObject' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytearrayobject.c' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_FromObject'>
      <parameter type-id='type-id-1' name='input' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytearrayobject.c' line='99' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyByteArray_Init' mangled-name='PyByteArray_Init' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytearrayobject.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Init'>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyByteArray_Fini' mangled-name='PyByteArray_Fini' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytearrayobject.c' line='18' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Fini'>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='PyByteArray_FromStringAndSize' mangled-name='PyByteArray_FromStringAndSize' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytearrayobject.c' line='106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_FromStringAndSize'>
      <parameter type-id='type-id-9' name='bytes' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytearrayobject.c' line='106' column='1'/>
      <parameter type-id='type-id-4' name='size' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytearrayobject.c' line='106' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-49' size-in-bits='infinite' id='type-id-218'>
      <subrange length='infinite' id='type-id-217'/>
    </array-type-def>
    <var-decl name='_Py_isspace__doc__' type-id='type-id-218' mangled-name='_Py_isspace__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/bytes_methods.h' line='28' column='1' elf-symbol-id='_Py_isspace__doc__'/>
    <var-decl name='_Py_isalpha__doc__' type-id='type-id-218' mangled-name='_Py_isalpha__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/bytes_methods.h' line='29' column='1' elf-symbol-id='_Py_isalpha__doc__'/>
    <var-decl name='_Py_isalnum__doc__' type-id='type-id-218' mangled-name='_Py_isalnum__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/bytes_methods.h' line='30' column='1' elf-symbol-id='_Py_isalnum__doc__'/>
    <var-decl name='_Py_isdigit__doc__' type-id='type-id-218' mangled-name='_Py_isdigit__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/bytes_methods.h' line='31' column='1' elf-symbol-id='_Py_isdigit__doc__'/>
    <var-decl name='_Py_islower__doc__' type-id='type-id-218' mangled-name='_Py_islower__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/bytes_methods.h' line='32' column='1' elf-symbol-id='_Py_islower__doc__'/>
    <var-decl name='_Py_isupper__doc__' type-id='type-id-218' mangled-name='_Py_isupper__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/bytes_methods.h' line='33' column='1' elf-symbol-id='_Py_isupper__doc__'/>
    <var-decl name='_Py_istitle__doc__' type-id='type-id-218' mangled-name='_Py_istitle__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/bytes_methods.h' line='34' column='1' elf-symbol-id='_Py_istitle__doc__'/>
    <var-decl name='_Py_lower__doc__' type-id='type-id-218' mangled-name='_Py_lower__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/bytes_methods.h' line='35' column='1' elf-symbol-id='_Py_lower__doc__'/>
    <var-decl name='_Py_upper__doc__' type-id='type-id-218' mangled-name='_Py_upper__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/bytes_methods.h' line='36' column='1' elf-symbol-id='_Py_upper__doc__'/>
    <var-decl name='_Py_title__doc__' type-id='type-id-218' mangled-name='_Py_title__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/bytes_methods.h' line='37' column='1' elf-symbol-id='_Py_title__doc__'/>
    <var-decl name='_Py_capitalize__doc__' type-id='type-id-218' mangled-name='_Py_capitalize__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/bytes_methods.h' line='38' column='1' elf-symbol-id='_Py_capitalize__doc__'/>
    <var-decl name='_Py_swapcase__doc__' type-id='type-id-218' mangled-name='_Py_swapcase__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/bytes_methods.h' line='39' column='1' elf-symbol-id='_Py_swapcase__doc__'/>
    <var-decl name='_Py_maketrans__doc__' type-id='type-id-218' mangled-name='_Py_maketrans__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/bytes_methods.h' line='40' column='1' elf-symbol-id='_Py_maketrans__doc__'/>
    <function-decl name='_Py_bytes_maketrans' mangled-name='_Py_bytes_maketrans' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='367' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_maketrans'>
      <parameter type-id='type-id-205' name='frm' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='367' column='1'/>
      <parameter type-id='type-id-205' name='to' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='367' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_swapcase' mangled-name='_Py_bytes_swapcase' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='339' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_swapcase'>
      <parameter type-id='type-id-74' name='result' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='339' column='1'/>
      <parameter type-id='type-id-74' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='339' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='339' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='_Py_bytes_capitalize' mangled-name='_Py_bytes_capitalize' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_capitalize'>
      <parameter type-id='type-id-74' name='result' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='309' column='1'/>
      <parameter type-id='type-id-74' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='309' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='309' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='_Py_bytes_title' mangled-name='_Py_bytes_title' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_title'>
      <parameter type-id='type-id-74' name='result' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='280' column='1'/>
      <parameter type-id='type-id-74' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='280' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='280' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='_Py_bytes_upper' mangled-name='_Py_bytes_upper' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_upper'>
      <parameter type-id='type-id-74' name='result' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='263' column='1'/>
      <parameter type-id='type-id-9' name='cptr' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='263' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='263' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='_Py_bytes_lower' mangled-name='_Py_bytes_lower' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_lower'>
      <parameter type-id='type-id-74' name='result' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='247' column='1'/>
      <parameter type-id='type-id-9' name='cptr' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='247' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='247' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='_Py_bytes_istitle' mangled-name='_Py_bytes_istitle' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_istitle'>
      <parameter type-id='type-id-9' name='cptr' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='201' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='201' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_isupper' mangled-name='_Py_bytes_isupper' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_isupper'>
      <parameter type-id='type-id-9' name='cptr' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='165' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='165' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_islower' mangled-name='_Py_bytes_islower' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_islower'>
      <parameter type-id='type-id-9' name='cptr' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='131' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='131' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_isdigit' mangled-name='_Py_bytes_isdigit' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_isdigit'>
      <parameter type-id='type-id-9' name='cptr' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='101' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='101' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_isalnum' mangled-name='_Py_bytes_isalnum' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_isalnum'>
      <parameter type-id='type-id-9' name='cptr' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='71' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='71' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_isalpha' mangled-name='_Py_bytes_isalpha' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_isalpha'>
      <parameter type-id='type-id-9' name='cptr' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='41' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='41' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_isspace' mangled-name='_Py_bytes_isspace' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='11' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_isspace'>
      <parameter type-id='type-id-9' name='cptr' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='11' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytes_methods.c' line='11' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-219'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-77' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-77' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-220'/>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-221'/>
    <var-decl name='PyBytes_Type' type-id='type-id-134' mangled-name='PyBytes_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/bytesobject.h' line='44' column='1' elf-symbol-id='PyBytes_Type'/>
    <var-decl name='PyBytesIter_Type' type-id='type-id-134' mangled-name='PyBytesIter_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/bytesobject.h' line='45' column='1' elf-symbol-id='PyBytesIter_Type'/>
    <function-decl name='PyBytes_Fini' mangled-name='PyBytes_Fini' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='3575' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_Fini'>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='_PyBytes_Resize' mangled-name='_PyBytes_Resize' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='3545' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_Resize'>
      <parameter type-id='type-id-220' name='pv' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='3545' column='1'/>
      <parameter type-id='type-id-4' name='newsize' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='3545' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyBytes_ConcatAndDel' mangled-name='PyBytes_ConcatAndDel' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='3523' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_ConcatAndDel'>
      <parameter type-id='type-id-220' name='pv' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='3523' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='3523' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='PyBytes_Concat' mangled-name='PyBytes_Concat' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='3472' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_Concat'>
      <parameter type-id='type-id-220' name='pv' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='3472' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='3472' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='PyBytes_FromObject' mangled-name='PyBytes_FromObject' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='3242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromObject'>
      <parameter type-id='type-id-1' name='x' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='3242' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyBytes_Join' mangled-name='_PyBytes_Join' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='1765' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_Join'>
      <parameter type-id='type-id-1' name='sep' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='1765' column='1'/>
      <parameter type-id='type-id-1' name='x' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='1765' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyBytes_Repr' mangled-name='PyBytes_Repr' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='1169' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_Repr'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='1169' column='1'/>
      <parameter type-id='type-id-78' name='smartquotes' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='1169' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyBytes_AsStringAndSize' mangled-name='PyBytes_AsStringAndSize' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='1127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_AsStringAndSize'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='1127' column='1'/>
      <parameter type-id='type-id-222' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='1128' column='1'/>
      <parameter type-id='type-id-135' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='1129' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyBytes_AsString' mangled-name='PyBytes_AsString' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='1116' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_AsString'>
      <parameter type-id='type-id-1' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='1116' column='1'/>
      <return type-id='type-id-74'/>
    </function-decl>
    <function-decl name='PyBytes_Size' mangled-name='PyBytes_Size' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='1105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_Size'>
      <parameter type-id='type-id-1' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='1105' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBytes_DecodeEscape' mangled-name='PyBytes_DecodeEscape' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='964' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_DecodeEscape'>
      <parameter type-id='type-id-9' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='964' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='965' column='1'/>
      <parameter type-id='type-id-9' name='errors' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='966' column='1'/>
      <parameter type-id='type-id-4' name='unicode' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='967' column='1'/>
      <parameter type-id='type-id-9' name='recode_encoding' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='968' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyBytes_Format' mangled-name='_PyBytes_Format' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='571' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_Format'>
      <parameter type-id='type-id-1' name='format' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='571' column='1'/>
      <parameter type-id='type-id-1' name='args' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='571' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyBytes_FromFormat' mangled-name='PyBytes_FromFormat' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='364' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromFormat'>
      <parameter type-id='type-id-9' name='format' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='364' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyBytes_FromFormatV' mangled-name='PyBytes_FromFormatV' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='175' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromFormatV'>
      <parameter type-id='type-id-9' name='format' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='175' column='1'/>
      <parameter type-id='type-id-221' name='vargs' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='175' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyBytes_FromString' mangled-name='PyBytes_FromString' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromString'>
      <parameter type-id='type-id-9' name='str' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='129' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyBytes_FromStringAndSize' mangled-name='PyBytes_FromStringAndSize' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='95' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromStringAndSize'>
      <parameter type-id='type-id-9' name='str' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='95' column='1'/>
      <parameter type-id='type-id-4' name='size' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/bytesobject.c' line='95' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-222'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/spack-build' language='LANG_C99'>
    <typedef-decl name='PyCapsule_Destructor' type-id='type-id-55' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/pycapsule.h' line='23' column='1' id='type-id-223'/>
    <var-decl name='PyCapsule_Type' type-id='type-id-134' mangled-name='PyCapsule_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Include/pycapsule.h' line='21' column='1' elf-symbol-id='PyCapsule_Type'/>
    <function-decl name='PyCapsule_Import' mangled-name='PyCapsule_Import' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_Import'>
      <parameter type-id='type-id-9' name='name' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='195' column='1'/>
      <parameter type-id='type-id-78' name='no_block' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='195' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyCapsule_SetContext' mangled-name='PyCapsule_SetContext' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_SetContext'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='181' column='1'/>
      <parameter type-id='type-id-77' name='context' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='181' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyCapsule_SetDestructor' mangled-name='PyCapsule_SetDestructor' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_SetDestructor'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='167' column='1'/>
      <parameter type-id='type-id-223' name='destructor' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='167' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyCapsule_SetName' mangled-name='PyCapsule_SetName' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_SetName'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='153' column='1'/>
      <parameter type-id='type-id-9' name='name' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='153' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyCapsule_SetPointer' mangled-name='PyCapsule_SetPointer' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_SetPointer'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='134' column='1'/>
      <parameter type-id='type-id-77' name='pointer' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='134' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='PyCapsule_GetContext' mangled-name='PyCapsule_GetContext' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_GetContext'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='122' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyCapsule_GetDestructor' mangled-name='PyCapsule_GetDestructor' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_GetDestructor'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='110' column='1'/>
      <return type-id='type-id-223'/>
    </function-decl>
    <function-decl name='PyCapsule_GetName' mangled-name='PyCapsule_GetName' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_GetName'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='98' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyCapsule_GetPointer' mangled-name='PyCapsule_GetPointer' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_GetPointer'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='80' column='1'/>
      <parameter type-id='type-id-9' name='name' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='80' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyCapsule_New' mangled-name='PyCapsule_New' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_New'>
      <parameter type-id='type-id-77' name='pointer' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='44' column='1'/>
      <parameter type-id='type-id-9' name='name' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='44' column='1'/>
      <parameter type-id='type-id-223' name='destructor' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='44' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyCapsule_IsValid' mangled-name='PyCapsule_IsValid' filepath='/tmp/root/spack-stage/spack-stage-python-3.5.0-cykirkwf4c5yokwyfvgyevaufb4aedfs/spack-src/Objects/capsule.c' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_IsValid'>
