<abi-corpus path='/opt/spack/opt/spack/linux-ubuntu18.04-x86_64/gcc-7.5.0/python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/lib/libpython3.9.so' architecture='elf-amd-x86_64' soname='libpython3.9.so.1.0'>
  <elf-needed>
    <dependency name='libintl.so.8'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libutil.so.1'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='PyAST_CompileEx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_CompileObject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_FromNode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_FromNodeObject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_Validate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArena_AddPyObject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArena_Free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_PyInterpreterID_Type' size='408' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyLong_DigitValue' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyLong_One' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyLong_Zero' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyManagedBuffer_Type' size='408' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyMethodWrapper_Type' size='408' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyNamespace_Type' size='408' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyNone_Type' size='408' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyNotImplemented_Type' size='408' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyOS_ReadlineTState' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyParser_Grammar' size='40' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyParser_TokenNames' size='512' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyRuntime' size='656' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PySet_Dummy' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyWeakref_CallableProxyType' size='408' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyWeakref_ProxyType' size='408' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyWeakref_RefType' size='408' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_CheckRecursionLimit' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_EllipsisObject' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_FalseStruct' size='32' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_HashSecret' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_NoneStruct' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_NotImplementedStruct' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_PackageContext' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_SwappedOp' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_TrueStruct' size='32' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_UnhandledKeyboardInterrupt' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ascii_whitespace' size='128' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_table' size='1024' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_tolower' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_toupper' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_path_config' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_tracemalloc_config' size='12' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_abc.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__abc' mangled-name='PyInit__abc' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_abc.c' line='905' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__abc'>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-1'/>
    <typedef-decl name='PyObject' type-id='type-id-3' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='109' column='1' id='type-id-2'/>
    <class-decl name='_object' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='105' column='1' id='type-id-3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_refcnt' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ob_type' type-id='type-id-5' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='108' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-5'/>
    <typedef-decl name='Py_ssize_t' type-id='type-id-7' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/pyport.h' line='105' column='1' id='type-id-4'/>
    <typedef-decl name='PyTypeObject' type-id='type-id-8' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='66' column='1' id='type-id-6'/>
    <typedef-decl name='ssize_t' type-id='type-id-9' filepath='/usr/include/stdio.h' line='71' column='1' id='type-id-7'/>
    <class-decl name='_typeobject' size-in-bits='3264' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='193' column='1' id='type-id-8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-10' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tp_name' type-id='type-id-11' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tp_basicsize' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tp_itemsize' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tp_dealloc' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tp_vectorcall_offset' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='tp_getattr' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tp_setattr' type-id='type-id-14' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='tp_as_async' type-id='type-id-15' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='tp_repr' type-id='type-id-16' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='tp_as_number' type-id='type-id-17' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='tp_as_sequence' type-id='type-id-18' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='tp_as_mapping' type-id='type-id-19' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='tp_hash' type-id='type-id-20' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='tp_call' type-id='type-id-21' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='tp_str' type-id='type-id-16' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='tp_getattro' type-id='type-id-22' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='tp_setattro' type-id='type-id-23' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='tp_as_buffer' type-id='type-id-24' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='tp_flags' type-id='type-id-25' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='tp_doc' type-id='type-id-11' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='tp_traverse' type-id='type-id-26' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='tp_clear' type-id='type-id-27' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='tp_richcompare' type-id='type-id-28' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='tp_weaklistoffset' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='tp_iter' type-id='type-id-29' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='tp_iternext' type-id='type-id-30' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='tp_methods' type-id='type-id-31' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='tp_members' type-id='type-id-32' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='tp_getset' type-id='type-id-33' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='tp_base' type-id='type-id-34' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='tp_dict' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='tp_descr_get' type-id='type-id-35' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tp_descr_set' type-id='type-id-36' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='tp_dictoffset' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='tp_init' type-id='type-id-37' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='tp_alloc' type-id='type-id-38' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='tp_new' type-id='type-id-39' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='tp_free' type-id='type-id-40' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='tp_is_gc' type-id='type-id-27' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='tp_bases' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='tp_mro' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='tp_cache' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='tp_subclasses' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='tp_weaklist' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='tp_del' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='tp_version_tag' type-id='type-id-41' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='tp_finalize' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='tp_vectorcall' type-id='type-id-42' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='273' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__ssize_t' type-id='type-id-43' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='181' column='1' id='type-id-9'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-15'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-24'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-33'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-19'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-32'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-34'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-11'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-43'/>
    <typedef-decl name='PyVarObject' type-id='type-id-53' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='118' column='1' id='type-id-10'/>
    <typedef-decl name='allocfunc' type-id='type-id-54' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='194' column='1' id='type-id-38'/>
    <typedef-decl name='descrgetfunc' type-id='type-id-55' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='190' column='1' id='type-id-35'/>
    <typedef-decl name='descrsetfunc' type-id='type-id-56' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='191' column='1' id='type-id-36'/>
    <typedef-decl name='destructor' type-id='type-id-57' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='180' column='1' id='type-id-12'/>
    <typedef-decl name='freefunc' type-id='type-id-58' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='179' column='1' id='type-id-40'/>
    <typedef-decl name='getattrfunc' type-id='type-id-59' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='181' column='1' id='type-id-13'/>
    <typedef-decl name='getattrofunc' type-id='type-id-60' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='182' column='1' id='type-id-22'/>
    <typedef-decl name='getiterfunc' type-id='type-id-61' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='188' column='1' id='type-id-29'/>
    <typedef-decl name='hashfunc' type-id='type-id-62' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='186' column='1' id='type-id-20'/>
    <typedef-decl name='initproc' type-id='type-id-56' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='192' column='1' id='type-id-37'/>
    <typedef-decl name='inquiry' type-id='type-id-63' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='166' column='1' id='type-id-27'/>
    <typedef-decl name='iternextfunc' type-id='type-id-61' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='189' column='1' id='type-id-30'/>
    <typedef-decl name='newfunc' type-id='type-id-64' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='193' column='1' id='type-id-39'/>
    <typedef-decl name='reprfunc' type-id='type-id-61' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='185' column='1' id='type-id-16'/>
    <typedef-decl name='richcmpfunc' type-id='type-id-65' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='187' column='1' id='type-id-28'/>
    <typedef-decl name='setattrfunc' type-id='type-id-66' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='183' column='1' id='type-id-14'/>
    <typedef-decl name='setattrofunc' type-id='type-id-56' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='184' column='1' id='type-id-23'/>
    <typedef-decl name='ternaryfunc' type-id='type-id-55' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='165' column='1' id='type-id-21'/>
    <typedef-decl name='traverseproc' type-id='type-id-67' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='176' column='1' id='type-id-26'/>
    <typedef-decl name='vectorcallfunc' type-id='type-id-68' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='74' column='1' id='type-id-42'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-41'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-25'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-61'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-68'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-60'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-55'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-65'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-59'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-64'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-54'/>
    <class-decl name='PyGetSetDef' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/descrobject.h' line='11' column='1' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-11' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/descrobject.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='get' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/descrobject.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='set' type-id='type-id-78' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/descrobject.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='doc' type-id='type-id-11' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/descrobject.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='closure' type-id='type-id-79' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/descrobject.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyMemberDef' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/structmember.h' line='18' column='1' id='type-id-48'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-11' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/structmember.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/structmember.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offset' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/structmember.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flags' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/structmember.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='doc' type-id='type-id-11' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/structmember.h' line='23' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyMethodDef' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/methodobject.h' line='35' column='1' id='type-id-49'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ml_name' type-id='type-id-11' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/methodobject.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ml_meth' type-id='type-id-81' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/methodobject.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ml_flags' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/methodobject.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ml_doc' type-id='type-id-11' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/methodobject.h' line='40' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-10' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='115' column='1' id='type-id-53'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-2' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ob_size' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='117' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-82' const='yes' id='type-id-52'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-63'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-56'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-66'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-67'/>
    <typedef-decl name='PyAsyncMethods' type-id='type-id-87' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='182' column='1' id='type-id-44'/>
    <typedef-decl name='PyBufferProcs' type-id='type-id-88' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='187' column='1' id='type-id-45'/>
    <typedef-decl name='PyMappingMethods' type-id='type-id-89' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='176' column='1' id='type-id-47'/>
    <typedef-decl name='PyNumberMethods' type-id='type-id-90' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='156' column='1' id='type-id-50'/>
    <typedef-decl name='PySequenceMethods' type-id='type-id-91' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='170' column='1' id='type-id-51'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-62'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-57'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-58'/>
    <type-decl name='char' size-in-bits='8' id='type-id-82'/>
    <class-decl name='__anonymous_struct__11' size-in-bits='2304' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-50' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='111' column='1' id='type-id-90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_add' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nb_subtract' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nb_multiply' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nb_remainder' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nb_divmod' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nb_power' type-id='type-id-21' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nb_negative' type-id='type-id-96' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nb_positive' type-id='type-id-96' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nb_absolute' type-id='type-id-96' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='nb_bool' type-id='type-id-27' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='nb_invert' type-id='type-id-96' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='nb_lshift' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='nb_rshift' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='nb_and' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='nb_xor' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='nb_or' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='nb_int' type-id='type-id-96' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='nb_reserved' type-id='type-id-79' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='nb_float' type-id='type-id-96' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='nb_inplace_add' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='nb_inplace_subtract' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='nb_inplace_multiply' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='nb_inplace_remainder' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='nb_inplace_power' type-id='type-id-21' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='nb_inplace_lshift' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='nb_inplace_rshift' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='nb_inplace_and' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='nb_inplace_xor' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='nb_inplace_or' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='nb_floor_divide' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='nb_true_divide' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='nb_inplace_floor_divide' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='nb_inplace_true_divide' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='nb_index' type-id='type-id-96' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='nb_matrix_multiply' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='nb_inplace_matrix_multiply' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='155' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__14' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-45' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='184' column='1' id='type-id-88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bf_getbuffer' type-id='type-id-97' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bf_releasebuffer' type-id='type-id-98' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='186' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-47' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='172' column='1' id='type-id-89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mp_length' type-id='type-id-99' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp_subscript' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mp_ass_subscript' type-id='type-id-100' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='175' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='640' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-51' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='158' column='1' id='type-id-91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sq_length' type-id='type-id-99' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sq_concat' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sq_repeat' type-id='type-id-101' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sq_item' type-id='type-id-101' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='was_sq_slice' type-id='type-id-79' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='sq_ass_item' type-id='type-id-102' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='was_sq_ass_slice' type-id='type-id-79' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='sq_contains' type-id='type-id-103' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='sq_inplace_concat' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='sq_inplace_repeat' type-id='type-id-101' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='169' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-44' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='178' column='1' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='am_await' type-id='type-id-96' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='am_aiter' type-id='type-id-96' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='am_anext' type-id='type-id-96' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='181' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-80'/>
    <typedef-decl name='PyCFunction' type-id='type-id-60' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/methodobject.h' line='19' column='1' id='type-id-81'/>
    <typedef-decl name='getter' type-id='type-id-104' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/descrobject.h' line='8' column='1' id='type-id-77'/>
    <typedef-decl name='setter' type-id='type-id-105' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/descrobject.h' line='9' column='1' id='type-id-78'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-104'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-105'/>
    <typedef-decl name='binaryfunc' type-id='type-id-60' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='164' column='1' id='type-id-95'/>
    <typedef-decl name='getbufferproc' type-id='type-id-109' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='71' column='1' id='type-id-97'/>
    <typedef-decl name='lenfunc' type-id='type-id-110' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='167' column='1' id='type-id-99'/>
    <typedef-decl name='objobjargproc' type-id='type-id-56' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='172' column='1' id='type-id-100'/>
    <typedef-decl name='objobjproc' type-id='type-id-111' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='174' column='1' id='type-id-103'/>
    <typedef-decl name='releasebufferproc' type-id='type-id-112' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/object.h' line='72' column='1' id='type-id-98'/>
    <typedef-decl name='ssizeargfunc' type-id='type-id-113' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='168' column='1' id='type-id-101'/>
    <typedef-decl name='ssizeobjargproc' type-id='type-id-114' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='170' column='1' id='type-id-102'/>
    <typedef-decl name='unaryfunc' type-id='type-id-61' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/object.h' line='163' column='1' id='type-id-96'/>
    <type-decl name='void' id='type-id-106'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-113'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-111'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-109'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-114'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-110'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-112'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_codecsmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__codecs' mangled-name='PyInit__codecs' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_codecsmodule.c' line='1059' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__codecs'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_collectionsmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__collections' mangled-name='PyInit__collections' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_collectionsmodule.c' line='2612' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__collections'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_functoolsmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__functools' mangled-name='PyInit__functools' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_functoolsmodule.c' line='1470' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__functools'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='_PyIO_str_close' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='159' column='1'/>
    <var-decl name='_PyIO_str_closed' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='160' column='1'/>
    <var-decl name='_PyIO_str_decode' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='161' column='1'/>
    <var-decl name='_PyIO_str_encode' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='162' column='1'/>
    <var-decl name='_PyIO_str_fileno' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='163' column='1'/>
    <var-decl name='_PyIO_str_flush' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='164' column='1'/>
    <var-decl name='_PyIO_str_getstate' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='165' column='1'/>
    <var-decl name='_PyIO_str_isatty' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='166' column='1'/>
    <var-decl name='_PyIO_str_newlines' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='167' column='1'/>
    <var-decl name='_PyIO_str_nl' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='168' column='1'/>
    <var-decl name='_PyIO_str_peek' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='169' column='1'/>
    <var-decl name='_PyIO_str_read' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='170' column='1'/>
    <var-decl name='_PyIO_str_read1' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='171' column='1'/>
    <var-decl name='_PyIO_str_readable' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='172' column='1'/>
    <var-decl name='_PyIO_str_readall' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='173' column='1'/>
    <var-decl name='_PyIO_str_readinto' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='174' column='1'/>
    <var-decl name='_PyIO_str_readline' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='175' column='1'/>
    <var-decl name='_PyIO_str_reset' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='176' column='1'/>
    <var-decl name='_PyIO_str_seek' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='177' column='1'/>
    <var-decl name='_PyIO_str_seekable' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='178' column='1'/>
    <var-decl name='_PyIO_str_setstate' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='179' column='1'/>
    <var-decl name='_PyIO_str_tell' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='180' column='1'/>
    <var-decl name='_PyIO_str_truncate' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='181' column='1'/>
    <var-decl name='_PyIO_str_writable' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='182' column='1'/>
    <var-decl name='_PyIO_str_write' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='183' column='1'/>
    <var-decl name='_PyIO_empty_str' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='185' column='1'/>
    <var-decl name='_PyIO_empty_bytes' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='186' column='1'/>
    <var-decl name='_PyIO_Module' type-id='type-id-121' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='140' column='1'/>
    <function-decl name='PyInit__io' mangled-name='PyInit__io' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.c' line='676' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__io'>
      <return type-id='type-id-1'/>
    </function-decl>
    <typedef-decl name='PyModuleDef' type-id='type-id-122' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/moduleobject.h' line='85' column='1' id='type-id-121'/>
    <class-decl name='PyModuleDef' size-in-bits='832' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/moduleobject.h' line='75' column='1' id='type-id-122'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_base' type-id='type-id-123' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/moduleobject.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='m_name' type-id='type-id-11' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/moduleobject.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='m_doc' type-id='type-id-11' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/moduleobject.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='m_size' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/moduleobject.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='m_methods' type-id='type-id-31' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/moduleobject.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='m_slots' type-id='type-id-124' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/moduleobject.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='m_traverse' type-id='type-id-26' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/moduleobject.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='m_clear' type-id='type-id-27' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/moduleobject.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='m_free' type-id='type-id-40' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/moduleobject.h' line='84' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-124'/>
    <typedef-decl name='PyModuleDef_Base' type-id='type-id-126' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/moduleobject.h' line='49' column='1' id='type-id-123'/>
    <class-decl name='PyModuleDef_Base' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/moduleobject.h' line='44' column='1' id='type-id-126'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-2' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/moduleobject.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='m_init' type-id='type-id-127' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/moduleobject.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='m_index' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/moduleobject.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='m_copy' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/moduleobject.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyModuleDef_Slot' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/moduleobject.h' line='61' column='1' id='type-id-125'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='slot' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/moduleobject.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value' type-id='type-id-79' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/moduleobject.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-127'/>
    <function-type size-in-bits='64' id='type-id-128'>
      <return type-id='type-id-1'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/bufferedio.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyBufferedIOBase_Type' type-id='type-id-6' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='10' column='1'/>
    <var-decl name='PyBufferedReader_Type' type-id='type-id-6' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='17' column='1'/>
    <var-decl name='PyBufferedWriter_Type' type-id='type-id-6' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='18' column='1'/>
    <var-decl name='PyBufferedRWPair_Type' type-id='type-id-6' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='19' column='1'/>
    <var-decl name='PyBufferedRandom_Type' type-id='type-id-6' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='20' column='1'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/bytesio.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyBytesIO_Type' type-id='type-id-6' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='15' column='1'/>
    <var-decl name='_PyBytesIOBuffer_Type' type-id='type-id-6' mangled-name='_PyBytesIOBuffer_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='188' column='1' elf-symbol-id='_PyBytesIOBuffer_Type'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/fileio.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyFileIO_Type' type-id='type-id-6' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='14' column='1'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/iobase.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyIOBase_Type' type-id='type-id-6' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='8' column='1'/>
    <var-decl name='PyRawIOBase_Type' type-id='type-id-6' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='9' column='1'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/stringio.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyStringIO_Type' type-id='type-id-6' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='16' column='1'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/textio.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyTextIOBase_Type' type-id='type-id-6' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='11' column='1'/>
    <var-decl name='PyIncrementalNewlineDecoder_Type' type-id='type-id-6' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='22' column='1'/>
    <var-decl name='PyTextIOWrapper_Type' type-id='type-id-6' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_io/_iomodule.h' line='21' column='1'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_localemodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__locale' mangled-name='PyInit__locale' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_localemodule.c' line='823' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__locale'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_operator.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__operator' mangled-name='PyInit__operator' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_operator.c' line='1789' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__operator'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_peg_parser.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__peg_parser' mangled-name='PyInit__peg_parser' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_peg_parser.c' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__peg_parser'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_sre.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__sre' mangled-name='PyInit__sre' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_sre.c' line='2771' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__sre'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_stat.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__stat' mangled-name='PyInit__stat' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_stat.c' line='630' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__stat'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_threadmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__thread' mangled-name='PyInit__thread' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_threadmodule.c' line='1559' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__thread'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_tracemalloc.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='_PyTraceMalloc_GetTraceback' mangled-name='_PyTraceMalloc_GetTraceback' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_tracemalloc.c' line='1812' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyTraceMalloc_GetTraceback'>
      <parameter type-id='type-id-41' name='domain' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_tracemalloc.c' line='1812' column='1'/>
      <parameter type-id='type-id-129' name='ptr' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_tracemalloc.c' line='1812' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyTraceMalloc_NewReference' mangled-name='_PyTraceMalloc_NewReference' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_tracemalloc.c' line='1774' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyTraceMalloc_NewReference'>
      <parameter type-id='type-id-1' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_tracemalloc.c' line='1774' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyTraceMalloc_Untrack' mangled-name='PyTraceMalloc_Untrack' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_tracemalloc.c' line='1753' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyTraceMalloc_Untrack'>
      <parameter type-id='type-id-41' name='domain' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_tracemalloc.c' line='1753' column='1'/>
      <parameter type-id='type-id-129' name='ptr' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_tracemalloc.c' line='1753' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyTraceMalloc_Track' mangled-name='PyTraceMalloc_Track' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_tracemalloc.c' line='1730' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyTraceMalloc_Track'>
      <parameter type-id='type-id-41' name='domain' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_tracemalloc.c' line='1730' column='1'/>
      <parameter type-id='type-id-129' name='ptr' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_tracemalloc.c' line='1730' column='1'/>
      <parameter type-id='type-id-130' name='size' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_tracemalloc.c' line='1731' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyInit__tracemalloc' mangled-name='PyInit__tracemalloc' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_tracemalloc.c' line='1695' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__tracemalloc'>
      <return type-id='type-id-1'/>
    </function-decl>
    <typedef-decl name='size_t' type-id='type-id-25' filepath='/usr/lib/gcc/x86_64-linux-gnu/7/include/stddef.h' line='216' column='1' id='type-id-130'/>
    <typedef-decl name='uintptr_t' type-id='type-id-25' filepath='/usr/include/stdint.h' line='100' column='1' id='type-id-129'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_weakref.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__weakref' mangled-name='PyInit__weakref' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/_weakref.c' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__weakref'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/atexitmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit_atexit' mangled-name='PyInit_atexit' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/atexitmodule.c' line='352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_atexit'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/errnomodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit_errno' mangled-name='PyInit_errno' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/errnomodule.c' line='957' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_errno'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/faulthandler.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit_faulthandler' mangled-name='PyInit_faulthandler' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/faulthandler.c' line='1307' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_faulthandler'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <typedef-decl name='GCState' type-id='type-id-131' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='36' column='1' id='type-id-132'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-133'/>
    <function-decl name='PyObject_GC_IsFinalized' mangled-name='PyObject_GC_IsFinalized' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2330' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_IsFinalized'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2330' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyObject_GC_IsTracked' mangled-name='PyObject_GC_IsTracked' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2321' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_IsTracked'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2321' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyObject_GC_Del' mangled-name='PyObject_GC_Del' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2306' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_Del'>
      <parameter type-id='type-id-79' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2306' column='1'/>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='_PyObject_GC_Resize' mangled-name='_PyObject_GC_Resize' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_Resize'>
      <parameter type-id='type-id-134' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2288' column='1'/>
      <parameter type-id='type-id-4' name='nitems' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2288' column='1'/>
      <return type-id='type-id-134'/>
    </function-decl>
    <function-decl name='_PyObject_GC_NewVar' mangled-name='_PyObject_GC_NewVar' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_NewVar'>
      <parameter type-id='type-id-5' name='tp' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2271' column='1'/>
      <parameter type-id='type-id-4' name='nitems' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2271' column='1'/>
      <return type-id='type-id-134'/>
    </function-decl>
    <function-decl name='_PyObject_GC_New' mangled-name='_PyObject_GC_New' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2262' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_New'>
      <parameter type-id='type-id-5' name='tp' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2262' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyObject_GC_Calloc' mangled-name='_PyObject_GC_Calloc' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2256' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_Calloc'>
      <parameter type-id='type-id-130' name='basicsize' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2256' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyObject_GC_Malloc' mangled-name='_PyObject_GC_Malloc' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_Malloc'>
      <parameter type-id='type-id-130' name='basicsize' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2250' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyObject_IS_GC' mangled-name='PyObject_IS_GC' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2205' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_IS_GC'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2205' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyObject_GC_UnTrack' mangled-name='PyObject_GC_UnTrack' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2193' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_UnTrack'>
      <parameter type-id='type-id-79' name='op_raw' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2193' column='1'/>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='PyObject_GC_Track' mangled-name='PyObject_GC_Track' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_Track'>
      <parameter type-id='type-id-79' name='op_raw' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2174' column='1'/>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='_PyGC_CollectNoFail' mangled-name='_PyGC_CollectNoFail' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2078' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyGC_CollectNoFail'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyGC_CollectIfEnabled' mangled-name='_PyGC_CollectIfEnabled' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2072' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyGC_CollectIfEnabled'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyGC_Collect' mangled-name='PyGC_Collect' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2045' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyGC_Collect'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyInit_gc' mangled-name='PyInit_gc' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='2000' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_gc'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyGC_InitState' mangled-name='_PyGC_InitState' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyGC_InitState'>
      <parameter type-id='type-id-133' name='gcstate' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/gcmodule.c' line='132' column='1'/>
      <return type-id='type-id-106'/>
    </function-decl>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-134'/>
    <class-decl name='_gc_runtime_state' size-in-bits='1920' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gc.h' line='130' column='1' id='type-id-131'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='trash_delete_later' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gc.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='trash_delete_nesting' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gc.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='enabled' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gc.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='debug' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gc.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='generations' type-id='type-id-135' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gc.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='generation0' type-id='type-id-136' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gc.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='permanent_generation' type-id='type-id-137' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gc.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='generation_stats' type-id='type-id-138' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gc.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='collecting' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gc.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='garbage' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gc.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='callbacks' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gc.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='long_lived_total' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gc.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='long_lived_pending' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gc.h' line='161' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-136'/>
    <class-decl name='gc_generation' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gc.h' line='113' column='1' id='type-id-137'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-139' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gc.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='threshold' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gc.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='count' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gc.h' line='116' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-137' size-in-bits='576' id='type-id-135'>
      <subrange length='3' type-id='type-id-25' id='type-id-140'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-141' size-in-bits='576' id='type-id-138'>
      <subrange length='3' type-id='type-id-25' id='type-id-140'/>
    </array-type-def>
    <class-decl name='gc_generation_stats' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gc.h' line='121' column='1' id='type-id-141'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='collections' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gc.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='collected' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gc.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uncollectable' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gc.h' line='127' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyGC_Head' type-id='type-id-142' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gc.h' line='20' column='1' id='type-id-139'/>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-139' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gc.h' line='12' column='1' id='type-id-142'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_gc_next' type-id='type-id-129' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gc.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_gc_prev' type-id='type-id-129' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gc.h' line='19' column='1'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/getbuildinfo.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='type-id-82'/>
    <type-decl name='void' id='type-id-106'/>
    <qualified-type-def type-id='type-id-82' const='yes' id='type-id-52'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-11'/>
    <function-decl name='Py_GetBuildInfo' mangled-name='Py_GetBuildInfo' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/getbuildinfo.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetBuildInfo'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_Py_gitidentifier' mangled-name='_Py_gitidentifier' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/getbuildinfo.c' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_gitidentifier'>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/itertoolsmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit_itertools' mangled-name='PyInit_itertools' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/itertoolsmodule.c' line='4741' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_itertools'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/main.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='Py_BytesMain' mangled-name='Py_BytesMain' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/main.c' line='724' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_BytesMain'>
      <parameter type-id='type-id-80' name='argc' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/main.c' line='724' column='1'/>
      <parameter type-id='type-id-143' name='argv' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/main.c' line='724' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='Py_Main' mangled-name='Py_Main' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/main.c' line='712' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_Main'>
      <parameter type-id='type-id-80' name='argc' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/main.c' line='712' column='1'/>
      <parameter type-id='type-id-144' name='argv' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/main.c' line='712' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='Py_RunMain' mangled-name='Py_RunMain' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/main.c' line='673' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_RunMain'>
      <return type-id='type-id-80'/>
    </function-decl>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-143'/>
    <pointer-type-def type-id='type-id-146' size-in-bits='64' id='type-id-144'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-145'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-146'/>
    <typedef-decl name='wchar_t' type-id='type-id-80' filepath='/usr/lib/gcc/x86_64-linux-gnu/7/include/stddef.h' line='328' column='1' id='type-id-147'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/posixmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <typedef-decl name='uid_t' type-id='type-id-148' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='80' column='1' id='type-id-149'/>
    <typedef-decl name='gid_t' type-id='type-id-150' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='65' column='1' id='type-id-151'/>
    <function-decl name='PyInit_posix' mangled-name='PyInit_posix' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/posixmodule.c' line='15040' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_posix'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_Gid_Converter' mangled-name='_Py_Gid_Converter' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/posixmodule.c' line='632' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_Gid_Converter'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/posixmodule.c' line='632' column='1'/>
      <parameter type-id='type-id-79' name='p' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/posixmodule.c' line='632' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='_Py_Uid_Converter' mangled-name='_Py_Uid_Converter' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/posixmodule.c' line='526' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_Uid_Converter'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/posixmodule.c' line='526' column='1'/>
      <parameter type-id='type-id-79' name='p' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/posixmodule.c' line='526' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyOS_AfterFork' mangled-name='PyOS_AfterFork' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/posixmodule.c' line='492' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_AfterFork'>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='PyOS_AfterFork_Child' mangled-name='PyOS_AfterFork_Child' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/posixmodule.c' line='462' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_AfterFork_Child'>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='PyOS_BeforeFork' mangled-name='PyOS_BeforeFork' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/posixmodule.c' line='445' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_BeforeFork'>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='PyOS_AfterFork_Parent' mangled-name='PyOS_AfterFork_Parent' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/posixmodule.c' line='453' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_AfterFork_Parent'>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='_PyLong_FromUid' mangled-name='_PyLong_FromUid' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/posixmodule.c' line='510' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyLong_FromUid'>
      <parameter type-id='type-id-149' name='uid' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/posixmodule.c' line='510' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyLong_FromGid' mangled-name='_PyLong_FromGid' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/posixmodule.c' line='518' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyLong_FromGid'>
      <parameter type-id='type-id-151' name='gid' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/posixmodule.c' line='518' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_Sigset_Converter' mangled-name='_Py_Sigset_Converter' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/posixmodule.c' line='1313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_Sigset_Converter'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/posixmodule.c' line='1313' column='1'/>
      <parameter type-id='type-id-79' name='addr' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/posixmodule.c' line='1313' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyOS_FSPath' mangled-name='PyOS_FSPath' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/posixmodule.c' line='13662' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_FSPath'>
      <parameter type-id='type-id-1' name='path' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/posixmodule.c' line='13662' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <typedef-decl name='__gid_t' type-id='type-id-41' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='135' column='1' id='type-id-150'/>
    <typedef-decl name='__uid_t' type-id='type-id-41' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='134' column='1' id='type-id-148'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/pwdmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit_pwd' mangled-name='PyInit_pwd' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/pwdmodule.c' line='352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_pwd'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/signalmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='_PyOS_IsMainThread' mangled-name='_PyOS_IsMainThread' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/signalmodule.c' line='1832' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyOS_IsMainThread'>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='_PySignal_AfterFork' mangled-name='_PySignal_AfterFork' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/signalmodule.c' line='1823' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySignal_AfterFork'>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='PyOS_InterruptOccurred' mangled-name='PyOS_InterruptOccurred' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/signalmodule.c' line='1803' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_InterruptOccurred'>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyOS_InitInterrupts' mangled-name='PyOS_InitInterrupts' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/signalmodule.c' line='1768' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_InitInterrupts'>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='PyErr_SetInterrupt' mangled-name='PyErr_SetInterrupt' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/signalmodule.c' line='1759' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_SetInterrupt'>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='_PyErr_CheckSignals' mangled-name='_PyErr_CheckSignals' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/signalmodule.c' line='1746' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyErr_CheckSignals'>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyErr_CheckSignals' mangled-name='PyErr_CheckSignals' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/signalmodule.c' line='1676' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_CheckSignals'>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyInit__signal' mangled-name='PyInit__signal' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/signalmodule.c' line='1374' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__signal'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyErr_CheckSignalsTstate' mangled-name='_PyErr_CheckSignalsTstate' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/signalmodule.c' line='1689' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyErr_CheckSignalsTstate'>
      <parameter type-id='type-id-152' name='tstate' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/signalmodule.c' line='1689' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='_PyOS_InterruptOccurred' mangled-name='_PyOS_InterruptOccurred' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/signalmodule.c' line='1785' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyOS_InterruptOccurred'>
      <parameter type-id='type-id-152' name='tstate' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/signalmodule.c' line='1785' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-152'/>
    <typedef-decl name='PyThreadState' type-id='type-id-154' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/pystate.h' line='20' column='1' id='type-id-153'/>
    <class-decl name='_ts' size-in-bits='2112' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='51' column='1' id='type-id-154'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prev' type-id='type-id-155' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-155' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='interp' type-id='type-id-156' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='frame' type-id='type-id-157' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='recursion_depth' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='overflowed' type-id='type-id-82' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='296'>
        <var-decl name='recursion_critical' type-id='type-id-82' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='stackcheck_counter' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='tracing' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='use_tracing' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='c_profilefunc' type-id='type-id-158' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='c_tracefunc' type-id='type-id-158' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='c_profileobj' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='c_traceobj' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='curexc_type' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='curexc_value' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='curexc_traceback' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='exc_state' type-id='type-id-159' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='exc_info' type-id='type-id-160' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='dict' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='gilstate_counter' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='async_exc' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='thread_id' type-id='type-id-25' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='trash_delete_nesting' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='trash_delete_later' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='on_delete' type-id='type-id-58' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='on_delete_data' type-id='type-id-79' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='coroutine_origin_tracking_depth' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='async_gen_firstiter' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='async_gen_finalizer' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='context' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='context_ver' type-id='type-id-161' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='id' type-id='type-id-161' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='137' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-157'/>
    <pointer-type-def type-id='type-id-163' size-in-bits='64' id='type-id-156'/>
    <pointer-type-def type-id='type-id-159' size-in-bits='64' id='type-id-160'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-155'/>
    <typedef-decl name='Py_tracefunc' type-id='type-id-164' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='19' column='1' id='type-id-158'/>
    <typedef-decl name='_PyErr_StackItem' type-id='type-id-165' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='47' column='1' id='type-id-159'/>
    <typedef-decl name='uint64_t' type-id='type-id-166' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='27' column='1' id='type-id-161'/>
    <class-decl name='_err_stackitem' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='36' column='1' id='type-id-165'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='exc_type' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='exc_value' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='exc_traceback' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='previous_item' type-id='type-id-167' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-164'/>
    <typedef-decl name='PyFrameObject' type-id='type-id-169' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/pyframe.h' line='12' column='1' id='type-id-162'/>
    <typedef-decl name='PyInterpreterState' type-id='type-id-170' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/pystate.h' line='22' column='1' id='type-id-163'/>
    <typedef-decl name='__uint64_t' type-id='type-id-25' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='44' column='1' id='type-id-166'/>
    <pointer-type-def type-id='type-id-165' size-in-bits='64' id='type-id-167'/>
    <class-decl name='_frame' size-in-bits='2944' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/frameobject.h' line='17' column='1' id='type-id-169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-10' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/frameobject.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='f_back' type-id='type-id-171' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/frameobject.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='f_code' type-id='type-id-172' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/frameobject.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='f_builtins' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/frameobject.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='f_globals' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/frameobject.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='f_locals' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/frameobject.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='f_valuestack' type-id='type-id-173' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/frameobject.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='f_stacktop' type-id='type-id-173' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/frameobject.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='f_trace' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/frameobject.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='f_trace_lines' type-id='type-id-82' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/frameobject.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='712'>
        <var-decl name='f_trace_opcodes' type-id='type-id-82' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/frameobject.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='f_gen' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/frameobject.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='f_lasti' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/frameobject.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='f_lineno' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/frameobject.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='f_iblock' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/frameobject.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='f_executing' type-id='type-id-82' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/frameobject.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='f_blockstack' type-id='type-id-174' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/frameobject.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='f_localsplus' type-id='type-id-175' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/frameobject.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_is' size-in-bits='45184' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='71' column='1' id='type-id-170'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-176' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tstate_head' type-id='type-id-155' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='runtime' type-id='type-id-177' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='id' type-id='type-id-178' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='id_refcount' type-id='type-id-178' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='requires_idref' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='id_mutex' type-id='type-id-179' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='finalizing' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ceval' type-id='type-id-180' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='gc' type-id='type-id-131' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6848'>
        <var-decl name='modules' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6912'>
        <var-decl name='modules_by_index' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6976'>
        <var-decl name='sysdict' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7040'>
        <var-decl name='builtins' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7104'>
        <var-decl name='importlib' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7168'>
        <var-decl name='num_threads' type-id='type-id-43' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7232'>
        <var-decl name='pythread_stacksize' type-id='type-id-130' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7296'>
        <var-decl name='codec_search_path' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7360'>
        <var-decl name='codec_search_cache' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7424'>
        <var-decl name='codec_error_registry' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7488'>
        <var-decl name='codecs_initialized' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7552'>
        <var-decl name='unicode' type-id='type-id-181' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7808'>
        <var-decl name='config' type-id='type-id-182' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10944'>
        <var-decl name='dlopenflags' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11008'>
        <var-decl name='dict' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11072'>
        <var-decl name='builtins_copy' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11136'>
        <var-decl name='import_func' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11200'>
        <var-decl name='eval_frame' type-id='type-id-183' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11264'>
        <var-decl name='co_extra_user_count' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11328'>
        <var-decl name='co_extra_freefuncs' type-id='type-id-184' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27648'>
        <var-decl name='before_forkers' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27712'>
        <var-decl name='after_forkers_parent' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27776'>
        <var-decl name='after_forkers_child' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27840'>
        <var-decl name='pyexitfunc' type-id='type-id-57' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27904'>
        <var-decl name='pyexitmodule' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27968'>
        <var-decl name='tstate_next_unique_id' type-id='type-id-161' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28032'>
        <var-decl name='warnings' type-id='type-id-185' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28288'>
        <var-decl name='audit_hooks' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28352'>
        <var-decl name='parser' type-id='type-id-186' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28416'>
        <var-decl name='small_ints' type-id='type-id-187' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='155' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-188' size-in-bits='64' id='type-id-172'/>
    <array-type-def dimensions='1' type-id='type-id-189' size-in-bits='16768' id='type-id-187'>
      <subrange length='262' type-id='type-id-25' id='type-id-190'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-173'/>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='64' id='type-id-175'>
      <subrange length='1' type-id='type-id-25' id='type-id-191'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-192' size-in-bits='1920' id='type-id-174'>
      <subrange length='20' type-id='type-id-25' id='type-id-193'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-171'/>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-176'/>
    <class-decl name='_Py_unicode_state' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='60' column='1' id='type-id-181'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fs_codec' type-id='type-id-194' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_ceval_state' size-in-bits='4416' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='35' column='1' id='type-id-180'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='recursion_limit' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tracing_possible' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='eval_breaker' type-id='type-id-195' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='gil_drop_request' type-id='type-id-195' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pending' type-id='type-id-196' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_warnings_runtime_state' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_warnings.h' line='11' column='1' id='type-id-185'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='filters' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_warnings.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='once_registry' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_warnings.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='default_action' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_warnings.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='filters_version' type-id='type-id-43' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_warnings.h' line='17' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='142' column='1' id='type-id-186'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='listnode' type-id='type-id-197' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='146' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-40' size-in-bits='16320' id='type-id-184'>
      <subrange length='255' type-id='type-id-25' id='type-id-198'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' id='type-id-177'/>
    <typedef-decl name='PyConfig' type-id='type-id-200' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='425' column='1' id='type-id-182'/>
    <typedef-decl name='PyThread_type_lock' type-id='type-id-79' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/pythread.h' line='5' column='1' id='type-id-179'/>
    <typedef-decl name='_PyFrameEvalFunction' type-id='type-id-201' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='187' column='1' id='type-id-183'/>
    <typedef-decl name='int64_t' type-id='type-id-202' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='27' column='1' id='type-id-178'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-189'/>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-201'/>
    <class-decl name='_Py_unicode_fs_codec' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='53' column='1' id='type-id-194'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='encoding' type-id='type-id-145' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='utf8' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='errors' type-id='type-id-145' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='error_handler' type-id='type-id-205' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_pending_calls' size-in-bits='4288' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='18' column='1' id='type-id-196'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lock' type-id='type-id-179' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='calls_to_do' type-id='type-id-195' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='async_exc' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='calls' type-id='type-id-206' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='first' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4256'>
        <var-decl name='last' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='pyruntimestate' size-in-bits='5248' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='52' column='1' id='type-id-199'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='preinitializing' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='preinitialized' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='core_initialized' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='initialized' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_finalizing' type-id='type-id-207' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='interpreters' type-id='type-id-208' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='xidregistry' type-id='type-id-209' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='main_thread' type-id='type-id-25' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='exitfuncs' type-id='type-id-210' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='nexitfuncs' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='ceval' type-id='type-id-211' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='gilstate' type-id='type-id-212' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='preconfig' type-id='type-id-213' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='open_code_hook' type-id='type-id-214' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='open_code_userdata' type-id='type-id-79' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='audit_hook_head' type-id='type-id-215' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='105' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='3136' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-182' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='133' column='1' id='type-id-200'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_config_init' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='isolated' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='use_environment' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dev_mode' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='install_signal_handlers' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='use_hash_seed' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='hash_seed' type-id='type-id-25' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='faulthandler' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='_use_peg_parser' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tracemalloc' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='import_time' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='show_ref_count' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='dump_refs' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='malloc_stats' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='filesystem_encoding' type-id='type-id-146' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='filesystem_errors' type-id='type-id-146' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='pycache_prefix' type-id='type-id-146' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='parse_argv' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='argv' type-id='type-id-216' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='program_name' type-id='type-id-146' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='xoptions' type-id='type-id-216' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='warnoptions' type-id='type-id-216' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='site_import' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='bytes_warning' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='inspect' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='interactive' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='optimization_level' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='parser_debug' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='write_bytecode' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='verbose' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='quiet' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='user_site_directory' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='configure_c_stdio' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='buffered_stdio' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='stdio_encoding' type-id='type-id-146' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='stdio_errors' type-id='type-id-146' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='338' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='check_hash_pycs_mode' type-id='type-id-146' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='pathconfig_warnings' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='pythonpath_env' type-id='type-id-146' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='374' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='home' type-id='type-id-146' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='375' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='module_search_paths_set' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='module_search_paths' type-id='type-id-216' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='381' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='executable' type-id='type-id-146' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='385' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='base_executable' type-id='type-id-146' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='prefix' type-id='type-id-146' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='387' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='base_prefix' type-id='type-id-146' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='388' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='exec_prefix' type-id='type-id-146' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='base_exec_prefix' type-id='type-id-146' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='platlibdir' type-id='type-id-146' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='skip_source_first_line' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='run_command' type-id='type-id-146' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='run_module' type-id='type-id-146' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='run_filename' type-id='type-id-146' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='_install_importlib' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2912'>
        <var-decl name='_init_main' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='_isolated_interpreter' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='_orig_argv' type-id='type-id-216' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='424' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='143' column='1' id='type-id-197'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='level' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='atbol' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='145' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyCodeObject' type-id='type-id-217' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/code.h' line='9' column='1' id='type-id-188'/>
    <typedef-decl name='PyTryBlock' type-id='type-id-218' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/frameobject.h' line='15' column='1' id='type-id-192'/>
    <typedef-decl name='_Py_atomic_int' type-id='type-id-219' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_atomic.h' line='51' column='1' id='type-id-195'/>
    <typedef-decl name='__int64_t' type-id='type-id-43' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='43' column='1' id='type-id-202'/>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-215'/>
    <array-type-def dimensions='1' type-id='type-id-221' size-in-bits='4096' id='type-id-206'>
      <subrange length='32' type-id='type-id-25' id='type-id-222'/>
    </array-type-def>
    <class-decl name='PyCodeObject' size-in-bits='1408' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/code.h' line='18' column='1' id='type-id-217'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-2' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/code.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='co_argcount' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/code.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='co_posonlyargcount' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/code.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='co_kwonlyargcount' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/code.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='co_nlocals' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/code.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='co_stacksize' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/code.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='co_flags' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/code.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='co_firstlineno' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/code.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='co_code' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/code.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='co_consts' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/code.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='co_names' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/code.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='co_varnames' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/code.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='co_freevars' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/code.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='co_cellvars' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/code.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='co_cell2arg' type-id='type-id-223' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/code.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='co_filename' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/code.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='co_name' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/code.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='co_lnotab' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/code.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='co_zombieframe' type-id='type-id-79' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/code.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='co_weakreflist' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/code.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='co_extra' type-id='type-id-79' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/code.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='co_opcache_map' type-id='type-id-224' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/code.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='co_opcache' type-id='type-id-225' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/code.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='co_opcache_flag' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/code.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='co_opcache_size' type-id='type-id-226' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/code.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_Py_atomic_int' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_atomic.h' line='49' column='1' id='type-id-219'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_value' type-id='type-id-227' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_atomic.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_ceval_runtime_state' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='16' column='1' id='type-id-211'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='signals_pending' type-id='type-id-195' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='gil' type-id='type-id-228' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='22' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_gilstate_runtime_state' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='27' column='1' id='type-id-212'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='check_enabled' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tstate_current' type-id='type-id-207' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='autoInterpreterState' type-id='type-id-156' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='autoTSSkey' type-id='type-id-229' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_xidregistry' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='87' column='1' id='type-id-209'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mutex' type-id='type-id-179' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='head' type-id='type-id-230' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='89' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='pyinterpreters' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='72' column='1' id='type-id-208'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mutex' type-id='type-id-179' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='head' type-id='type-id-156' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='main' type-id='type-id-156' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='next_id' type-id='type-id-178' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='84' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='96' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-192' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/frameobject.h' line='11' column='1' id='type-id-218'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='b_type' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/frameobject.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='b_handler' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/frameobject.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='b_level' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/frameobject.h' line='14' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyLongObject' type-id='type-id-231' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/longobject.h' line='10' column='1' id='type-id-203'/>
    <typedef-decl name='PyPreConfig' type-id='type-id-232' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='125' column='1' id='type-id-213'/>
    <typedef-decl name='PyWideStringList' type-id='type-id-233' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='36' column='1' id='type-id-216'/>
    <typedef-decl name='Py_OpenCodeHookFunction' type-id='type-id-104' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/fileobject.h' line='24' column='1' id='type-id-214'/>
    <typedef-decl name='_Py_atomic_address' type-id='type-id-234' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_atomic.h' line='47' column='1' id='type-id-207'/>
    <typedef-decl name='_Py_error_handler' type-id='type-id-235' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/fileutils.h' line='15' column='1' id='type-id-205'/>
    <array-type-def dimensions='1' type-id='type-id-236' size-in-bits='2048' id='type-id-210'>
      <subrange length='32' type-id='type-id-25' id='type-id-222'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-223'/>
    <pointer-type-def type-id='type-id-237' size-in-bits='64' id='type-id-225'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-230'/>
    <type-decl name='atomic_int' size-in-bits='32' id='type-id-227'/>
    <class-decl name='_Py_AuditHookEntry' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='44' column='1' id='type-id-220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-215' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hookCFunction' type-id='type-id-239' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='userData' type-id='type-id-79' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_runtime.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_Py_atomic_address' size-in-bits='64' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_atomic.h' line='45' column='1' id='type-id-234'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_value' type-id='type-id-240' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_atomic.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_gil_runtime_state' size-in-bits='1664' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gil.h' line='23' column='1' id='type-id-228'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='interval' type-id='type-id-25' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gil.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='last_holder' type-id='type-id-207' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gil.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='locked' type-id='type-id-195' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gil.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='switch_number' type-id='type-id-25' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gil.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cond' type-id='type-id-241' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gil.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='mutex' type-id='type-id-242' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gil.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='switch_cond' type-id='type-id-241' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gil.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='switch_mutex' type-id='type-id-242' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_gil.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_longobject' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/longintrepr.h' line='85' column='1' id='type-id-231'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-10' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/longintrepr.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ob_digit' type-id='type-id-243' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/longintrepr.h' line='87' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-216' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='31' column='1' id='type-id-233'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='items' type-id='type-id-144' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='35' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='27' column='1' id='type-id-221'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='func' type-id='type-id-244' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-79' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='320' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-213' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='47' column='1' id='type-id-232'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_config_init' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='parse_argv' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='isolated' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='use_environment' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='configure_locale' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='coerce_c_locale' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='coerce_c_locale_warn' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='utf8_mode' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dev_mode' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='allocator' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/initconfig.h' line='124' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/fileutils.h' line='5' column='1' id='type-id-235'>
      <underlying-type type-id='type-id-245'/>
      <enumerator name='_Py_ERROR_UNKNOWN' value='0'/>
      <enumerator name='_Py_ERROR_STRICT' value='1'/>
      <enumerator name='_Py_ERROR_SURROGATEESCAPE' value='2'/>
      <enumerator name='_Py_ERROR_REPLACE' value='3'/>
      <enumerator name='_Py_ERROR_IGNORE' value='4'/>
      <enumerator name='_Py_ERROR_BACKSLASHREPLACE' value='5'/>
      <enumerator name='_Py_ERROR_SURROGATEPASS' value='6'/>
      <enumerator name='_Py_ERROR_XMLCHARREFREPLACE' value='7'/>
      <enumerator name='_Py_ERROR_OTHER' value='8'/>
    </enum-decl>
    <typedef-decl name='Py_tss_t' type-id='type-id-246' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/pythread.h' line='123' column='1' id='type-id-229'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-226'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' id='type-id-224'/>
    <pointer-type-def type-id='type-id-247' size-in-bits='64' id='type-id-236'/>
    <type-decl name='atomic_uintptr_t' size-in-bits='64' id='type-id-240'/>
    <class-decl name='_Py_tss_t' size-in-bits='64' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/pythread.h' line='143' column='1' id='type-id-246'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_is_initialized' type-id='type-id-80' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/pythread.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='_key' type-id='type-id-248' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/pythread.h' line='145' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_xidregitem' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='176' column='1' id='type-id-238'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cls' type-id='type-id-5' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='getdata' type-id='type-id-249' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='next' type-id='type-id-230' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_interp.h' line='179' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-250' size-in-bits='32' id='type-id-243'>
      <subrange length='1' type-id='type-id-25' id='type-id-191'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-251' size-in-bits='64' id='type-id-244'/>
    <typedef-decl name='Py_AuditHookFunction' type-id='type-id-252' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/sysmodule.h' line='14' column='1' id='type-id-239'/>
    <typedef-decl name='_PyOpcache' type-id='type-id-253' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/code.h' line='15' column='1' id='type-id-237'/>
    <typedef-decl name='pthread_cond_t' type-id='type-id-254' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='80' column='1' id='type-id-241'/>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-255' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='72' column='1' id='type-id-242'/>
    <class-decl name='_PyOpcache' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_code.h' line='13' column='1' id='type-id-253'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='u' type-id='type-id-256' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_code.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='optimized' type-id='type-id-82' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_code.h' line='17' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-257' size-in-bits='64' id='type-id-252'/>
    <typedef-decl name='crossinterpdatafunc' type-id='type-id-258' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/cpython/pystate.h' line='256' column='1' id='type-id-249'/>
    <typedef-decl name='digit' type-id='type-id-259' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/longintrepr.h' line='45' column='1' id='type-id-250'/>
    <typedef-decl name='pthread_key_t' type-id='type-id-41' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='49' column='1' id='type-id-248'/>
    <union-decl name='__anonymous_union__' size-in-bits='384' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='75' column='1' id='type-id-254'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-260' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='77' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-261' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='78' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-262' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='79' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__3' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='67' column='1' id='type-id-255'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-263' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-264' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-43' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <array-type-def dimensions='1' type-id='type-id-82' size-in-bits='320' id='type-id-264'>
      <subrange length='40' type-id='type-id-25' id='type-id-265'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-82' size-in-bits='384' id='type-id-261'>
      <subrange length='48' type-id='type-id-25' id='type-id-266'/>
    </array-type-def>
    <class-decl name='__pthread_cond_s' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='171' column='1' id='type-id-260'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-267' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='type-id-268' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__g_refs' type-id='type-id-269' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__g_size' type-id='type-id-269' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='__g1_orig_size' type-id='type-id-41' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__wrefs' type-id='type-id-41' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='__g_signals' type-id='type-id-269' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='195' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='118' column='1' id='type-id-263'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-80' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-41' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-80' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-41' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-80' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-270' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-270' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-271' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='155' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-272' size-in-bits='64' id='type-id-258'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-262'/>
    <typedef-decl name='uint32_t' type-id='type-id-273' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-259'/>
    <union-decl name='__anonymous_union__' size-in-bits='192' is-anonymous='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_code.h' line='14' column='1' id='type-id-256'>
      <data-member access='private'>
        <var-decl name='lg' type-id='type-id-274' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_code.h' line='15' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-270'/>
    <typedef-decl name='_PyOpcache_LoadGlobal' type-id='type-id-275' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_code.h' line='11' column='1' id='type-id-274'/>
    <typedef-decl name='__pthread_list_t' type-id='type-id-276' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='86' column='1' id='type-id-271'/>
    <typedef-decl name='__uint32_t' type-id='type-id-41' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='41' column='1' id='type-id-273'/>
    <union-decl name='__anonymous_union__2' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='182' column='1' id='type-id-268'>
      <data-member access='private'>
        <var-decl name='__g1_start' type-id='type-id-277' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='184' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__g1_start32' type-id='type-id-278' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='189' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='173' column='1' id='type-id-267'>
      <data-member access='private'>
        <var-decl name='__wseq' type-id='type-id-277' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='175' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__wseq32' type-id='type-id-278' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='180' column='1'/>
      </data-member>
    </union-decl>
    <array-type-def dimensions='1' type-id='type-id-41' size-in-bits='64' id='type-id-269'>
      <subrange length='2' type-id='type-id-25' id='type-id-279'/>
    </array-type-def>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='82' column='1' id='type-id-276'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-280' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-280' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='85' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-274' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_code.h' line='7' column='1' id='type-id-275'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ptr' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_code.h' line='8' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='globals_ver' type-id='type-id-161' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_code.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='builtins_ver' type-id='type-id-161' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Include/internal/pycore_code.h' line='10' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='185' column='1' id='type-id-278'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__low' type-id='type-id-41' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__high' type-id='type-id-41' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='188' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-277'/>
    <pointer-type-def type-id='type-id-276' size-in-bits='64' id='type-id-280'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/symtablemodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__symtable' mangled-name='PyInit__symtable' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/symtablemodule.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__symtable'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/timemodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit_time' mangled-name='PyInit_time' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/timemodule.c' line='1878' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_time'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/xxsubtype.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit_xxsubtype' mangled-name='PyInit_xxsubtype' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Modules/xxsubtype.c' line='311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_xxsubtype'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/spack-build' language='LANG_C99'>
    <qualified-type-def type-id='type-id-145' const='yes' id='type-id-281'/>
    <pointer-type-def type-id='type-id-281' size-in-bits='64' id='type-id-282'/>
    <qualified-type-def type-id='type-id-283' const='yes' id='type-id-284'/>
    <pointer-type-def type-id='type-id-284' size-in-bits='64' id='type-id-285'/>
    <qualified-type-def type-id='type-id-4' const='yes' id='type-id-286'/>
    <pointer-type-def type-id='type-id-286' size-in-bits='64' id='type-id-287'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-288'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-289'/>
    <function-decl name='_Py_FreeCharPArray' mangled-name='_Py_FreeCharPArray' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2773' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_FreeCharPArray'>
      <parameter type-id='type-id-282' name='array' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2773' column='1'/>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='_PySequence_BytesToCharpArray' mangled-name='_PySequence_BytesToCharpArray' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2714' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySequence_BytesToCharpArray'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2714' column='1'/>
      <return type-id='type-id-282'/>
    </function-decl>
    <function-decl name='PyIter_Check' mangled-name='PyIter_Check' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2679' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyIter_Check'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2679' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='_PyObject_RealIsSubclass' mangled-name='_PyObject_RealIsSubclass' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2645' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_RealIsSubclass'>
      <parameter type-id='type-id-1' name='derived' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2645' column='1'/>
      <parameter type-id='type-id-1' name='cls' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2645' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='_PyObject_RealIsInstance' mangled-name='_PyObject_RealIsInstance' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2639' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_RealIsInstance'>
      <parameter type-id='type-id-1' name='inst' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2639' column='1'/>
      <parameter type-id='type-id-1' name='cls' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2639' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyObject_IsSubclass' mangled-name='PyObject_IsSubclass' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2631' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_IsSubclass'>
      <parameter type-id='type-id-1' name='derived' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2631' column='1'/>
      <parameter type-id='type-id-1' name='cls' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2631' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyObject_IsInstance' mangled-name='PyObject_IsInstance' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2548' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_IsInstance'>
      <parameter type-id='type-id-1' name='inst' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2548' column='1'/>
      <parameter type-id='type-id-1' name='cls' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2548' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyMapping_Values' mangled-name='PyMapping_Values' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Values'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2333' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyMapping_Items' mangled-name='PyMapping_Items' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2319' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Items'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2319' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyMapping_Keys' mangled-name='PyMapping_Keys' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Keys'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2305' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyMapping_HasKey' mangled-name='PyMapping_HasKey' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2260' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_HasKey'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2260' column='1'/>
      <parameter type-id='type-id-1' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2260' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyMapping_HasKeyString' mangled-name='PyMapping_HasKeyString' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_HasKeyString'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2246' column='1'/>
      <parameter type-id='type-id-11' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2246' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyMapping_SetItemString' mangled-name='PyMapping_SetItemString' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_SetItemString'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2227' column='1'/>
      <parameter type-id='type-id-11' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2227' column='1'/>
      <parameter type-id='type-id-1' name='value' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2227' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyMapping_Length' mangled-name='PyMapping_Length' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Length'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2203' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyMapping_Check' mangled-name='PyMapping_Check' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2169' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Check'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2169' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PySequence_Index' mangled-name='PySequence_Index' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Index'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2161' column='1'/>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2161' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySequence_In' mangled-name='PySequence_In' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_In'>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2155' column='1'/>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2155' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PySequence_Count' mangled-name='PySequence_Count' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Count'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2133' column='1'/>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2133' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySequence_Fast' mangled-name='PySequence_Fast' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2015' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Fast'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2015' column='1'/>
      <parameter type-id='type-id-11' name='m' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='2015' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_Tuple' mangled-name='PySequence_Tuple' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1908' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Tuple'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1908' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_DelSlice' mangled-name='PySequence_DelSlice' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1884' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_DelSlice'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1884' column='1'/>
      <parameter type-id='type-id-4' name='i1' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1884' column='1'/>
      <parameter type-id='type-id-4' name='i2' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1884' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PySequence_SetSlice' mangled-name='PySequence_SetSlice' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1859' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_SetSlice'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1859' column='1'/>
      <parameter type-id='type-id-4' name='i1' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1859' column='1'/>
      <parameter type-id='type-id-4' name='i2' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1859' column='1'/>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1859' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PySequence_DelItem' mangled-name='PySequence_DelItem' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1826' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_DelItem'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1826' column='1'/>
      <parameter type-id='type-id-4' name='i' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1826' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PySequence_SetItem' mangled-name='PySequence_SetItem' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1793' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_SetItem'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1793' column='1'/>
      <parameter type-id='type-id-4' name='i' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1793' column='1'/>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1793' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PySequence_GetSlice' mangled-name='PySequence_GetSlice' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1770' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_GetSlice'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1770' column='1'/>
      <parameter type-id='type-id-4' name='i1' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1770' column='1'/>
      <parameter type-id='type-id-4' name='i2' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1770' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_GetItem' mangled-name='PySequence_GetItem' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1740' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_GetItem'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1740' column='1'/>
      <parameter type-id='type-id-4' name='i' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1740' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_InPlaceRepeat' mangled-name='PySequence_InPlaceRepeat' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1710' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_InPlaceRepeat'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1710' column='1'/>
      <parameter type-id='type-id-4' name='count' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1710' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_InPlaceConcat' mangled-name='PySequence_InPlaceConcat' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1685' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_InPlaceConcat'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1685' column='1'/>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1685' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_Repeat' mangled-name='PySequence_Repeat' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1655' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Repeat'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1655' column='1'/>
      <parameter type-id='type-id-4' name='count' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1655' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_Concat' mangled-name='PySequence_Concat' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1630' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Concat'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1630' column='1'/>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1630' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_Length' mangled-name='PySequence_Length' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1623' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Length'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1623' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySequence_Check' mangled-name='PySequence_Check' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1588' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Check'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1588' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyNumber_ToBase' mangled-name='PyNumber_ToBase' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1569' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_ToBase'>
      <parameter type-id='type-id-1' name='n' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1569' column='1'/>
      <parameter type-id='type-id-80' name='base' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1569' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Float' mangled-name='PyNumber_Float' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1510' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Float'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1510' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Long' mangled-name='PyNumber_Long' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Long'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1411' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_AsSsize_t' mangled-name='PyNumber_AsSsize_t' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1366' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_AsSsize_t'>
      <parameter type-id='type-id-1' name='item' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1366' column='1'/>
      <parameter type-id='type-id-1' name='err' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1366' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyNumber_Index' mangled-name='PyNumber_Index' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1324' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Index'>
      <parameter type-id='type-id-1' name='item' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1324' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyIndex_Check' mangled-name='PyIndex_Check' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyIndex_Check'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1313' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyNumber_Absolute' mangled-name='PyNumber_Absolute' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Absolute'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1296' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Invert' mangled-name='PyNumber_Invert' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Invert'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1280' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Positive' mangled-name='PyNumber_Positive' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Positive'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1264' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Negative' mangled-name='PyNumber_Negative' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1248' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Negative'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1248' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlacePower' mangled-name='PyNumber_InPlacePower' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlacePower'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1233' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1233' column='1'/>
      <parameter type-id='type-id-1' name='z' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1233' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceRemainder' mangled-name='PyNumber_InPlaceRemainder' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceRemainder'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1226' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1226' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceMatrixMultiply' mangled-name='PyNumber_InPlaceMatrixMultiply' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1219' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceMatrixMultiply'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1219' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1219' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceMultiply' mangled-name='PyNumber_InPlaceMultiply' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceMultiply'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1190' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1190' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceAdd' mangled-name='PyNumber_InPlaceAdd' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1169' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceAdd'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1169' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1169' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceTrueDivide' mangled-name='PyNumber_InPlaceTrueDivide' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1162' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceTrueDivide'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1162' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1162' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceFloorDivide' mangled-name='PyNumber_InPlaceFloorDivide' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceFloorDivide'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1155' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1155' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceSubtract' mangled-name='PyNumber_InPlaceSubtract' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceSubtract'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1151' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1151' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceRshift' mangled-name='PyNumber_InPlaceRshift' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceRshift'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1150' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1150' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceLshift' mangled-name='PyNumber_InPlaceLshift' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceLshift'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1149' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1149' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceAnd' mangled-name='PyNumber_InPlaceAnd' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceAnd'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1148' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1148' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceXor' mangled-name='PyNumber_InPlaceXor' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1147' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceXor'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1147' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1147' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceOr' mangled-name='PyNumber_InPlaceOr' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceOr'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1146' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1146' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Power' mangled-name='PyNumber_Power' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1090' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Power'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1090' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1090' column='1'/>
      <parameter type-id='type-id-1' name='z' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1090' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Remainder' mangled-name='PyNumber_Remainder' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1084' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Remainder'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1084' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1084' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_TrueDivide' mangled-name='PyNumber_TrueDivide' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1078' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_TrueDivide'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1078' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1078' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_FloorDivide' mangled-name='PyNumber_FloorDivide' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1072' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_FloorDivide'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1072' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1072' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_MatrixMultiply' mangled-name='PyNumber_MatrixMultiply' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1066' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_MatrixMultiply'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1066' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1066' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Multiply' mangled-name='PyNumber_Multiply' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1047' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Multiply'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1047' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1047' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Add' mangled-name='PyNumber_Add' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1016' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Add'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1016' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1016' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Divmod' mangled-name='PyNumber_Divmod' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1013' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Divmod'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1013' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1013' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Subtract' mangled-name='PyNumber_Subtract' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1012' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Subtract'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1012' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1012' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Rshift' mangled-name='PyNumber_Rshift' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1011' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Rshift'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1011' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1011' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Lshift' mangled-name='PyNumber_Lshift' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1010' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Lshift'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1010' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1010' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_And' mangled-name='PyNumber_And' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1009' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_And'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1009' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1009' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Xor' mangled-name='PyNumber_Xor' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1008' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Xor'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1008' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1008' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Or' mangled-name='PyNumber_Or' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1007' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Or'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1007' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='1007' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Check' mangled-name='PyNumber_Check' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='820' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Check'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='820' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyObject_Format' mangled-name='PyObject_Format' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='759' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Format'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='759' column='1'/>
      <parameter type-id='type-id-1' name='format_spec' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='759' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyBuffer_Release' mangled-name='PyBuffer_Release' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='745' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_Release'>
      <parameter type-id='type-id-290' name='view' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='745' column='1'/>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='PyBuffer_FillInfo' mangled-name='PyBuffer_FillInfo' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='706' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FillInfo'>
      <parameter type-id='type-id-290' name='view' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='706' column='1'/>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='706' column='1'/>
      <parameter type-id='type-id-79' name='buf' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='706' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='706' column='1'/>
      <parameter type-id='type-id-80' name='readonly' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='707' column='1'/>
      <parameter type-id='type-id-80' name='flags' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='707' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='PyBuffer_FillContiguousStrides' mangled-name='PyBuffer_FillContiguousStrides' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='682' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FillContiguousStrides'>
      <parameter type-id='type-id-80' name='nd' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='682' column='1'/>
      <parameter type-id='type-id-223' name='shape' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='682' column='1'/>
      <parameter type-id='type-id-223' name='strides' filepath='/tmp/root/spack-stage/spack-stage-python-3.9.0-yljhc72sqt6gg2hzwhjlu24ueapzcd4i/spack-src/Objects/abstract.c' line='683' column='1'/>
