<abi-corpus path='/opt/spack/opt/spack/linux-ubuntu18.04-x86_64/gcc-7.5.0/binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/lib/libopcodes.so' architecture='elf-amd-x86_64' soname='libopcodes-2.26.20160125.so'>
  <elf-needed>
    <dependency name='libintl.so.8'/>
    <dependency name='libbfd-2.26.20160125.so'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='aarch64_decode_insn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='aarch64_ext_addr_regoff' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='aarch64_ext_addr_simm' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='aarch64_ext_addr_simple' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='aarch64_ext_addr_uimm12' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='aarch64_ext_advsimd_imm_modified' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='xc16x_cgen_opval_conditioncode_names' size='56' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xc16x_cgen_opval_ext_names' size='56' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xc16x_cgen_opval_extconditioncode_names' size='56' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xc16x_cgen_opval_gr_names' size='56' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xc16x_cgen_opval_grb8_names' size='56' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xc16x_cgen_opval_grb_names' size='56' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xc16x_cgen_opval_memgr8_names' size='56' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xc16x_cgen_opval_psw_names' size='56' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xc16x_cgen_opval_r8_names' size='56' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xc16x_cgen_opval_reg0_name' size='56' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xc16x_cgen_opval_reg0_name1' size='56' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xc16x_cgen_opval_regbmem8_names' size='56' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xc16x_cgen_opval_regdiv8_names' size='56' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xc16x_cgen_opval_regmem8_names' size='56' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xc16x_cgen_parse_handlers' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xc16x_cgen_print_handlers' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xgate_num_opcodes' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xgate_opcodes' size='3800' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xre_max_failures' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xre_syntax_options' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xstormy16_cgen_extract_handlers' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xstormy16_cgen_hardware_attr_table' size='144' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xstormy16_cgen_hw_table' size='960' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xstormy16_cgen_ifield_attr_table' size='192' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xstormy16_cgen_ifld_table' size='2128' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xstormy16_cgen_insert_handlers' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xstormy16_cgen_insn_attr_table' size='288' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xstormy16_cgen_operand_attr_table' size='240' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xstormy16_cgen_operand_table' size='2560' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xstormy16_cgen_opval_gr_Rb_names' size='56' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xstormy16_cgen_opval_gr_names' size='56' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xstormy16_cgen_opval_h_branchcond' size='56' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xstormy16_cgen_opval_h_wordsize' size='56' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xstormy16_cgen_parse_handlers' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xstormy16_cgen_print_handlers' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='z8k_table' size='41952' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='./floatformat.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/libiberty' language='LANG_C99'>
    <type-decl name='double' size-in-bits='64' id='type-id-1'/>
    <class-decl name='floatformat' size-in-bits='512' is-struct='yes' visibility='default' filepath='./../include/floatformat.h' line='59' column='1' id='type-id-2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='byteorder' type-id='type-id-3' visibility='default' filepath='./../include/floatformat.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='totalsize' type-id='type-id-4' visibility='default' filepath='./../include/floatformat.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sign_start' type-id='type-id-4' visibility='default' filepath='./../include/floatformat.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='exp_start' type-id='type-id-4' visibility='default' filepath='./../include/floatformat.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='exp_len' type-id='type-id-4' visibility='default' filepath='./../include/floatformat.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='exp_bias' type-id='type-id-5' visibility='default' filepath='./../include/floatformat.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='exp_nan' type-id='type-id-4' visibility='default' filepath='./../include/floatformat.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='man_start' type-id='type-id-4' visibility='default' filepath='./../include/floatformat.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='man_len' type-id='type-id-4' visibility='default' filepath='./../include/floatformat.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='intbit' type-id='type-id-6' visibility='default' filepath='./../include/floatformat.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='name' type-id='type-id-7' visibility='default' filepath='./../include/floatformat.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='is_valid' type-id='type-id-8' visibility='default' filepath='./../include/floatformat.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='split_half' type-id='type-id-9' visibility='default' filepath='./../include/floatformat.h' line='97' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='floatformat_byteorders' filepath='./../include/floatformat.h' line='37' column='1' id='type-id-3'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='floatformat_little' value='0'/>
      <enumerator name='floatformat_big' value='1'/>
      <enumerator name='floatformat_littlebyte_bigword' value='2'/>
      <enumerator name='floatformat_vax' value='3'/>
    </enum-decl>
    <enum-decl name='floatformat_intbit' filepath='./../include/floatformat.h' line='57' column='1' id='type-id-6'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='floatformat_intbit_yes' value='0'/>
      <enumerator name='floatformat_intbit_no' value='1'/>
    </enum-decl>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-11'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-12'/>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-13'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-9'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-14'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-8'/>
    <var-decl name='floatformat_ieee_half_big' type-id='type-id-13' mangled-name='floatformat_ieee_half_big' visibility='default' filepath='./../include/floatformat.h' line='102' column='1' elf-symbol-id='floatformat_ieee_half_big'/>
    <var-decl name='floatformat_ieee_half_little' type-id='type-id-13' mangled-name='floatformat_ieee_half_little' visibility='default' filepath='./../include/floatformat.h' line='103' column='1' elf-symbol-id='floatformat_ieee_half_little'/>
    <var-decl name='floatformat_ieee_single_big' type-id='type-id-13' mangled-name='floatformat_ieee_single_big' visibility='default' filepath='./../include/floatformat.h' line='104' column='1' elf-symbol-id='floatformat_ieee_single_big'/>
    <var-decl name='floatformat_ieee_single_little' type-id='type-id-13' mangled-name='floatformat_ieee_single_little' visibility='default' filepath='./../include/floatformat.h' line='105' column='1' elf-symbol-id='floatformat_ieee_single_little'/>
    <var-decl name='floatformat_ieee_double_big' type-id='type-id-13' mangled-name='floatformat_ieee_double_big' visibility='default' filepath='./../include/floatformat.h' line='106' column='1' elf-symbol-id='floatformat_ieee_double_big'/>
    <var-decl name='floatformat_ieee_double_little' type-id='type-id-13' mangled-name='floatformat_ieee_double_little' visibility='default' filepath='./../include/floatformat.h' line='107' column='1' elf-symbol-id='floatformat_ieee_double_little'/>
    <var-decl name='floatformat_ieee_double_littlebyte_bigword' type-id='type-id-13' mangled-name='floatformat_ieee_double_littlebyte_bigword' visibility='default' filepath='./../include/floatformat.h' line='111' column='1' elf-symbol-id='floatformat_ieee_double_littlebyte_bigword'/>
    <var-decl name='floatformat_vax_f' type-id='type-id-13' mangled-name='floatformat_vax_f' visibility='default' filepath='./../include/floatformat.h' line='115' column='1' elf-symbol-id='floatformat_vax_f'/>
    <var-decl name='floatformat_vax_d' type-id='type-id-13' mangled-name='floatformat_vax_d' visibility='default' filepath='./../include/floatformat.h' line='116' column='1' elf-symbol-id='floatformat_vax_d'/>
    <var-decl name='floatformat_vax_g' type-id='type-id-13' mangled-name='floatformat_vax_g' visibility='default' filepath='./../include/floatformat.h' line='117' column='1' elf-symbol-id='floatformat_vax_g'/>
    <var-decl name='floatformat_i387_ext' type-id='type-id-13' mangled-name='floatformat_i387_ext' visibility='default' filepath='./../include/floatformat.h' line='121' column='1' elf-symbol-id='floatformat_i387_ext'/>
    <var-decl name='floatformat_m68881_ext' type-id='type-id-13' mangled-name='floatformat_m68881_ext' visibility='default' filepath='./../include/floatformat.h' line='122' column='1' elf-symbol-id='floatformat_m68881_ext'/>
    <var-decl name='floatformat_i960_ext' type-id='type-id-13' mangled-name='floatformat_i960_ext' visibility='default' filepath='./../include/floatformat.h' line='123' column='1' elf-symbol-id='floatformat_i960_ext'/>
    <var-decl name='floatformat_m88110_ext' type-id='type-id-13' mangled-name='floatformat_m88110_ext' visibility='default' filepath='./../include/floatformat.h' line='124' column='1' elf-symbol-id='floatformat_m88110_ext'/>
    <var-decl name='floatformat_m88110_harris_ext' type-id='type-id-13' mangled-name='floatformat_m88110_harris_ext' visibility='default' filepath='./../include/floatformat.h' line='125' column='1' elf-symbol-id='floatformat_m88110_harris_ext'/>
    <var-decl name='floatformat_arm_ext_big' type-id='type-id-13' mangled-name='floatformat_arm_ext_big' visibility='default' filepath='./../include/floatformat.h' line='126' column='1' elf-symbol-id='floatformat_arm_ext_big'/>
    <var-decl name='floatformat_arm_ext_littlebyte_bigword' type-id='type-id-13' mangled-name='floatformat_arm_ext_littlebyte_bigword' visibility='default' filepath='./../include/floatformat.h' line='127' column='1' elf-symbol-id='floatformat_arm_ext_littlebyte_bigword'/>
    <var-decl name='floatformat_ia64_spill_big' type-id='type-id-13' mangled-name='floatformat_ia64_spill_big' visibility='default' filepath='./../include/floatformat.h' line='129' column='1' elf-symbol-id='floatformat_ia64_spill_big'/>
    <var-decl name='floatformat_ia64_spill_little' type-id='type-id-13' mangled-name='floatformat_ia64_spill_little' visibility='default' filepath='./../include/floatformat.h' line='130' column='1' elf-symbol-id='floatformat_ia64_spill_little'/>
    <var-decl name='floatformat_ia64_quad_big' type-id='type-id-13' mangled-name='floatformat_ia64_quad_big' visibility='default' filepath='./../include/floatformat.h' line='131' column='1' elf-symbol-id='floatformat_ia64_quad_big'/>
    <var-decl name='floatformat_ia64_quad_little' type-id='type-id-13' mangled-name='floatformat_ia64_quad_little' visibility='default' filepath='./../include/floatformat.h' line='132' column='1' elf-symbol-id='floatformat_ia64_quad_little'/>
    <var-decl name='floatformat_ibm_long_double_big' type-id='type-id-13' mangled-name='floatformat_ibm_long_double_big' visibility='default' filepath='./../include/floatformat.h' line='134' column='1' elf-symbol-id='floatformat_ibm_long_double_big'/>
    <var-decl name='floatformat_ibm_long_double_little' type-id='type-id-13' mangled-name='floatformat_ibm_long_double_little' visibility='default' filepath='./../include/floatformat.h' line='135' column='1' elf-symbol-id='floatformat_ibm_long_double_little'/>
    <function-decl name='floatformat_is_valid' mangled-name='floatformat_is_valid' filepath='./floatformat.c' line='704' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='floatformat_is_valid'>
      <parameter type-id='type-id-9' name='fmt' filepath='./floatformat.c' line='704' column='1'/>
      <parameter type-id='type-id-16' name='from' filepath='./floatformat.c' line='704' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='floatformat_from_double' mangled-name='floatformat_from_double' filepath='./floatformat.c' line='604' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='floatformat_from_double'>
      <parameter type-id='type-id-9' name='fmt' filepath='./floatformat.c' line='604' column='1'/>
      <parameter type-id='type-id-12' name='from' filepath='./floatformat.c' line='605' column='1'/>
      <parameter type-id='type-id-16' name='to' filepath='./floatformat.c' line='605' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='floatformat_to_double' mangled-name='floatformat_to_double' filepath='./floatformat.c' line='468' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='floatformat_to_double'>
      <parameter type-id='type-id-9' name='fmt' filepath='./floatformat.c' line='468' column='1'/>
      <parameter type-id='type-id-16' name='from' filepath='./floatformat.c' line='469' column='1'/>
      <parameter type-id='type-id-14' name='to' filepath='./floatformat.c' line='469' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-7'/>
    <function-type size-in-bits='64' id='type-id-15'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-5'/>
    </function-type>
    <type-decl name='int' size-in-bits='32' id='type-id-5'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-4'/>
    <type-decl name='void' id='type-id-17'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-16'/>
    <qualified-type-def type-id='type-id-19' const='yes' id='type-id-18'/>
    <type-decl name='char' size-in-bits='8' id='type-id-19'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='./hashtab.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/libiberty' language='LANG_C99'>
    <typedef-decl name='htab_hash' type-id='type-id-20' filepath='./../include/hashtab.h' line='47' column='1' id='type-id-21'/>
    <typedef-decl name='hashval_t' type-id='type-id-4' filepath='./../include/hashtab.h' line='42' column='1' id='type-id-22'/>
    <typedef-decl name='htab_eq' type-id='type-id-23' filepath='./../include/hashtab.h' line='54' column='1' id='type-id-24'/>
    <typedef-decl name='htab_t' type-id='type-id-25' filepath='./../include/hashtab.h' line='139' column='1' id='type-id-26'/>
    <class-decl name='htab' size-in-bits='896' is-struct='yes' visibility='default' filepath='./../include/hashtab.h' line='95' column='1' id='type-id-27'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hash_f' type-id='type-id-21' visibility='default' filepath='./../include/hashtab.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='eq_f' type-id='type-id-24' visibility='default' filepath='./../include/hashtab.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='del_f' type-id='type-id-28' visibility='default' filepath='./../include/hashtab.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='entries' type-id='type-id-29' visibility='default' filepath='./../include/hashtab.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='size' type-id='type-id-30' visibility='default' filepath='./../include/hashtab.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='n_elements' type-id='type-id-30' visibility='default' filepath='./../include/hashtab.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='n_deleted' type-id='type-id-30' visibility='default' filepath='./../include/hashtab.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='searches' type-id='type-id-4' visibility='default' filepath='./../include/hashtab.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='collisions' type-id='type-id-4' visibility='default' filepath='./../include/hashtab.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='alloc_f' type-id='type-id-31' visibility='default' filepath='./../include/hashtab.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='free_f' type-id='type-id-32' visibility='default' filepath='./../include/hashtab.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='alloc_arg' type-id='type-id-16' visibility='default' filepath='./../include/hashtab.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='alloc_with_arg_f' type-id='type-id-33' visibility='default' filepath='./../include/hashtab.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='free_with_arg_f' type-id='type-id-34' visibility='default' filepath='./../include/hashtab.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='size_prime_index' type-id='type-id-4' visibility='default' filepath='./../include/hashtab.h' line='136' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='htab_del' type-id='type-id-35' filepath='./../include/hashtab.h' line='58' column='1' id='type-id-28'/>
    <typedef-decl name='htab_alloc' type-id='type-id-36' filepath='./../include/hashtab.h' line='70' column='1' id='type-id-31'/>
    <typedef-decl name='htab_free' type-id='type-id-35' filepath='./../include/hashtab.h' line='73' column='1' id='type-id-32'/>
    <typedef-decl name='htab_alloc_with_arg' type-id='type-id-37' filepath='./../include/hashtab.h' line='77' column='1' id='type-id-33'/>
    <typedef-decl name='htab_free_with_arg' type-id='type-id-38' filepath='./../include/hashtab.h' line='78' column='1' id='type-id-34'/>
    <typedef-decl name='htab_trav' type-id='type-id-39' filepath='./../include/hashtab.h' line='64' column='1' id='type-id-40'/>
    <enum-decl name='insert_option' filepath='./../include/hashtab.h' line='142' column='1' id='type-id-41'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='NO_INSERT' value='0'/>
      <enumerator name='INSERT' value='1'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-25'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-39'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-23'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-20'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-35'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-38'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-36'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-37'/>
    <var-decl name='htab_hash_pointer' type-id='type-id-21' mangled-name='htab_hash_pointer' visibility='default' filepath='./../include/hashtab.h' line='187' column='1' elf-symbol-id='htab_hash_pointer'/>
    <var-decl name='htab_eq_pointer' type-id='type-id-24' mangled-name='htab_eq_pointer' visibility='default' filepath='./../include/hashtab.h' line='190' column='1' elf-symbol-id='htab_eq_pointer'/>
    <function-decl name='iterative_hash' mangled-name='iterative_hash' filepath='./hashtab.c' line='923' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='iterative_hash'>
      <parameter type-id='type-id-16' name='k_in' filepath='./hashtab.c' line='923' column='1'/>
      <parameter type-id='type-id-30' name='length' filepath='./hashtab.c' line='924' column='1'/>
      <parameter type-id='type-id-22' name='initval' filepath='./hashtab.c' line='925' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='htab_hash_string' mangled-name='htab_hash_string' filepath='./hashtab.c' line='833' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='htab_hash_string'>
      <parameter type-id='type-id-16' name='p' filepath='./hashtab.c' line='833' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='htab_collisions' mangled-name='htab_collisions' filepath='./hashtab.c' line='799' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='htab_collisions'>
      <parameter type-id='type-id-26' name='htab' filepath='./hashtab.c' line='799' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='htab_traverse' mangled-name='htab_traverse' filepath='./hashtab.c' line='786' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='htab_traverse'>
      <parameter type-id='type-id-26' name='htab' filepath='./hashtab.c' line='786' column='1'/>
      <parameter type-id='type-id-40' name='callback' filepath='./hashtab.c' line='786' column='1'/>
      <parameter type-id='type-id-16' name='info' filepath='./hashtab.c' line='786' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='htab_traverse_noresize' mangled-name='htab_traverse_noresize' filepath='./hashtab.c' line='763' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='htab_traverse_noresize'>
      <parameter type-id='type-id-26' name='htab' filepath='./hashtab.c' line='763' column='1'/>
      <parameter type-id='type-id-40' name='callback' filepath='./hashtab.c' line='763' column='1'/>
      <parameter type-id='type-id-16' name='info' filepath='./hashtab.c' line='763' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='htab_clear_slot' mangled-name='htab_clear_slot' filepath='./hashtab.c' line='744' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='htab_clear_slot'>
      <parameter type-id='type-id-26' name='htab' filepath='./hashtab.c' line='744' column='1'/>
      <parameter type-id='type-id-29' name='slot' filepath='./hashtab.c' line='744' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='htab_remove_elt_with_hash' mangled-name='htab_remove_elt_with_hash' filepath='./hashtab.c' line='724' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='htab_remove_elt_with_hash'>
      <parameter type-id='type-id-26' name='htab' filepath='./hashtab.c' line='724' column='1'/>
      <parameter type-id='type-id-16' name='element' filepath='./hashtab.c' line='724' column='1'/>
      <parameter type-id='type-id-22' name='hash' filepath='./hashtab.c' line='724' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='htab_remove_elt' mangled-name='htab_remove_elt' filepath='./hashtab.c' line='713' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='htab_remove_elt'>
      <parameter type-id='type-id-26' name='htab' filepath='./hashtab.c' line='713' column='1'/>
      <parameter type-id='type-id-16' name='element' filepath='./hashtab.c' line='713' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='htab_find_slot' mangled-name='htab_find_slot' filepath='./hashtab.c' line='702' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='htab_find_slot'>
      <parameter type-id='type-id-26' name='htab' filepath='./hashtab.c' line='702' column='1'/>
      <parameter type-id='type-id-16' name='element' filepath='./hashtab.c' line='702' column='1'/>
      <parameter type-id='type-id-41' name='insert' filepath='./hashtab.c' line='702' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='htab_find_slot_with_hash' mangled-name='htab_find_slot_with_hash' filepath='./hashtab.c' line='634' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='htab_find_slot_with_hash'>
      <parameter type-id='type-id-26' name='htab' filepath='./hashtab.c' line='634' column='1'/>
      <parameter type-id='type-id-16' name='element' filepath='./hashtab.c' line='634' column='1'/>
      <parameter type-id='type-id-22' name='hash' filepath='./hashtab.c' line='635' column='1'/>
      <parameter type-id='type-id-41' name='insert' filepath='./hashtab.c' line='635' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='htab_find' mangled-name='htab_find' filepath='./hashtab.c' line='620' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='htab_find'>
      <parameter type-id='type-id-26' name='htab' filepath='./hashtab.c' line='620' column='1'/>
      <parameter type-id='type-id-16' name='element' filepath='./hashtab.c' line='620' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='htab_find_with_hash' mangled-name='htab_find_with_hash' filepath='./hashtab.c' line='586' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='htab_find_with_hash'>
      <parameter type-id='type-id-26' name='htab' filepath='./hashtab.c' line='586' column='1'/>
      <parameter type-id='type-id-16' name='element' filepath='./hashtab.c' line='586' column='1'/>
      <parameter type-id='type-id-22' name='hash' filepath='./hashtab.c' line='586' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='htab_empty' mangled-name='htab_empty' filepath='./hashtab.c' line='439' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='htab_empty'>
      <parameter type-id='type-id-26' name='htab' filepath='./hashtab.c' line='439' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='htab_delete' mangled-name='htab_delete' filepath='./hashtab.c' line='413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='htab_delete'>
      <parameter type-id='type-id-26' name='htab' filepath='./hashtab.c' line='413' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='htab_try_create' mangled-name='htab_try_create' filepath='./hashtab.c' line='404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='htab_try_create'>
      <parameter type-id='type-id-30' name='size' filepath='./hashtab.c' line='404' column='1'/>
      <parameter type-id='type-id-21' name='hash_f' filepath='./hashtab.c' line='404' column='1'/>
      <parameter type-id='type-id-24' name='eq_f' filepath='./hashtab.c' line='404' column='1'/>
      <parameter type-id='type-id-28' name='del_f' filepath='./hashtab.c' line='404' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='htab_create' mangled-name='htab_create' filepath='./hashtab.c' line='398' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='htab_create'>
      <parameter type-id='type-id-30' name='size' filepath='./hashtab.c' line='398' column='1'/>
      <parameter type-id='type-id-21' name='hash_f' filepath='./hashtab.c' line='398' column='1'/>
      <parameter type-id='type-id-24' name='eq_f' filepath='./hashtab.c' line='398' column='1'/>
      <parameter type-id='type-id-28' name='del_f' filepath='./hashtab.c' line='398' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='htab_set_functions_ex' mangled-name='htab_set_functions_ex' filepath='./hashtab.c' line='382' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='htab_set_functions_ex'>
      <parameter type-id='type-id-26' name='htab' filepath='./hashtab.c' line='382' column='1'/>
      <parameter type-id='type-id-21' name='hash_f' filepath='./hashtab.c' line='382' column='1'/>
      <parameter type-id='type-id-24' name='eq_f' filepath='./hashtab.c' line='382' column='1'/>
      <parameter type-id='type-id-28' name='del_f' filepath='./hashtab.c' line='383' column='1'/>
      <parameter type-id='type-id-16' name='alloc_arg' filepath='./hashtab.c' line='383' column='1'/>
      <parameter type-id='type-id-33' name='alloc_f' filepath='./hashtab.c' line='384' column='1'/>
      <parameter type-id='type-id-34' name='free_f' filepath='./hashtab.c' line='384' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='htab_create_typed_alloc' mangled-name='htab_create_typed_alloc' filepath='./hashtab.c' line='348' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='htab_create_typed_alloc'>
      <parameter type-id='type-id-30' name='size' filepath='./hashtab.c' line='348' column='1'/>
      <parameter type-id='type-id-21' name='hash_f' filepath='./hashtab.c' line='348' column='1'/>
      <parameter type-id='type-id-24' name='eq_f' filepath='./hashtab.c' line='348' column='1'/>
      <parameter type-id='type-id-28' name='del_f' filepath='./hashtab.c' line='349' column='1'/>
      <parameter type-id='type-id-31' name='alloc_tab_f' filepath='./hashtab.c' line='349' column='1'/>
      <parameter type-id='type-id-31' name='alloc_f' filepath='./hashtab.c' line='350' column='1'/>
      <parameter type-id='type-id-32' name='free_f' filepath='./hashtab.c' line='350' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='htab_create_alloc_ex' mangled-name='htab_create_alloc_ex' filepath='./hashtab.c' line='294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='htab_create_alloc_ex'>
      <parameter type-id='type-id-30' name='size' filepath='./hashtab.c' line='294' column='1'/>
      <parameter type-id='type-id-21' name='hash_f' filepath='./hashtab.c' line='294' column='1'/>
      <parameter type-id='type-id-24' name='eq_f' filepath='./hashtab.c' line='294' column='1'/>
      <parameter type-id='type-id-28' name='del_f' filepath='./hashtab.c' line='295' column='1'/>
      <parameter type-id='type-id-16' name='alloc_arg' filepath='./hashtab.c' line='295' column='1'/>
      <parameter type-id='type-id-33' name='alloc_f' filepath='./hashtab.c' line='296' column='1'/>
      <parameter type-id='type-id-34' name='free_f' filepath='./hashtab.c' line='297' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='htab_create_alloc' mangled-name='htab_create_alloc' filepath='./hashtab.c' line='283' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='htab_create_alloc'>
      <parameter type-id='type-id-30' name='size' filepath='./hashtab.c' line='283' column='1'/>
      <parameter type-id='type-id-21' name='hash_f' filepath='./hashtab.c' line='283' column='1'/>
      <parameter type-id='type-id-24' name='eq_f' filepath='./hashtab.c' line='283' column='1'/>
      <parameter type-id='type-id-28' name='del_f' filepath='./hashtab.c' line='284' column='1'/>
      <parameter type-id='type-id-31' name='alloc_f' filepath='./hashtab.c' line='284' column='1'/>
      <parameter type-id='type-id-32' name='free_f' filepath='./hashtab.c' line='284' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='htab_elements' mangled-name='htab_elements' filepath='./hashtab.c' line='226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='htab_elements'>
      <parameter type-id='type-id-26' name='htab' filepath='./hashtab.c' line='226' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='htab_size' mangled-name='htab_size' filepath='./hashtab.c' line='216' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='htab_size'>
      <parameter type-id='type-id-26' name='htab' filepath='./hashtab.c' line='216' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-42'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-43'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-44'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-45'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-17'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-46'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-17'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-47'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-48'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-16'/>
    </function-type>
    <typedef-decl name='size_t' type-id='type-id-49' filepath='/usr/lib/gcc/x86_64-linux-gnu/7/include/stddef.h' line='216' column='1' id='type-id-30'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-29'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-49'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='./regex.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/libiberty' language='LANG_C99'>
    <typedef-decl name='reg_syntax_t' type-id='type-id-49' filepath='./../include/xregex2.h' line='53' column='1' id='type-id-50'/>
    <typedef-decl name='regex_t' type-id='type-id-51' filepath='./../include/xregex2.h' line='398' column='1' id='type-id-52'/>
    <class-decl name='re_pattern_buffer' size-in-bits='512' is-struct='yes' visibility='default' filepath='./../include/xregex2.h' line='330' column='1' id='type-id-51'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-53' visibility='default' filepath='./../include/xregex2.h' line='336' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-49' visibility='default' filepath='./../include/xregex2.h' line='339' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='used' type-id='type-id-49' visibility='default' filepath='./../include/xregex2.h' line='342' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='syntax' type-id='type-id-50' visibility='default' filepath='./../include/xregex2.h' line='345' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fastmap' type-id='type-id-54' visibility='default' filepath='./../include/xregex2.h' line='350' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='translate' type-id='type-id-54' visibility='default' filepath='./../include/xregex2.h' line='356' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='re_nsub' type-id='type-id-30' visibility='default' filepath='./../include/xregex2.h' line='359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='can_be_null' type-id='type-id-4' visibility='default' filepath='./../include/xregex2.h' line='366' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='regs_allocated' type-id='type-id-4' visibility='default' filepath='./../include/xregex2.h' line='375' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='fastmap_accurate' type-id='type-id-4' visibility='default' filepath='./../include/xregex2.h' line='379' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='no_sub' type-id='type-id-4' visibility='default' filepath='./../include/xregex2.h' line='383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='not_bol' type-id='type-id-4' visibility='default' filepath='./../include/xregex2.h' line='387' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='not_eol' type-id='type-id-4' visibility='default' filepath='./../include/xregex2.h' line='390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='newline_anchor' type-id='type-id-4' visibility='default' filepath='./../include/xregex2.h' line='393' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='regmatch_t' type-id='type-id-55' filepath='./../include/xregex2.h' line='429' column='1' id='type-id-56'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-56' visibility='default' filepath='./../include/xregex2.h' line='425' column='1' id='type-id-55'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rm_so' type-id='type-id-57' visibility='default' filepath='./../include/xregex2.h' line='427' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rm_eo' type-id='type-id-57' visibility='default' filepath='./../include/xregex2.h' line='428' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='xregoff_t' type-id='type-id-5' filepath='./../include/xregex2.h' line='401' column='1' id='type-id-57'/>
    <class-decl name='re_registers' size-in-bits='192' is-struct='yes' visibility='default' filepath='./../include/xregex2.h' line='406' column='1' id='type-id-58'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num_regs' type-id='type-id-4' visibility='default' filepath='./../include/xregex2.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='start' type-id='type-id-59' visibility='default' filepath='./../include/xregex2.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='end' type-id='type-id-59' visibility='default' filepath='./../include/xregex2.h' line='410' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-52' const='yes' id='type-id-60'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-61'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-62'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-63'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-64'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-65'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-59'/>
    <var-decl name='xre_max_failures' type-id='type-id-5' mangled-name='xre_max_failures' visibility='default' filepath='./regex.c' line='1461' column='1' elf-symbol-id='xre_max_failures'/>
    <var-decl name='xre_syntax_options' type-id='type-id-50' mangled-name='xre_syntax_options' visibility='default' filepath='./../include/xregex2.h' line='173' column='1' elf-symbol-id='xre_syntax_options'/>
    <function-decl name='xregfree' mangled-name='xregfree' filepath='./regex.c' line='8114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xregfree'>
      <parameter type-id='type-id-64' name='preg' filepath='./regex.c' line='8114' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='xregerror' mangled-name='xregerror' filepath='./regex.c' line='8070' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xregerror'>
      <parameter type-id='type-id-5' name='errcode' filepath='./regex.c' line='8070' column='1'/>
      <parameter type-id='type-id-61' name='preg' filepath='./regex.c' line='8070' column='1'/>
      <parameter type-id='type-id-54' name='errbuf' filepath='./regex.c' line='8071' column='1'/>
      <parameter type-id='type-id-30' name='errbuf_size' filepath='./regex.c' line='8071' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='xregexec' mangled-name='xregexec' filepath='./regex.c' line='8007' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xregexec'>
      <parameter type-id='type-id-61' name='preg' filepath='./regex.c' line='8007' column='1'/>
      <parameter type-id='type-id-7' name='string' filepath='./regex.c' line='8007' column='1'/>
      <parameter type-id='type-id-30' name='nmatch' filepath='./regex.c' line='8007' column='1'/>
      <parameter type-id='type-id-65' name='pmatch' filepath='./regex.c' line='8008' column='1'/>
      <parameter type-id='type-id-5' name='eflags' filepath='./regex.c' line='8008' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='xregcomp' mangled-name='xregcomp' filepath='./regex.c' line='7914' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xregcomp'>
      <parameter type-id='type-id-64' name='preg' filepath='./regex.c' line='7914' column='1'/>
      <parameter type-id='type-id-7' name='pattern' filepath='./regex.c' line='7914' column='1'/>
      <parameter type-id='type-id-5' name='cflags' filepath='./regex.c' line='7914' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='xre_exec' mangled-name='xre_exec' filepath='./regex.c' line='7865' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xre_exec'>
      <parameter type-id='type-id-7' name='s' filepath='./regex.c' line='7865' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='xre_comp' mangled-name='xre_comp' filepath='./regex.c' line='7817' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xre_comp'>
      <parameter type-id='type-id-7' name='s' filepath='./regex.c' line='7817' column='1'/>
      <return type-id='type-id-54'/>
    </function-decl>
    <function-decl name='xre_compile_pattern' mangled-name='xre_compile_pattern' filepath='./regex.c' line='7770' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xre_compile_pattern'>
      <parameter type-id='type-id-7' name='pattern' filepath='./regex.c' line='7770' column='1'/>
      <parameter type-id='type-id-30' name='length' filepath='./regex.c' line='7770' column='1'/>
      <parameter type-id='type-id-62' name='bufp' filepath='./regex.c' line='7771' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='xre_match_2' mangled-name='xre_match_2' filepath='./regex.c' line='5450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xre_match_2'>
      <parameter type-id='type-id-62' name='bufp' filepath='./regex.c' line='5450' column='1'/>
      <parameter type-id='type-id-7' name='string1' filepath='./regex.c' line='5450' column='1'/>
      <parameter type-id='type-id-5' name='size1' filepath='./regex.c' line='5450' column='1'/>
      <parameter type-id='type-id-7' name='string2' filepath='./regex.c' line='5451' column='1'/>
      <parameter type-id='type-id-5' name='size2' filepath='./regex.c' line='5451' column='1'/>
      <parameter type-id='type-id-5' name='pos' filepath='./regex.c' line='5451' column='1'/>
      <parameter type-id='type-id-63' name='regs' filepath='./regex.c' line='5452' column='1'/>
      <parameter type-id='type-id-5' name='stop' filepath='./regex.c' line='5452' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='xre_match' mangled-name='xre_match' filepath='./regex.c' line='5395' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xre_match'>
      <parameter type-id='type-id-62' name='bufp' filepath='./regex.c' line='5395' column='1'/>
      <parameter type-id='type-id-7' name='string' filepath='./regex.c' line='5395' column='1'/>
      <parameter type-id='type-id-5' name='size' filepath='./regex.c' line='5396' column='1'/>
      <parameter type-id='type-id-5' name='pos' filepath='./regex.c' line='5396' column='1'/>
      <parameter type-id='type-id-63' name='regs' filepath='./regex.c' line='5396' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='xre_search_2' mangled-name='xre_search_2' filepath='./regex.c' line='4951' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xre_search_2'>
      <parameter type-id='type-id-62' name='bufp' filepath='./regex.c' line='4951' column='1'/>
      <parameter type-id='type-id-7' name='string1' filepath='./regex.c' line='4951' column='1'/>
      <parameter type-id='type-id-5' name='size1' filepath='./regex.c' line='4951' column='1'/>
      <parameter type-id='type-id-7' name='string2' filepath='./regex.c' line='4952' column='1'/>
      <parameter type-id='type-id-5' name='size2' filepath='./regex.c' line='4952' column='1'/>
      <parameter type-id='type-id-5' name='startpos' filepath='./regex.c' line='4952' column='1'/>
      <parameter type-id='type-id-5' name='range' filepath='./regex.c' line='4952' column='1'/>
      <parameter type-id='type-id-63' name='regs' filepath='./regex.c' line='4953' column='1'/>
      <parameter type-id='type-id-5' name='stop' filepath='./regex.c' line='4953' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='xre_search' mangled-name='xre_search' filepath='./regex.c' line='4918' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xre_search'>
      <parameter type-id='type-id-62' name='bufp' filepath='./regex.c' line='4918' column='1'/>
      <parameter type-id='type-id-7' name='string' filepath='./regex.c' line='4918' column='1'/>
      <parameter type-id='type-id-5' name='size' filepath='./regex.c' line='4918' column='1'/>
      <parameter type-id='type-id-5' name='startpos' filepath='./regex.c' line='4919' column='1'/>
      <parameter type-id='type-id-5' name='range' filepath='./regex.c' line='4919' column='1'/>
      <parameter type-id='type-id-63' name='regs' filepath='./regex.c' line='4919' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='xre_set_registers' mangled-name='xre_set_registers' filepath='./regex.c' line='4890' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xre_set_registers'>
      <parameter type-id='type-id-62' name='bufp' filepath='./regex.c' line='4890' column='1'/>
      <parameter type-id='type-id-63' name='regs' filepath='./regex.c' line='4891' column='1'/>
      <parameter type-id='type-id-4' name='num_regs' filepath='./regex.c' line='4891' column='1'/>
      <parameter type-id='type-id-59' name='starts' filepath='./regex.c' line='4892' column='1'/>
      <parameter type-id='type-id-59' name='ends' filepath='./regex.c' line='4892' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='xre_compile_fastmap' mangled-name='xre_compile_fastmap' filepath='./regex.c' line='4862' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xre_compile_fastmap'>
      <parameter type-id='type-id-62' name='bufp' filepath='./regex.c' line='4862' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='xre_set_syntax' mangled-name='xre_set_syntax' filepath='./regex.c' line='1326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xre_set_syntax'>
      <parameter type-id='type-id-50' name='syntax' filepath='./regex.c' line='1326' column='1'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-54'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-53'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-66'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='./safe-ctype.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/libiberty' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-67' size-in-bits='2048' id='type-id-68'>
      <subrange length='256' type-id='type-id-49' id='type-id-69'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-70' size-in-bits='4096' id='type-id-71'>
      <subrange length='256' type-id='type-id-49' id='type-id-69'/>
    </array-type-def>
    <var-decl name='_sch_istable' type-id='type-id-71' mangled-name='_sch_istable' visibility='default' filepath='./../include/safe-ctype.h' line='85' column='1' elf-symbol-id='_sch_istable'/>
    <var-decl name='_sch_tolower' type-id='type-id-68' mangled-name='_sch_tolower' visibility='default' filepath='./../include/safe-ctype.h' line='111' column='1' elf-symbol-id='_sch_tolower'/>
    <var-decl name='_sch_toupper' type-id='type-id-68' mangled-name='_sch_toupper' visibility='default' filepath='./../include/safe-ctype.h' line='110' column='1' elf-symbol-id='_sch_toupper'/>
    <qualified-type-def type-id='type-id-66' const='yes' id='type-id-67'/>
    <qualified-type-def type-id='type-id-72' const='yes' id='type-id-70'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-72'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='./xexit.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/libiberty' language='LANG_C99'>
    <var-decl name='_xexit_cleanup' type-id='type-id-73' mangled-name='_xexit_cleanup' visibility='default' filepath='./xexit.c' line='44' column='1' elf-symbol-id='_xexit_cleanup'/>
    <function-decl name='xexit' mangled-name='xexit' filepath='./xexit.c' line='47' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xexit'>
      <parameter type-id='type-id-5' name='code' filepath='./xexit.c' line='47' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-73'/>
    <function-type size-in-bits='64' id='type-id-74'>
      <return type-id='type-id-17'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='./xmalloc.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/libiberty' language='LANG_C99'>
    <function-decl name='xrealloc' mangled-name='xrealloc' filepath='./xmalloc.c' line='170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xrealloc'>
      <parameter type-id='type-id-16' name='oldmem' filepath='./xmalloc.c' line='170' column='1'/>
      <parameter type-id='type-id-30' name='size' filepath='./xmalloc.c' line='170' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='xcalloc' mangled-name='xcalloc' filepath='./xmalloc.c' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xcalloc'>
      <parameter type-id='type-id-30' name='nelem' filepath='./xmalloc.c' line='155' column='1'/>
      <parameter type-id='type-id-30' name='elsize' filepath='./xmalloc.c' line='155' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='xmalloc' mangled-name='xmalloc' filepath='./xmalloc.c' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xmalloc'>
      <parameter type-id='type-id-30' name='size' filepath='./xmalloc.c' line='141' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='xmalloc_failed' mangled-name='xmalloc_failed' filepath='./xmalloc.c' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xmalloc_failed'>
      <parameter type-id='type-id-30' name='size' filepath='./xmalloc.c' line='117' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='xmalloc_set_program_name' mangled-name='xmalloc_set_program_name' filepath='./xmalloc.c' line='106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xmalloc_set_program_name'>
      <parameter type-id='type-id-7' name='s' filepath='./xmalloc.c' line='106' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='./xstrdup.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/libiberty' language='LANG_C99'>
    <function-decl name='xstrdup' mangled-name='xstrdup' filepath='./xstrdup.c' line='31' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xstrdup'>
      <parameter type-id='type-id-7' name='s' filepath='./xstrdup.c' line='31' column='1'/>
      <return type-id='type-id-54'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='./disassemble.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-19' size-in-bits='8' id='type-id-75'>
      <subrange length='1' type-id='type-id-49' id='type-id-76'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-19' size-in-bits='160' id='type-id-77'>
      <subrange length='20' type-id='type-id-49' id='type-id-78'/>
    </array-type-def>
    <type-decl name='signed char' size-in-bits='8' id='type-id-79'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-72'/>
    <typedef-decl name='FILE' type-id='type-id-80' filepath='/usr/include/x86_64-linux-gnu/bits/types/FILE.h' line='7' column='1' id='type-id-81'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='245' column='1' id='type-id-80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-54' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-54' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-54' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-54' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-54' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-54' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-54' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-54' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-54' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-54' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-54' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-82' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-83' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-84' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-72' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-79' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-75' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-85' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-86' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='__pad1' type-id='type-id-16' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='__pad2' type-id='type-id-16' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='__pad3' type-id='type-id-16' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='__pad4' type-id='type-id-16' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-30' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-77' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='309' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_marker' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='160' column='1' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_next' type-id='type-id-82' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_sbuf' type-id='type-id-83' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_pos' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='166' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_IO_lock_t' type-id='type-id-17' filepath='/usr/include/x86_64-linux-gnu/bits/libio.h' line='154' column='1' id='type-id-88'/>
    <typedef-decl name='__off64_t' type-id='type-id-89' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='141' column='1' id='type-id-86'/>
    <typedef-decl name='size_t' type-id='type-id-49' filepath='/usr/lib/gcc/x86_64-linux-gnu/7/include/stddef.h' line='216' column='1' id='type-id-30'/>
    <typedef-decl name='disassembler_ftype' type-id='type-id-90' filepath='./../include/dis-asm.h' line='228' column='1' id='type-id-91'/>
    <typedef-decl name='disassemble_info' type-id='type-id-92' filepath='./../include/dis-asm.h' line='223' column='1' id='type-id-93'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-94'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-83'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-85'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-82'/>
    <function-decl name='disassemble_init_for_target' mangled-name='disassemble_init_for_target' filepath='./disassemble.c' line='572' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='disassemble_init_for_target'>
      <parameter type-id='type-id-95' name='info' filepath='./disassemble.c' line='572' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='disassembler_usage' mangled-name='disassembler_usage' filepath='./disassemble.c' line='546' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='disassembler_usage'>
      <parameter type-id='type-id-94' name='stream' filepath='./disassemble.c' line='547' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='disassembler' mangled-name='disassembler' filepath='./disassemble.c' line='109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='disassembler'>
      <parameter type-id='type-id-96' name='abfd' filepath='./disassemble.c' line='110' column='1'/>
      <return type-id='type-id-91'/>
    </function-decl>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-96'/>
    <class-decl name='disassemble_info' size-in-bits='1920' is-struct='yes' visibility='default' filepath='./../include/dis-asm.h' line='61' column='1' id='type-id-92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fprintf_func' type-id='type-id-98' visibility='default' filepath='./../include/dis-asm.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stream' type-id='type-id-16' visibility='default' filepath='./../include/dis-asm.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='application_data' type-id='type-id-16' visibility='default' filepath='./../include/dis-asm.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flavour' type-id='type-id-99' visibility='default' filepath='./../include/dis-asm.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='arch' type-id='type-id-100' visibility='default' filepath='./../include/dis-asm.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mach' type-id='type-id-49' visibility='default' filepath='./../include/dis-asm.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='endian' type-id='type-id-101' visibility='default' filepath='./../include/dis-asm.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='endian_code' type-id='type-id-101' visibility='default' filepath='./../include/dis-asm.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='insn_sets' type-id='type-id-16' visibility='default' filepath='./../include/dis-asm.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='section' type-id='type-id-102' visibility='default' filepath='./../include/dis-asm.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='symbols' type-id='type-id-103' visibility='default' filepath='./../include/dis-asm.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='num_symbols' type-id='type-id-5' visibility='default' filepath='./../include/dis-asm.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='symtab' type-id='type-id-103' visibility='default' filepath='./../include/dis-asm.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='symtab_pos' type-id='type-id-5' visibility='default' filepath='./../include/dis-asm.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='symtab_size' type-id='type-id-5' visibility='default' filepath='./../include/dis-asm.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='flags' type-id='type-id-49' visibility='default' filepath='./../include/dis-asm.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='private_data' type-id='type-id-16' visibility='default' filepath='./../include/dis-asm.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='read_memory_func' type-id='type-id-104' visibility='default' filepath='./../include/dis-asm.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='memory_error_func' type-id='type-id-105' visibility='default' filepath='./../include/dis-asm.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='print_address_func' type-id='type-id-106' visibility='default' filepath='./../include/dis-asm.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='symbol_at_address_func' type-id='type-id-90' visibility='default' filepath='./../include/dis-asm.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='symbol_is_valid' type-id='type-id-107' visibility='default' filepath='./../include/dis-asm.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='buffer' type-id='type-id-108' visibility='default' filepath='./../include/dis-asm.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='buffer_vma' type-id='type-id-109' visibility='default' filepath='./../include/dis-asm.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='buffer_length' type-id='type-id-4' visibility='default' filepath='./../include/dis-asm.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='bytes_per_line' type-id='type-id-5' visibility='default' filepath='./../include/dis-asm.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='bytes_per_chunk' type-id='type-id-5' visibility='default' filepath='./../include/dis-asm.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='display_endian' type-id='type-id-101' visibility='default' filepath='./../include/dis-asm.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='octets_per_byte' type-id='type-id-4' visibility='default' filepath='./../include/dis-asm.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='skip_zeroes' type-id='type-id-4' visibility='default' filepath='./../include/dis-asm.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='skip_zeroes_at_end' type-id='type-id-4' visibility='default' filepath='./../include/dis-asm.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='disassembler_needs_relocs' type-id='type-id-110' visibility='default' filepath='./../include/dis-asm.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='insn_info_valid' type-id='type-id-19' visibility='default' filepath='./../include/dis-asm.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1608'>
        <var-decl name='branch_delay_insns' type-id='type-id-19' visibility='default' filepath='./../include/dis-asm.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1616'>
        <var-decl name='data_size' type-id='type-id-19' visibility='default' filepath='./../include/dis-asm.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='insn_type' type-id='type-id-111' visibility='default' filepath='./../include/dis-asm.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='target' type-id='type-id-109' visibility='default' filepath='./../include/dis-asm.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='target2' type-id='type-id-109' visibility='default' filepath='./../include/dis-asm.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='disassembler_options' type-id='type-id-54' visibility='default' filepath='./../include/dis-asm.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='stop_vma' type-id='type-id-109' visibility='default' filepath='./../include/dis-asm.h' line='221' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-95'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-90'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-89'/>
    <typedef-decl name='__off_t' type-id='type-id-89' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='140' column='1' id='type-id-84'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-102'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-103'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-108'/>
    <enum-decl name='bfd_architecture' filepath='../bfd/bfd.h' line='1881' column='1' id='type-id-100'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='bfd_arch_unknown' value='0'/>
      <enumerator name='bfd_arch_obscure' value='1'/>
      <enumerator name='bfd_arch_m68k' value='2'/>
      <enumerator name='bfd_arch_vax' value='3'/>
      <enumerator name='bfd_arch_i960' value='4'/>
      <enumerator name='bfd_arch_or1k' value='5'/>
      <enumerator name='bfd_arch_sparc' value='6'/>
      <enumerator name='bfd_arch_spu' value='7'/>
      <enumerator name='bfd_arch_mips' value='8'/>
      <enumerator name='bfd_arch_i386' value='9'/>
      <enumerator name='bfd_arch_l1om' value='10'/>
      <enumerator name='bfd_arch_k1om' value='11'/>
      <enumerator name='bfd_arch_iamcu' value='12'/>
      <enumerator name='bfd_arch_we32k' value='13'/>
      <enumerator name='bfd_arch_tahoe' value='14'/>
      <enumerator name='bfd_arch_i860' value='15'/>
      <enumerator name='bfd_arch_i370' value='16'/>
      <enumerator name='bfd_arch_romp' value='17'/>
      <enumerator name='bfd_arch_convex' value='18'/>
      <enumerator name='bfd_arch_m88k' value='19'/>
      <enumerator name='bfd_arch_m98k' value='20'/>
      <enumerator name='bfd_arch_pyramid' value='21'/>
      <enumerator name='bfd_arch_h8300' value='22'/>
      <enumerator name='bfd_arch_pdp11' value='23'/>
      <enumerator name='bfd_arch_plugin' value='24'/>
      <enumerator name='bfd_arch_powerpc' value='25'/>
      <enumerator name='bfd_arch_rs6000' value='26'/>
      <enumerator name='bfd_arch_hppa' value='27'/>
      <enumerator name='bfd_arch_d10v' value='28'/>
      <enumerator name='bfd_arch_d30v' value='29'/>
      <enumerator name='bfd_arch_dlx' value='30'/>
      <enumerator name='bfd_arch_m68hc11' value='31'/>
      <enumerator name='bfd_arch_m68hc12' value='32'/>
      <enumerator name='bfd_arch_m9s12x' value='33'/>
      <enumerator name='bfd_arch_m9s12xg' value='34'/>
      <enumerator name='bfd_arch_z8k' value='35'/>
      <enumerator name='bfd_arch_h8500' value='36'/>
      <enumerator name='bfd_arch_sh' value='37'/>
      <enumerator name='bfd_arch_alpha' value='38'/>
      <enumerator name='bfd_arch_arm' value='39'/>
      <enumerator name='bfd_arch_nds32' value='40'/>
      <enumerator name='bfd_arch_ns32k' value='41'/>
      <enumerator name='bfd_arch_w65' value='42'/>
      <enumerator name='bfd_arch_tic30' value='43'/>
      <enumerator name='bfd_arch_tic4x' value='44'/>
      <enumerator name='bfd_arch_tic54x' value='45'/>
      <enumerator name='bfd_arch_tic6x' value='46'/>
      <enumerator name='bfd_arch_tic80' value='47'/>
      <enumerator name='bfd_arch_v850' value='48'/>
      <enumerator name='bfd_arch_v850_rh850' value='49'/>
      <enumerator name='bfd_arch_arc' value='50'/>
      <enumerator name='bfd_arch_m32c' value='51'/>
      <enumerator name='bfd_arch_m32r' value='52'/>
      <enumerator name='bfd_arch_mn10200' value='53'/>
      <enumerator name='bfd_arch_mn10300' value='54'/>
      <enumerator name='bfd_arch_fr30' value='55'/>
      <enumerator name='bfd_arch_frv' value='56'/>
      <enumerator name='bfd_arch_moxie' value='57'/>
      <enumerator name='bfd_arch_ft32' value='58'/>
      <enumerator name='bfd_arch_mcore' value='59'/>
      <enumerator name='bfd_arch_mep' value='60'/>
      <enumerator name='bfd_arch_metag' value='61'/>
      <enumerator name='bfd_arch_ia64' value='62'/>
      <enumerator name='bfd_arch_ip2k' value='63'/>
      <enumerator name='bfd_arch_iq2000' value='64'/>
      <enumerator name='bfd_arch_epiphany' value='65'/>
      <enumerator name='bfd_arch_mt' value='66'/>
      <enumerator name='bfd_arch_pj' value='67'/>
      <enumerator name='bfd_arch_avr' value='68'/>
      <enumerator name='bfd_arch_bfin' value='69'/>
      <enumerator name='bfd_arch_cr16' value='70'/>
      <enumerator name='bfd_arch_cr16c' value='71'/>
      <enumerator name='bfd_arch_crx' value='72'/>
      <enumerator name='bfd_arch_cris' value='73'/>
      <enumerator name='bfd_arch_rl78' value='74'/>
      <enumerator name='bfd_arch_rx' value='75'/>
      <enumerator name='bfd_arch_s390' value='76'/>
      <enumerator name='bfd_arch_score' value='77'/>
      <enumerator name='bfd_arch_mmix' value='78'/>
      <enumerator name='bfd_arch_xstormy16' value='79'/>
      <enumerator name='bfd_arch_msp430' value='80'/>
      <enumerator name='bfd_arch_xc16x' value='81'/>
      <enumerator name='bfd_arch_xgate' value='82'/>
      <enumerator name='bfd_arch_xtensa' value='83'/>
      <enumerator name='bfd_arch_z80' value='84'/>
      <enumerator name='bfd_arch_lm32' value='85'/>
      <enumerator name='bfd_arch_microblaze' value='86'/>
      <enumerator name='bfd_arch_tilepro' value='87'/>
      <enumerator name='bfd_arch_tilegx' value='88'/>
      <enumerator name='bfd_arch_aarch64' value='89'/>
      <enumerator name='bfd_arch_nios2' value='90'/>
      <enumerator name='bfd_arch_visium' value='91'/>
      <enumerator name='bfd_arch_last' value='92'/>
    </enum-decl>
    <enum-decl name='bfd_endian' filepath='../bfd/bfd.h' line='7106' column='1' id='type-id-101'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='BFD_ENDIAN_BIG' value='0'/>
      <enumerator name='BFD_ENDIAN_LITTLE' value='1'/>
      <enumerator name='BFD_ENDIAN_UNKNOWN' value='2'/>
    </enum-decl>
    <enum-decl name='bfd_flavour' filepath='../bfd/bfd.h' line='7077' column='1' id='type-id-99'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='bfd_target_unknown_flavour' value='0'/>
      <enumerator name='bfd_target_aout_flavour' value='1'/>
      <enumerator name='bfd_target_coff_flavour' value='2'/>
      <enumerator name='bfd_target_ecoff_flavour' value='3'/>
      <enumerator name='bfd_target_xcoff_flavour' value='4'/>
      <enumerator name='bfd_target_elf_flavour' value='5'/>
      <enumerator name='bfd_target_ieee_flavour' value='6'/>
      <enumerator name='bfd_target_nlm_flavour' value='7'/>
      <enumerator name='bfd_target_oasys_flavour' value='8'/>
      <enumerator name='bfd_target_tekhex_flavour' value='9'/>
      <enumerator name='bfd_target_srec_flavour' value='10'/>
      <enumerator name='bfd_target_verilog_flavour' value='11'/>
      <enumerator name='bfd_target_ihex_flavour' value='12'/>
      <enumerator name='bfd_target_som_flavour' value='13'/>
      <enumerator name='bfd_target_os9k_flavour' value='14'/>
      <enumerator name='bfd_target_versados_flavour' value='15'/>
      <enumerator name='bfd_target_msdos_flavour' value='16'/>
      <enumerator name='bfd_target_ovax_flavour' value='17'/>
      <enumerator name='bfd_target_evax_flavour' value='18'/>
      <enumerator name='bfd_target_mmo_flavour' value='19'/>
      <enumerator name='bfd_target_mach_o_flavour' value='20'/>
      <enumerator name='bfd_target_pef_flavour' value='21'/>
      <enumerator name='bfd_target_pef_xlib_flavour' value='22'/>
      <enumerator name='bfd_target_sym_flavour' value='23'/>
    </enum-decl>
    <enum-decl name='dis_insn_type' filepath='./../include/dis-asm.h' line='39' column='1' id='type-id-111'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='dis_noninsn' value='0'/>
      <enumerator name='dis_nonbranch' value='1'/>
      <enumerator name='dis_branch' value='2'/>
      <enumerator name='dis_condbranch' value='3'/>
      <enumerator name='dis_jsr' value='4'/>
      <enumerator name='dis_condjsr' value='5'/>
      <enumerator name='dis_dref' value='6'/>
      <enumerator name='dis_dref2' value='7'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-104'/>
    <typedef-decl name='bfd' type-id='type-id-117' filepath='../bfd/bfd.h' line='117' column='1' id='type-id-97'/>
    <typedef-decl name='bfd_boolean' type-id='type-id-5' filepath='../bfd/bfd.h' line='128' column='1' id='type-id-110'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-107'/>
    <typedef-decl name='bfd_vma' type-id='type-id-49' filepath='../bfd/bfd.h' line='140' column='1' id='type-id-109'/>
    <typedef-decl name='fprintf_ftype' type-id='type-id-119' filepath='./../include/dis-asm.h' line='37' column='1' id='type-id-98'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-105'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-106'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-114'/>
    <class-decl name='bfd' size-in-bits='2240' is-struct='yes' visibility='default' filepath='../bfd/bfd.h' line='6519' column='1' id='type-id-117'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='filename' type-id='type-id-7' visibility='default' filepath='../bfd/bfd.h' line='6522' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='xvec' type-id='type-id-123' visibility='default' filepath='../bfd/bfd.h' line='6525' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='iostream' type-id='type-id-16' visibility='default' filepath='../bfd/bfd.h' line='6529' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='iovec' type-id='type-id-124' visibility='default' filepath='../bfd/bfd.h' line='6530' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lru_prev' type-id='type-id-96' visibility='default' filepath='../bfd/bfd.h' line='6534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='lru_next' type-id='type-id-96' visibility='default' filepath='../bfd/bfd.h' line='6534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='where' type-id='type-id-125' visibility='default' filepath='../bfd/bfd.h' line='6538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mtime' type-id='type-id-89' visibility='default' filepath='../bfd/bfd.h' line='6541' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='id' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='6544' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='format' type-id='type-id-126' visibility='default' filepath='../bfd/bfd.h' line='6547' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='direction' type-id='type-id-127' visibility='default' filepath='../bfd/bfd.h' line='6550' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='flags' type-id='type-id-128' visibility='default' filepath='../bfd/bfd.h' line='6553' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='cacheable' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='6646' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='target_defaulted' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='6651' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='opened_once' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='6654' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='mtime_set' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='6658' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='no_export' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='6661' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='output_has_begun' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='6665' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='has_armap' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='6668' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='is_thin_archive' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='6671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='selective_search' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='6675' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='is_linker_output' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='6678' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='is_linker_input' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='6681' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='plugin_format' type-id='type-id-129' visibility='default' filepath='../bfd/bfd.h' line='6684' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='lto_output' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='6687' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='plugin_dummy_bfd' type-id='type-id-96' visibility='default' filepath='../bfd/bfd.h' line='6691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='origin' type-id='type-id-125' visibility='default' filepath='../bfd/bfd.h' line='6696' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='proxy_origin' type-id='type-id-125' visibility='default' filepath='../bfd/bfd.h' line='6703' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='section_htab' type-id='type-id-130' visibility='default' filepath='../bfd/bfd.h' line='6706' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='sections' type-id='type-id-131' visibility='default' filepath='../bfd/bfd.h' line='6709' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='section_last' type-id='type-id-131' visibility='default' filepath='../bfd/bfd.h' line='6712' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='section_count' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='6715' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='archive_pass' type-id='type-id-5' visibility='default' filepath='../bfd/bfd.h' line='6719' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='start_address' type-id='type-id-109' visibility='default' filepath='../bfd/bfd.h' line='6723' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='outsymbols' type-id='type-id-132' visibility='default' filepath='../bfd/bfd.h' line='6727' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='symcount' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='6730' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='dynsymcount' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='6733' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='arch_info' type-id='type-id-133' visibility='default' filepath='../bfd/bfd.h' line='6736' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='arelt_data' type-id='type-id-16' visibility='default' filepath='../bfd/bfd.h' line='6739' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='my_archive' type-id='type-id-96' visibility='default' filepath='../bfd/bfd.h' line='6740' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='archive_next' type-id='type-id-96' visibility='default' filepath='../bfd/bfd.h' line='6741' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='archive_head' type-id='type-id-96' visibility='default' filepath='../bfd/bfd.h' line='6742' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='nested_archives' type-id='type-id-96' visibility='default' filepath='../bfd/bfd.h' line='6743' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='link' type-id='type-id-134' visibility='default' filepath='../bfd/bfd.h' line='6751' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='tdata' type-id='type-id-135' visibility='default' filepath='../bfd/bfd.h' line='6794' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='usrdata' type-id='type-id-16' visibility='default' filepath='../bfd/bfd.h' line='6797' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='memory' type-id='type-id-16' visibility='default' filepath='../bfd/bfd.h' line='6802' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='build_id' type-id='type-id-136' visibility='default' filepath='../bfd/bfd.h' line='6805' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-119'/>
    <typedef-decl name='asection' type-id='type-id-138' filepath='../bfd/bfd.h' line='1613' column='1' id='type-id-113'/>
    <typedef-decl name='bfd_byte' type-id='type-id-66' filepath='../bfd/bfd.h' line='205' column='1' id='type-id-115'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-131'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-132'/>
    <class-decl name='bfd_hash_table' size-in-bits='320' is-struct='yes' visibility='default' filepath='../bfd/bfd.h' line='359' column='1' id='type-id-130'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='table' type-id='type-id-140' visibility='default' filepath='../bfd/bfd.h' line='362' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='newfunc' type-id='type-id-141' visibility='default' filepath='../bfd/bfd.h' line='370' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='memory' type-id='type-id-16' visibility='default' filepath='../bfd/bfd.h' line='374' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='size' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='376' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='count' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='entsize' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='frozen' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='382' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bfd_section' size-in-bits='2240' is-struct='yes' visibility='default' filepath='../bfd/bfd.h' line='1222' column='1' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-7' visibility='default' filepath='../bfd/bfd.h' line='1226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='1229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='index' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='1232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='next' type-id='type-id-131' visibility='default' filepath='../bfd/bfd.h' line='1235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='prev' type-id='type-id-131' visibility='default' filepath='../bfd/bfd.h' line='1238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='flags' type-id='type-id-128' visibility='default' filepath='../bfd/bfd.h' line='1243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='user_set_vma' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='1440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='linker_mark' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='1443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='linker_has_input' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='1447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='gc_mark' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='1450' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='compress_status' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='1453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='segment_mark' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='1461' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22'>
        <var-decl name='sec_info_type' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='1464' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21'>
        <var-decl name='use_rela_p' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='1474' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='sec_flg0' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='1479' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='sec_flg1' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='1480' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18'>
        <var-decl name='sec_flg2' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='1481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='sec_flg3' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='1482' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sec_flg4' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='1483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='sec_flg5' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='1484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='vma' type-id='type-id-109' visibility='default' filepath='../bfd/bfd.h' line='1494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='lma' type-id='type-id-109' visibility='default' filepath='../bfd/bfd.h' line='1499' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='size' type-id='type-id-142' visibility='default' filepath='../bfd/bfd.h' line='1504' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='rawsize' type-id='type-id-142' visibility='default' filepath='../bfd/bfd.h' line='1514' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='compressed_size' type-id='type-id-142' visibility='default' filepath='../bfd/bfd.h' line='1517' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='relax' type-id='type-id-143' visibility='default' filepath='../bfd/bfd.h' line='1520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='relax_count' type-id='type-id-5' visibility='default' filepath='../bfd/bfd.h' line='1523' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='output_offset' type-id='type-id-109' visibility='default' filepath='../bfd/bfd.h' line='1533' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='output_section' type-id='type-id-131' visibility='default' filepath='../bfd/bfd.h' line='1536' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='alignment_power' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='1540' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='relocation' type-id='type-id-144' visibility='default' filepath='../bfd/bfd.h' line='1544' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='orelocation' type-id='type-id-145' visibility='default' filepath='../bfd/bfd.h' line='1548' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='reloc_count' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='1551' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='filepos' type-id='type-id-146' visibility='default' filepath='../bfd/bfd.h' line='1557' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='rel_filepos' type-id='type-id-146' visibility='default' filepath='../bfd/bfd.h' line='1560' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='line_filepos' type-id='type-id-146' visibility='default' filepath='../bfd/bfd.h' line='1563' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='userdata' type-id='type-id-16' visibility='default' filepath='../bfd/bfd.h' line='1566' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='contents' type-id='type-id-53' visibility='default' filepath='../bfd/bfd.h' line='1570' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='lineno' type-id='type-id-147' visibility='default' filepath='../bfd/bfd.h' line='1573' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='lineno_count' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='1576' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='entsize' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='1579' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='kept_section' type-id='type-id-131' visibility='default' filepath='../bfd/bfd.h' line='1583' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='moving_line_filepos' type-id='type-id-146' visibility='default' filepath='../bfd/bfd.h' line='1587' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='target_index' type-id='type-id-5' visibility='default' filepath='../bfd/bfd.h' line='1590' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='used_by_bfd' type-id='type-id-16' visibility='default' filepath='../bfd/bfd.h' line='1592' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='constructor_chain' type-id='type-id-148' visibility='default' filepath='../bfd/bfd.h' line='1596' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='owner' type-id='type-id-96' visibility='default' filepath='../bfd/bfd.h' line='1599' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='symbol' type-id='type-id-139' visibility='default' filepath='../bfd/bfd.h' line='1602' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='symbol_ptr_ptr' type-id='type-id-132' visibility='default' filepath='../bfd/bfd.h' line='1603' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='map_head' type-id='type-id-149' visibility='default' filepath='../bfd/bfd.h' line='1612' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='map_tail' type-id='type-id-149' visibility='default' filepath='../bfd/bfd.h' line='1612' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-133'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-136'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-124'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-123'/>
    <enum-decl name='bfd_direction' filepath='../bfd/bfd.h' line='6498' column='1' id='type-id-127'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='no_direction' value='0'/>
      <enumerator name='read_direction' value='1'/>
      <enumerator name='write_direction' value='2'/>
      <enumerator name='both_direction' value='3'/>
    </enum-decl>
    <enum-decl name='bfd_format' filepath='../bfd/bfd.h' line='209' column='1' id='type-id-126'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='bfd_unknown' value='0'/>
      <enumerator name='bfd_object' value='1'/>
      <enumerator name='bfd_archive' value='2'/>
      <enumerator name='bfd_core' value='3'/>
      <enumerator name='bfd_type_end' value='4'/>
    </enum-decl>
    <enum-decl name='bfd_plugin_format' filepath='../bfd/bfd.h' line='6506' column='1' id='type-id-129'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='bfd_plugin_uknown' value='0'/>
      <enumerator name='bfd_plugin_yes' value='1'/>
      <enumerator name='bfd_plugin_no' value='2'/>
    </enum-decl>
    <typedef-decl name='asymbol' type-id='type-id-154' filepath='../bfd/bfd.h' line='6450' column='1' id='type-id-122'/>
    <typedef-decl name='flagword' type-id='type-id-4' filepath='../bfd/bfd.h' line='204' column='1' id='type-id-128'/>
    <typedef-decl name='ufile_ptr' type-id='type-id-49' filepath='../bfd/bfd.h' line='196' column='1' id='type-id-125'/>
    <union-decl name='__anonymous_union__4' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../bfd/bfd.h' line='6754' column='1' id='type-id-135'>
      <data-member access='private'>
        <var-decl name='aout_data' type-id='type-id-155' visibility='default' filepath='../bfd/bfd.h' line='6756' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='aout_ar_data' type-id='type-id-156' visibility='default' filepath='../bfd/bfd.h' line='6757' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='oasys_obj_data' type-id='type-id-157' visibility='default' filepath='../bfd/bfd.h' line='6758' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='oasys_ar_data' type-id='type-id-158' visibility='default' filepath='../bfd/bfd.h' line='6759' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='coff_obj_data' type-id='type-id-159' visibility='default' filepath='../bfd/bfd.h' line='6760' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pe_obj_data' type-id='type-id-160' visibility='default' filepath='../bfd/bfd.h' line='6761' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='xcoff_obj_data' type-id='type-id-161' visibility='default' filepath='../bfd/bfd.h' line='6762' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ecoff_obj_data' type-id='type-id-162' visibility='default' filepath='../bfd/bfd.h' line='6763' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ieee_data' type-id='type-id-163' visibility='default' filepath='../bfd/bfd.h' line='6764' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ieee_ar_data' type-id='type-id-164' visibility='default' filepath='../bfd/bfd.h' line='6765' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='srec_data' type-id='type-id-165' visibility='default' filepath='../bfd/bfd.h' line='6766' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='verilog_data' type-id='type-id-166' visibility='default' filepath='../bfd/bfd.h' line='6767' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ihex_data' type-id='type-id-167' visibility='default' filepath='../bfd/bfd.h' line='6768' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='tekhex_data' type-id='type-id-168' visibility='default' filepath='../bfd/bfd.h' line='6769' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='elf_obj_data' type-id='type-id-169' visibility='default' filepath='../bfd/bfd.h' line='6770' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='nlm_obj_data' type-id='type-id-170' visibility='default' filepath='../bfd/bfd.h' line='6771' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='bout_data' type-id='type-id-171' visibility='default' filepath='../bfd/bfd.h' line='6772' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='mmo_data' type-id='type-id-172' visibility='default' filepath='../bfd/bfd.h' line='6773' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sun_core_data' type-id='type-id-173' visibility='default' filepath='../bfd/bfd.h' line='6774' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sco5_core_data' type-id='type-id-174' visibility='default' filepath='../bfd/bfd.h' line='6775' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='trad_core_data' type-id='type-id-175' visibility='default' filepath='../bfd/bfd.h' line='6776' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='som_data' type-id='type-id-176' visibility='default' filepath='../bfd/bfd.h' line='6777' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='hpux_core_data' type-id='type-id-177' visibility='default' filepath='../bfd/bfd.h' line='6778' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='hppabsd_core_data' type-id='type-id-178' visibility='default' filepath='../bfd/bfd.h' line='6779' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sgi_core_data' type-id='type-id-179' visibility='default' filepath='../bfd/bfd.h' line='6780' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='lynx_core_data' type-id='type-id-180' visibility='default' filepath='../bfd/bfd.h' line='6781' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='osf_core_data' type-id='type-id-181' visibility='default' filepath='../bfd/bfd.h' line='6782' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='cisco_core_data' type-id='type-id-182' visibility='default' filepath='../bfd/bfd.h' line='6783' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='versados_data' type-id='type-id-183' visibility='default' filepath='../bfd/bfd.h' line='6784' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='netbsd_core_data' type-id='type-id-184' visibility='default' filepath='../bfd/bfd.h' line='6785' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='mach_o_data' type-id='type-id-185' visibility='default' filepath='../bfd/bfd.h' line='6786' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='mach_o_fat_data' type-id='type-id-186' visibility='default' filepath='../bfd/bfd.h' line='6787' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='plugin_data' type-id='type-id-187' visibility='default' filepath='../bfd/bfd.h' line='6788' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pef_data' type-id='type-id-188' visibility='default' filepath='../bfd/bfd.h' line='6789' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pef_xlib_data' type-id='type-id-189' visibility='default' filepath='../bfd/bfd.h' line='6790' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sym_data' type-id='type-id-190' visibility='default' filepath='../bfd/bfd.h' line='6791' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='any' type-id='type-id-16' visibility='default' filepath='../bfd/bfd.h' line='6792' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__3' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../bfd/bfd.h' line='6746' column='1' id='type-id-134'>
      <data-member access='private'>
        <var-decl name='next' type-id='type-id-96' visibility='default' filepath='../bfd/bfd.h' line='6748' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='hash' type-id='type-id-191' visibility='default' filepath='../bfd/bfd.h' line='6750' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-192' size-in-bits='64' id='type-id-158'/>
    <pointer-type-def type-id='type-id-193' size-in-bits='64' id='type-id-157'/>
    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-147'/>
    <pointer-type-def type-id='type-id-195' size-in-bits='64' id='type-id-155'/>
    <pointer-type-def type-id='type-id-196' size-in-bits='64' id='type-id-156'/>
    <pointer-type-def type-id='type-id-197' size-in-bits='64' id='type-id-141'/>
    <pointer-type-def type-id='type-id-198' size-in-bits='64' id='type-id-140'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' id='type-id-191'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-188'/>
    <pointer-type-def type-id='type-id-201' size-in-bits='64' id='type-id-189'/>
    <pointer-type-def type-id='type-id-202' size-in-bits='64' id='type-id-190'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-139'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-171'/>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-182'/>
    <class-decl name='bfd_symbol' size-in-bits='384' is-struct='yes' visibility='default' filepath='../bfd/bfd.h' line='6310' column='1' id='type-id-154'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='the_bfd' type-id='type-id-96' visibility='default' filepath='../bfd/bfd.h' line='6321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-7' visibility='default' filepath='../bfd/bfd.h' line='6325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='value' type-id='type-id-205' visibility='default' filepath='../bfd/bfd.h' line='6330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flags' type-id='type-id-128' visibility='default' filepath='../bfd/bfd.h' line='6435' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='section' type-id='type-id-131' visibility='default' filepath='../bfd/bfd.h' line='6440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='udata' type-id='type-id-206' visibility='default' filepath='../bfd/bfd.h' line='6448' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-159'/>
    <qualified-type-def type-id='type-id-208' const='yes' id='type-id-150'/>
    <qualified-type-def type-id='type-id-209' const='yes' id='type-id-151'/>
    <qualified-type-def type-id='type-id-210' const='yes' id='type-id-152'/>
    <qualified-type-def type-id='type-id-211' const='yes' id='type-id-153'/>
    <pointer-type-def type-id='type-id-212' size-in-bits='64' id='type-id-162'/>
    <pointer-type-def type-id='type-id-213' size-in-bits='64' id='type-id-169'/>
    <pointer-type-def type-id='type-id-214' size-in-bits='64' id='type-id-178'/>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-177'/>
    <pointer-type-def type-id='type-id-216' size-in-bits='64' id='type-id-164'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-163'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-167'/>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-180'/>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-185'/>
    <pointer-type-def type-id='type-id-221' size-in-bits='64' id='type-id-186'/>
    <pointer-type-def type-id='type-id-222' size-in-bits='64' id='type-id-172'/>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' id='type-id-184'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-170'/>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' id='type-id-181'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' id='type-id-160'/>
    <pointer-type-def type-id='type-id-227' size-in-bits='64' id='type-id-187'/>
    <pointer-type-def type-id='type-id-228' size-in-bits='64' id='type-id-143'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-148'/>
    <pointer-type-def type-id='type-id-230' size-in-bits='64' id='type-id-144'/>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-145'/>
    <pointer-type-def type-id='type-id-231' size-in-bits='64' id='type-id-174'/>
    <pointer-type-def type-id='type-id-232' size-in-bits='64' id='type-id-179'/>
    <pointer-type-def type-id='type-id-233' size-in-bits='64' id='type-id-176'/>
    <pointer-type-def type-id='type-id-234' size-in-bits='64' id='type-id-165'/>
    <pointer-type-def type-id='type-id-235' size-in-bits='64' id='type-id-173'/>
    <pointer-type-def type-id='type-id-236' size-in-bits='64' id='type-id-168'/>
    <pointer-type-def type-id='type-id-237' size-in-bits='64' id='type-id-175'/>
    <typedef-decl name='bfd_size_type' type-id='type-id-49' filepath='../bfd/bfd.h' line='142' column='1' id='type-id-142'/>
    <typedef-decl name='file_ptr' type-id='type-id-89' filepath='../bfd/bfd.h' line='195' column='1' id='type-id-146'/>
    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../bfd/bfd.h' line='1609' column='1' id='type-id-149'>
      <data-member access='private'>
        <var-decl name='link_order' type-id='type-id-238' visibility='default' filepath='../bfd/bfd.h' line='1610' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='s' type-id='type-id-131' visibility='default' filepath='../bfd/bfd.h' line='1611' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-239' size-in-bits='64' id='type-id-166'/>
    <pointer-type-def type-id='type-id-240' size-in-bits='64' id='type-id-183'/>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-161'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-198'/>
    <pointer-type-def type-id='type-id-243' size-in-bits='64' id='type-id-238'/>
    <class-decl name='_oasys_ar_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-192'/>
    <class-decl name='_oasys_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-193'/>
    <class-decl name='aout_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-195'/>
    <class-decl name='artdata' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-196'/>
    <class-decl name='bfd_arch_info' size-in-bits='640' is-struct='yes' visibility='default' filepath='../bfd/bfd.h' line='2327' column='1' id='type-id-208'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bits_per_word' type-id='type-id-5' visibility='default' filepath='../bfd/bfd.h' line='2329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bits_per_address' type-id='type-id-5' visibility='default' filepath='../bfd/bfd.h' line='2330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bits_per_byte' type-id='type-id-5' visibility='default' filepath='../bfd/bfd.h' line='2331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='arch' type-id='type-id-100' visibility='default' filepath='../bfd/bfd.h' line='2332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mach' type-id='type-id-49' visibility='default' filepath='../bfd/bfd.h' line='2333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='arch_name' type-id='type-id-7' visibility='default' filepath='../bfd/bfd.h' line='2334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='printable_name' type-id='type-id-7' visibility='default' filepath='../bfd/bfd.h' line='2335' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='section_align_power' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='2336' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='the_default' type-id='type-id-110' visibility='default' filepath='../bfd/bfd.h' line='2340' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='compatible' type-id='type-id-244' visibility='default' filepath='../bfd/bfd.h' line='2341' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='scan' type-id='type-id-245' visibility='default' filepath='../bfd/bfd.h' line='2344' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='fill' type-id='type-id-246' visibility='default' filepath='../bfd/bfd.h' line='2349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='next' type-id='type-id-133' visibility='default' filepath='../bfd/bfd.h' line='2352' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bfd_build_id' size-in-bits='128' is-struct='yes' visibility='default' filepath='../bfd/bfd.h' line='6513' column='1' id='type-id-209'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-142' visibility='default' filepath='../bfd/bfd.h' line='6515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-247' visibility='default' filepath='../bfd/bfd.h' line='6516' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bfd_iovec' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-210'/>
    <class-decl name='bfd_link_hash_table' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-199'/>
    <class-decl name='bfd_pef_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-200'/>
    <class-decl name='bfd_pef_xlib_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-201'/>
    <class-decl name='bfd_sym_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-202'/>
    <class-decl name='bfd_target' size-in-bits='6784' is-struct='yes' visibility='default' filepath='../bfd/bfd.h' line='7114' column='1' id='type-id-211'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-54' visibility='default' filepath='../bfd/bfd.h' line='7117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flavour' type-id='type-id-99' visibility='default' filepath='../bfd/bfd.h' line='7121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='byteorder' type-id='type-id-101' visibility='default' filepath='../bfd/bfd.h' line='7124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='header_byteorder' type-id='type-id-101' visibility='default' filepath='../bfd/bfd.h' line='7127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='object_flags' type-id='type-id-128' visibility='default' filepath='../bfd/bfd.h' line='7131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='section_flags' type-id='type-id-128' visibility='default' filepath='../bfd/bfd.h' line='7135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='symbol_leading_char' type-id='type-id-19' visibility='default' filepath='../bfd/bfd.h' line='7139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='ar_pad_char' type-id='type-id-19' visibility='default' filepath='../bfd/bfd.h' line='7142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='ar_max_namelen' type-id='type-id-66' visibility='default' filepath='../bfd/bfd.h' line='7145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='match_priority' type-id='type-id-66' visibility='default' filepath='../bfd/bfd.h' line='7149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bfd_getx64' type-id='type-id-248' visibility='default' filepath='../bfd/bfd.h' line='7154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='bfd_getx_signed_64' type-id='type-id-249' visibility='default' filepath='../bfd/bfd.h' line='7155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='bfd_putx64' type-id='type-id-250' visibility='default' filepath='../bfd/bfd.h' line='7156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='bfd_getx32' type-id='type-id-251' visibility='default' filepath='../bfd/bfd.h' line='7157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='bfd_getx_signed_32' type-id='type-id-252' visibility='default' filepath='../bfd/bfd.h' line='7158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='bfd_putx32' type-id='type-id-253' visibility='default' filepath='../bfd/bfd.h' line='7159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='bfd_getx16' type-id='type-id-251' visibility='default' filepath='../bfd/bfd.h' line='7160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='bfd_getx_signed_16' type-id='type-id-252' visibility='default' filepath='../bfd/bfd.h' line='7161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bfd_putx16' type-id='type-id-253' visibility='default' filepath='../bfd/bfd.h' line='7162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='bfd_h_getx64' type-id='type-id-248' visibility='default' filepath='../bfd/bfd.h' line='7165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='bfd_h_getx_signed_64' type-id='type-id-249' visibility='default' filepath='../bfd/bfd.h' line='7166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='bfd_h_putx64' type-id='type-id-250' visibility='default' filepath='../bfd/bfd.h' line='7167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='bfd_h_getx32' type-id='type-id-251' visibility='default' filepath='../bfd/bfd.h' line='7168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='bfd_h_getx_signed_32' type-id='type-id-252' visibility='default' filepath='../bfd/bfd.h' line='7169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='bfd_h_putx32' type-id='type-id-253' visibility='default' filepath='../bfd/bfd.h' line='7170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='bfd_h_getx16' type-id='type-id-251' visibility='default' filepath='../bfd/bfd.h' line='7171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='bfd_h_getx_signed_16' type-id='type-id-252' visibility='default' filepath='../bfd/bfd.h' line='7172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='bfd_h_putx16' type-id='type-id-253' visibility='default' filepath='../bfd/bfd.h' line='7173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_bfd_check_format' type-id='type-id-254' visibility='default' filepath='../bfd/bfd.h' line='7179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='_bfd_set_format' type-id='type-id-255' visibility='default' filepath='../bfd/bfd.h' line='7182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='_bfd_write_contents' type-id='type-id-255' visibility='default' filepath='../bfd/bfd.h' line='7185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='_close_and_cleanup' type-id='type-id-256' visibility='default' filepath='../bfd/bfd.h' line='7197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='_bfd_free_cached_info' type-id='type-id-256' visibility='default' filepath='../bfd/bfd.h' line='7199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='_new_section_hook' type-id='type-id-257' visibility='default' filepath='../bfd/bfd.h' line='7201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='_bfd_get_section_contents' type-id='type-id-258' visibility='default' filepath='../bfd/bfd.h' line='7203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='_bfd_get_section_contents_in_window' type-id='type-id-259' visibility='default' filepath='../bfd/bfd.h' line='7205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='_bfd_copy_private_bfd_data' type-id='type-id-260' visibility='default' filepath='../bfd/bfd.h' line='7221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='_bfd_merge_private_bfd_data' type-id='type-id-260' visibility='default' filepath='../bfd/bfd.h' line='7224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='_bfd_init_private_section_data' type-id='type-id-261' visibility='default' filepath='../bfd/bfd.h' line='7229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='_bfd_copy_private_section_data' type-id='type-id-262' visibility='default' filepath='../bfd/bfd.h' line='7233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='_bfd_copy_private_symbol_data' type-id='type-id-263' visibility='default' filepath='../bfd/bfd.h' line='7237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='_bfd_copy_private_header_data' type-id='type-id-260' visibility='default' filepath='../bfd/bfd.h' line='7241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='_bfd_set_private_flags' type-id='type-id-264' visibility='default' filepath='../bfd/bfd.h' line='7244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='_bfd_print_private_bfd_data' type-id='type-id-265' visibility='default' filepath='../bfd/bfd.h' line='7247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='_core_file_failing_command' type-id='type-id-266' visibility='default' filepath='../bfd/bfd.h' line='7256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='_core_file_failing_signal' type-id='type-id-267' visibility='default' filepath='../bfd/bfd.h' line='7257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='_core_file_matches_executable_p' type-id='type-id-260' visibility='default' filepath='../bfd/bfd.h' line='7258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='_core_file_pid' type-id='type-id-267' visibility='default' filepath='../bfd/bfd.h' line='7259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='_bfd_slurp_armap' type-id='type-id-256' visibility='default' filepath='../bfd/bfd.h' line='7275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='_bfd_slurp_extended_name_table' type-id='type-id-256' visibility='default' filepath='../bfd/bfd.h' line='7276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='_bfd_construct_extended_name_table' type-id='type-id-268' visibility='default' filepath='../bfd/bfd.h' line='7277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='_bfd_truncate_arname' type-id='type-id-269' visibility='default' filepath='../bfd/bfd.h' line='7279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='write_armap' type-id='type-id-270' visibility='default' filepath='../bfd/bfd.h' line='7280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='_bfd_read_ar_hdr_fn' type-id='type-id-271' visibility='default' filepath='../bfd/bfd.h' line='7282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='_bfd_write_ar_hdr_fn' type-id='type-id-260' visibility='default' filepath='../bfd/bfd.h' line='7283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='openr_next_archived_file' type-id='type-id-272' visibility='default' filepath='../bfd/bfd.h' line='7284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='_bfd_get_elt_at_index' type-id='type-id-273' visibility='default' filepath='../bfd/bfd.h' line='7286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='_bfd_stat_arch_elt' type-id='type-id-274' visibility='default' filepath='../bfd/bfd.h' line='7287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='_bfd_update_armap_timestamp' type-id='type-id-256' visibility='default' filepath='../bfd/bfd.h' line='7288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='_bfd_get_symtab_upper_bound' type-id='type-id-275' visibility='default' filepath='../bfd/bfd.h' line='7308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='_bfd_canonicalize_symtab' type-id='type-id-276' visibility='default' filepath='../bfd/bfd.h' line='7309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='_bfd_make_empty_symbol' type-id='type-id-277' visibility='default' filepath='../bfd/bfd.h' line='7312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='_bfd_print_symbol' type-id='type-id-278' visibility='default' filepath='../bfd/bfd.h' line='7313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='_bfd_get_symbol_info' type-id='type-id-279' visibility='default' filepath='../bfd/bfd.h' line='7316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='_bfd_get_symbol_version_string' type-id='type-id-280' visibility='default' filepath='../bfd/bfd.h' line='7319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='_bfd_is_local_label_name' type-id='type-id-281' visibility='default' filepath='../bfd/bfd.h' line='7322' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='_bfd_is_target_special_symbol' type-id='type-id-282' visibility='default' filepath='../bfd/bfd.h' line='7323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='_get_lineno' type-id='type-id-283' visibility='default' filepath='../bfd/bfd.h' line='7324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='_bfd_find_nearest_line' type-id='type-id-284' visibility='default' filepath='../bfd/bfd.h' line='7325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='_bfd_find_line' type-id='type-id-285' visibility='default' filepath='../bfd/bfd.h' line='7328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='_bfd_find_inliner_info' type-id='type-id-286' visibility='default' filepath='../bfd/bfd.h' line='7331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='_bfd_make_debug_symbol' type-id='type-id-287' visibility='default' filepath='../bfd/bfd.h' line='7336' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='_read_minisymbols' type-id='type-id-288' visibility='default' filepath='../bfd/bfd.h' line='7340' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='_minisymbol_to_symbol' type-id='type-id-289' visibility='default' filepath='../bfd/bfd.h' line='7344' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='_get_reloc_upper_bound' type-id='type-id-290' visibility='default' filepath='../bfd/bfd.h' line='7354' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='_bfd_canonicalize_reloc' type-id='type-id-291' visibility='default' filepath='../bfd/bfd.h' line='7355' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='reloc_type_lookup' type-id='type-id-292' visibility='default' filepath='../bfd/bfd.h' line='7359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='reloc_name_lookup' type-id='type-id-293' visibility='default' filepath='../bfd/bfd.h' line='7361' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='_bfd_set_arch_mach' type-id='type-id-294' visibility='default' filepath='../bfd/bfd.h' line='7369' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='_bfd_set_section_contents' type-id='type-id-258' visibility='default' filepath='../bfd/bfd.h' line='7371' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='_bfd_sizeof_headers' type-id='type-id-295' visibility='default' filepath='../bfd/bfd.h' line='7393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5376'>
        <var-decl name='_bfd_get_relocated_section_contents' type-id='type-id-296' visibility='default' filepath='../bfd/bfd.h' line='7394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='_bfd_relax_section' type-id='type-id-297' visibility='default' filepath='../bfd/bfd.h' line='7398' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='_bfd_link_hash_table_create' type-id='type-id-298' visibility='default' filepath='../bfd/bfd.h' line='7404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='_bfd_link_add_symbols' type-id='type-id-299' visibility='default' filepath='../bfd/bfd.h' line='7407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5632'>
        <var-decl name='_bfd_link_just_syms' type-id='type-id-300' visibility='default' filepath='../bfd/bfd.h' line='7410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='_bfd_copy_link_hash_symbol_type' type-id='type-id-301' visibility='default' filepath='../bfd/bfd.h' line='7416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5760'>
        <var-decl name='_bfd_final_link' type-id='type-id-299' visibility='default' filepath='../bfd/bfd.h' line='7421' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='_bfd_link_split_section' type-id='type-id-302' visibility='default' filepath='../bfd/bfd.h' line='7424' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5888'>
        <var-decl name='_bfd_gc_sections' type-id='type-id-299' visibility='default' filepath='../bfd/bfd.h' line='7427' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='_bfd_lookup_section_flags' type-id='type-id-303' visibility='default' filepath='../bfd/bfd.h' line='7430' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6016'>
        <var-decl name='_bfd_merge_sections' type-id='type-id-299' visibility='default' filepath='../bfd/bfd.h' line='7435' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6080'>
        <var-decl name='_bfd_is_group_section' type-id='type-id-304' visibility='default' filepath='../bfd/bfd.h' line='7438' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='_bfd_discard_group' type-id='type-id-302' visibility='default' filepath='../bfd/bfd.h' line='7441' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6208'>
        <var-decl name='_section_already_linked' type-id='type-id-305' visibility='default' filepath='../bfd/bfd.h' line='7445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6272'>
        <var-decl name='_bfd_define_common_symbol' type-id='type-id-306' visibility='default' filepath='../bfd/bfd.h' line='7449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='_bfd_get_dynamic_symtab_upper_bound' type-id='type-id-275' visibility='default' filepath='../bfd/bfd.h' line='7461' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6400'>
        <var-decl name='_bfd_canonicalize_dynamic_symtab' type-id='type-id-276' visibility='default' filepath='../bfd/bfd.h' line='7463' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6464'>
        <var-decl name='_bfd_get_synthetic_symtab' type-id='type-id-307' visibility='default' filepath='../bfd/bfd.h' line='7466' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6528'>
        <var-decl name='_bfd_get_dynamic_reloc_upper_bound' type-id='type-id-275' visibility='default' filepath='../bfd/bfd.h' line='7470' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='_bfd_canonicalize_dynamic_reloc' type-id='type-id-308' visibility='default' filepath='../bfd/bfd.h' line='7472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='alternative_target' type-id='type-id-123' visibility='default' filepath='../bfd/bfd.h' line='7476' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6720'>
        <var-decl name='backend_data' type-id='type-id-16' visibility='default' filepath='../bfd/bfd.h' line='7480' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bout_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-203'/>
    <class-decl name='cisco_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-204'/>
    <class-decl name='coff_tdata' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-207'/>
    <class-decl name='ecoff_tdata' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-212'/>
    <class-decl name='elf_obj_tdata' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-213'/>
    <class-decl name='hppabsd_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-214'/>
    <class-decl name='hpux_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-215'/>
    <class-decl name='ieee_ar_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-216'/>
    <class-decl name='ieee_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-217'/>
    <class-decl name='ihex_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-218'/>
    <class-decl name='lynx_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-219'/>
    <class-decl name='mach_o_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-220'/>
    <class-decl name='mach_o_fat_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-221'/>
    <class-decl name='mmo_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-222'/>
    <class-decl name='netbsd_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-223'/>
    <class-decl name='nlm_obj_tdata' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-224'/>
    <class-decl name='osf_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-225'/>
    <class-decl name='pe_tdata' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-226'/>
    <class-decl name='plugin_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-227'/>
    <class-decl name='relax_table' size-in-bits='128' is-struct='yes' visibility='default' filepath='../bfd/bfd.h' line='1618' column='1' id='type-id-228'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-109' visibility='default' filepath='../bfd/bfd.h' line='1620' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-5' visibility='default' filepath='../bfd/bfd.h' line='1623' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='relent_chain' size-in-bits='320' is-struct='yes' visibility='default' filepath='../bfd/bfd.h' line='2572' column='1' id='type-id-229'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='relent' type-id='type-id-309' visibility='default' filepath='../bfd/bfd.h' line='2574' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='next' type-id='type-id-148' visibility='default' filepath='../bfd/bfd.h' line='2575' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='reloc_cache_entry' size-in-bits='256' is-struct='yes' visibility='default' filepath='../bfd/bfd.h' line='2422' column='1' id='type-id-230'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sym_ptr_ptr' type-id='type-id-132' visibility='default' filepath='../bfd/bfd.h' line='2425' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='address' type-id='type-id-142' visibility='default' filepath='../bfd/bfd.h' line='2428' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addend' type-id='type-id-109' visibility='default' filepath='../bfd/bfd.h' line='2431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='howto' type-id='type-id-310' visibility='default' filepath='../bfd/bfd.h' line='2434' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sco5_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-231'/>
    <class-decl name='sgi_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-232'/>
    <class-decl name='som_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-233'/>
    <class-decl name='srec_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-234'/>
    <class-decl name='sun_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-235'/>
    <class-decl name='tekhex_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-236'/>
    <class-decl name='trad_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-237'/>
    <class-decl name='verilog_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-239'/>
    <class-decl name='versados_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-240'/>
    <class-decl name='xcoff_tdata' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-241'/>
    <typedef-decl name='alent' type-id='type-id-311' filepath='../bfd/bfd.h' line='277' column='1' id='type-id-194'/>
    <typedef-decl name='symvalue' type-id='type-id-49' filepath='../bfd/bfd.h' line='143' column='1' id='type-id-205'/>
    <union-decl name='__anonymous_union__5' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../bfd/bfd.h' line='6443' column='1' id='type-id-206'>
      <data-member access='private'>
        <var-decl name='p' type-id='type-id-16' visibility='default' filepath='../bfd/bfd.h' line='6445' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='i' type-id='type-id-109' visibility='default' filepath='../bfd/bfd.h' line='6446' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-312' size-in-bits='64' id='type-id-283'/>
    <pointer-type-def type-id='type-id-313' size-in-bits='64' id='type-id-289'/>
    <pointer-type-def type-id='type-id-314' size-in-bits='64' id='type-id-287'/>
    <pointer-type-def type-id='type-id-315' size-in-bits='64' id='type-id-272'/>
    <pointer-type-def type-id='type-id-316' size-in-bits='64' id='type-id-273'/>
    <pointer-type-def type-id='type-id-317' size-in-bits='64' id='type-id-296'/>
    <array-type-def dimensions='1' type-id='type-id-115' size-in-bits='8' id='type-id-247'>
      <subrange length='1' type-id='type-id-49' id='type-id-76'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-318' size-in-bits='64' id='type-id-298'/>
    <pointer-type-def type-id='type-id-319' size-in-bits='64' id='type-id-277'/>
    <pointer-type-def type-id='type-id-320' size-in-bits='64' id='type-id-266'/>
    <class-decl name='bfd_hash_entry' size-in-bits='192' is-struct='yes' visibility='default' filepath='../bfd/bfd.h' line='346' column='1' id='type-id-242'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-198' visibility='default' filepath='../bfd/bfd.h' line='349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='string' type-id='type-id-7' visibility='default' filepath='../bfd/bfd.h' line='351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hash' type-id='type-id-49' visibility='default' filepath='../bfd/bfd.h' line='354' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bfd_link_order' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-243'/>
    <class-decl name='lineno_cache_entry' size-in-bits='128' is-struct='yes' visibility='default' filepath='../bfd/bfd.h' line='268' column='1' id='type-id-311'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='line_number' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='u' type-id='type-id-321' visibility='default' filepath='../bfd/bfd.h' line='275' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-322' size-in-bits='64' id='type-id-244'/>
    <array-type-def dimensions='1' type-id='type-id-323' size-in-bits='256' id='type-id-254'>
      <subrange length='4' type-id='type-id-49' id='type-id-324'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-325' size-in-bits='64' id='type-id-280'/>
    <pointer-type-def type-id='type-id-326' size-in-bits='64' id='type-id-267'/>
    <pointer-type-def type-id='type-id-327' size-in-bits='64' id='type-id-295'/>
    <pointer-type-def type-id='type-id-328' size-in-bits='64' id='type-id-274'/>
    <pointer-type-def type-id='type-id-329' size-in-bits='64' id='type-id-275'/>
    <pointer-type-def type-id='type-id-330' size-in-bits='64' id='type-id-308'/>
    <pointer-type-def type-id='type-id-331' size-in-bits='64' id='type-id-276'/>
    <pointer-type-def type-id='type-id-332' size-in-bits='64' id='type-id-307'/>
    <pointer-type-def type-id='type-id-333' size-in-bits='64' id='type-id-288'/>
    <pointer-type-def type-id='type-id-334' size-in-bits='64' id='type-id-290'/>
    <pointer-type-def type-id='type-id-335' size-in-bits='64' id='type-id-291'/>
    <pointer-type-def type-id='type-id-336' size-in-bits='64' id='type-id-310'/>
    <pointer-type-def type-id='type-id-337' size-in-bits='64' id='type-id-293'/>
    <pointer-type-def type-id='type-id-338' size-in-bits='64' id='type-id-292'/>
    <typedef-decl name='arelent' type-id='type-id-230' filepath='../bfd/bfd.h' line='2437' column='1' id='type-id-309'/>
    <pointer-type-def type-id='type-id-339' size-in-bits='64' id='type-id-256'/>
    <array-type-def dimensions='1' type-id='type-id-256' size-in-bits='256' id='type-id-255'>
      <subrange length='4' type-id='type-id-49' id='type-id-324'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-340' size-in-bits='64' id='type-id-305'/>
    <pointer-type-def type-id='type-id-341' size-in-bits='64' id='type-id-282'/>
    <pointer-type-def type-id='type-id-342' size-in-bits='64' id='type-id-263'/>
    <pointer-type-def type-id='type-id-343' size-in-bits='64' id='type-id-260'/>
    <pointer-type-def type-id='type-id-344' size-in-bits='64' id='type-id-299'/>
    <pointer-type-def type-id='type-id-345' size-in-bits='64' id='type-id-306'/>
    <pointer-type-def type-id='type-id-346' size-in-bits='64' id='type-id-302'/>
    <pointer-type-def type-id='type-id-347' size-in-bits='64' id='type-id-297'/>
    <pointer-type-def type-id='type-id-348' size-in-bits='64' id='type-id-284'/>
    <pointer-type-def type-id='type-id-349' size-in-bits='64' id='type-id-285'/>
    <pointer-type-def type-id='type-id-350' size-in-bits='64' id='type-id-268'/>
    <pointer-type-def type-id='type-id-351' size-in-bits='64' id='type-id-304'/>
    <pointer-type-def type-id='type-id-352' size-in-bits='64' id='type-id-281'/>
    <pointer-type-def type-id='type-id-353' size-in-bits='64' id='type-id-286'/>
    <pointer-type-def type-id='type-id-354' size-in-bits='64' id='type-id-294'/>
    <pointer-type-def type-id='type-id-355' size-in-bits='64' id='type-id-264'/>
    <pointer-type-def type-id='type-id-356' size-in-bits='64' id='type-id-257'/>
    <pointer-type-def type-id='type-id-357' size-in-bits='64' id='type-id-262'/>
    <pointer-type-def type-id='type-id-358' size-in-bits='64' id='type-id-261'/>
    <pointer-type-def type-id='type-id-359' size-in-bits='64' id='type-id-259'/>
    <pointer-type-def type-id='type-id-360' size-in-bits='64' id='type-id-258'/>
    <pointer-type-def type-id='type-id-361' size-in-bits='64' id='type-id-270'/>
    <pointer-type-def type-id='type-id-362' size-in-bits='64' id='type-id-265'/>
    <pointer-type-def type-id='type-id-363' size-in-bits='64' id='type-id-303'/>
    <pointer-type-def type-id='type-id-364' size-in-bits='64' id='type-id-245'/>
    <pointer-type-def type-id='type-id-365' size-in-bits='64' id='type-id-249'/>
    <pointer-type-def type-id='type-id-366' size-in-bits='64' id='type-id-252'/>
    <pointer-type-def type-id='type-id-367' size-in-bits='64' id='type-id-248'/>
    <pointer-type-def type-id='type-id-368' size-in-bits='64' id='type-id-251'/>
    <pointer-type-def type-id='type-id-369' size-in-bits='64' id='type-id-300'/>
    <pointer-type-def type-id='type-id-370' size-in-bits='64' id='type-id-301'/>
    <pointer-type-def type-id='type-id-371' size-in-bits='64' id='type-id-279'/>
    <pointer-type-def type-id='type-id-372' size-in-bits='64' id='type-id-269'/>
    <pointer-type-def type-id='type-id-373' size-in-bits='64' id='type-id-278'/>
    <pointer-type-def type-id='type-id-374' size-in-bits='64' id='type-id-250'/>
    <pointer-type-def type-id='type-id-375' size-in-bits='64' id='type-id-253'/>
    <pointer-type-def type-id='type-id-376' size-in-bits='64' id='type-id-271'/>
    <pointer-type-def type-id='type-id-377' size-in-bits='64' id='type-id-246'/>
    <pointer-type-def type-id='type-id-378' size-in-bits='64' id='type-id-323'/>
    <typedef-decl name='reloc_howto_type' type-id='type-id-379' filepath='../bfd/bfd.h' line='225' column='1' id='type-id-336'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../bfd/bfd.h' line='271' column='1' id='type-id-321'>
      <data-member access='private'>
        <var-decl name='sym' type-id='type-id-139' visibility='default' filepath='../bfd/bfd.h' line='273' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='offset' type-id='type-id-109' visibility='default' filepath='../bfd/bfd.h' line='274' column='1'/>
      </data-member>
    </union-decl>
    <qualified-type-def type-id='type-id-380' const='yes' id='type-id-379'/>
    <class-decl name='reloc_howto_struct' size-in-bits='640' is-struct='yes' visibility='default' filepath='../bfd/bfd.h' line='2460' column='1' id='type-id-380'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='2468' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rightshift' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='2472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-5' visibility='default' filepath='../bfd/bfd.h' line='2477' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='bitsize' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='2481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pc_relative' type-id='type-id-110' visibility='default' filepath='../bfd/bfd.h' line='2484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='bitpos' type-id='type-id-4' visibility='default' filepath='../bfd/bfd.h' line='2488' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='complain_on_overflow' type-id='type-id-381' visibility='default' filepath='../bfd/bfd.h' line='2492' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='special_function' type-id='type-id-382' visibility='default' filepath='../bfd/bfd.h' line='2498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='name' type-id='type-id-54' visibility='default' filepath='../bfd/bfd.h' line='2503' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='partial_inplace' type-id='type-id-110' visibility='default' filepath='../bfd/bfd.h' line='2520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='src_mask' type-id='type-id-109' visibility='default' filepath='../bfd/bfd.h' line='2530' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='dst_mask' type-id='type-id-109' visibility='default' filepath='../bfd/bfd.h' line='2534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='pcrel_offset' type-id='type-id-110' visibility='default' filepath='../bfd/bfd.h' line='2542' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='complain_overflow' filepath='../bfd/bfd.h' line='2440' column='1' id='type-id-381'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='complain_overflow_dont' value='0'/>
      <enumerator name='complain_overflow_bitfield' value='1'/>
      <enumerator name='complain_overflow_signed' value='2'/>
      <enumerator name='complain_overflow_unsigned' value='3'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-383' size-in-bits='64' id='type-id-382'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='./sh-dis.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-384' size-in-bits='232448' id='type-id-385'>
      <subrange length='454' type-id='type-id-49' id='type-id-386'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-387' size-in-bits='128' alignment-in-bits='32' id='type-id-388'>
      <subrange length='4' type-id='type-id-49' id='type-id-324'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-389' size-in-bits='288' alignment-in-bits='32' id='type-id-390'>
      <subrange length='9' type-id='type-id-49' id='type-id-391'/>
    </array-type-def>
    <typedef-decl name='sh_opcode_info' type-id='type-id-392' filepath='./sh-opc.h' line='378' column='1' id='type-id-393'/>
    <class-decl name='__anonymous_struct__' size-in-bits='512' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-393' visibility='default' filepath='./sh-opc.h' line='372' column='1' id='type-id-392'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-54' visibility='default' filepath='./sh-opc.h' line='374' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-388' visibility='default' filepath='./sh-opc.h' line='375' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nibbles' type-id='type-id-390' visibility='default' filepath='./sh-opc.h' line='376' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='arch' type-id='type-id-4' visibility='default' filepath='./sh-opc.h' line='377' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='sh_arg_type' type-id='type-id-394' filepath='./sh-opc.h' line='192' column='1' id='type-id-387'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='./sh-opc.h' line='99' column='1' id='type-id-394'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='A_END' value='0'/>
      <enumerator name='A_BDISP12' value='1'/>
      <enumerator name='A_BDISP8' value='2'/>
      <enumerator name='A_DEC_M' value='3'/>
      <enumerator name='A_DEC_N' value='4'/>
      <enumerator name='A_DISP_GBR' value='5'/>
      <enumerator name='A_PC' value='6'/>
      <enumerator name='A_DISP_PC' value='7'/>
      <enumerator name='A_DISP_PC_ABS' value='8'/>
      <enumerator name='A_DISP_REG_M' value='9'/>
      <enumerator name='A_DISP_REG_N' value='10'/>
      <enumerator name='A_GBR' value='11'/>
      <enumerator name='A_IMM' value='12'/>
      <enumerator name='A_INC_M' value='13'/>
      <enumerator name='A_INC_N' value='14'/>
      <enumerator name='A_IND_M' value='15'/>
      <enumerator name='A_IND_N' value='16'/>
      <enumerator name='A_IND_R0_REG_M' value='17'/>
      <enumerator name='A_IND_R0_REG_N' value='18'/>
      <enumerator name='A_MACH' value='19'/>
      <enumerator name='A_MACL' value='20'/>
      <enumerator name='A_PR' value='21'/>
      <enumerator name='A_R0' value='22'/>
      <enumerator name='A_R0_GBR' value='23'/>
      <enumerator name='A_REG_M' value='24'/>
      <enumerator name='A_REG_N' value='25'/>
      <enumerator name='A_REG_B' value='26'/>
      <enumerator name='A_SR' value='27'/>
      <enumerator name='A_VBR' value='28'/>
      <enumerator name='A_TBR' value='29'/>
      <enumerator name='A_DISP_TBR' value='30'/>
      <enumerator name='A_DISP2_TBR' value='31'/>
      <enumerator name='A_DEC_R15' value='32'/>
      <enumerator name='A_INC_R15' value='33'/>
      <enumerator name='A_MOD' value='34'/>
      <enumerator name='A_RE' value='35'/>
      <enumerator name='A_RS' value='36'/>
      <enumerator name='A_DSR' value='37'/>
      <enumerator name='DSP_REG_M' value='38'/>
      <enumerator name='DSP_REG_N' value='39'/>
      <enumerator name='DSP_REG_X' value='40'/>
      <enumerator name='DSP_REG_Y' value='41'/>
      <enumerator name='DSP_REG_E' value='42'/>
      <enumerator name='DSP_REG_F' value='43'/>
      <enumerator name='DSP_REG_G' value='44'/>
      <enumerator name='DSP_REG_A_M' value='45'/>
      <enumerator name='DSP_REG_AX' value='46'/>
      <enumerator name='DSP_REG_XY' value='47'/>
      <enumerator name='DSP_REG_AY' value='48'/>
      <enumerator name='DSP_REG_YX' value='49'/>
      <enumerator name='AX_INC_N' value='50'/>
      <enumerator name='AY_INC_N' value='51'/>
      <enumerator name='AXY_INC_N' value='52'/>
      <enumerator name='AYX_INC_N' value='53'/>
      <enumerator name='AX_IND_N' value='54'/>
      <enumerator name='AY_IND_N' value='55'/>
      <enumerator name='AXY_IND_N' value='56'/>
      <enumerator name='AYX_IND_N' value='57'/>
      <enumerator name='AX_PMOD_N' value='58'/>
      <enumerator name='AXY_PMOD_N' value='59'/>
      <enumerator name='AY_PMOD_N' value='60'/>
      <enumerator name='AYX_PMOD_N' value='61'/>
      <enumerator name='AS_DEC_N' value='62'/>
      <enumerator name='AS_INC_N' value='63'/>
      <enumerator name='AS_IND_N' value='64'/>
      <enumerator name='AS_PMOD_N' value='65'/>
      <enumerator name='A_A0' value='66'/>
      <enumerator name='A_X0' value='67'/>
      <enumerator name='A_X1' value='68'/>
      <enumerator name='A_Y0' value='69'/>
      <enumerator name='A_Y1' value='70'/>
      <enumerator name='A_SSR' value='71'/>
      <enumerator name='A_SPC' value='72'/>
      <enumerator name='A_SGR' value='73'/>
      <enumerator name='A_DBR' value='74'/>
      <enumerator name='F_REG_N' value='75'/>
      <enumerator name='F_REG_M' value='76'/>
      <enumerator name='D_REG_N' value='77'/>
      <enumerator name='D_REG_M' value='78'/>
      <enumerator name='X_REG_N' value='79'/>
      <enumerator name='X_REG_M' value='80'/>
      <enumerator name='DX_REG_N' value='81'/>
      <enumerator name='DX_REG_M' value='82'/>
      <enumerator name='V_REG_N' value='83'/>
      <enumerator name='V_REG_M' value='84'/>
      <enumerator name='XMTRX_M4' value='85'/>
      <enumerator name='F_FR0' value='86'/>
      <enumerator name='FPUL_N' value='87'/>
      <enumerator name='FPUL_M' value='88'/>
      <enumerator name='FPSCR_N' value='89'/>
      <enumerator name='FPSCR_M' value='90'/>
    </enum-decl>
    <typedef-decl name='sh_nibble_type' type-id='type-id-395' filepath='./sh-opc.h' line='96' column='1' id='type-id-389'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' filepath='./sh-opc.h' line='24' column='1' id='type-id-395'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='HEX_0' value='0'/>
      <enumerator name='HEX_1' value='1'/>
      <enumerator name='HEX_2' value='2'/>
      <enumerator name='HEX_3' value='3'/>
      <enumerator name='HEX_4' value='4'/>
      <enumerator name='HEX_5' value='5'/>
      <enumerator name='HEX_6' value='6'/>
      <enumerator name='HEX_7' value='7'/>
      <enumerator name='HEX_8' value='8'/>
      <enumerator name='HEX_9' value='9'/>
      <enumerator name='HEX_A' value='10'/>
      <enumerator name='HEX_B' value='11'/>
      <enumerator name='HEX_C' value='12'/>
      <enumerator name='HEX_D' value='13'/>
      <enumerator name='HEX_E' value='14'/>
      <enumerator name='HEX_F' value='15'/>
      <enumerator name='HEX_XX00' value='16'/>
      <enumerator name='HEX_00YY' value='17'/>
      <enumerator name='REG_N' value='18'/>
      <enumerator name='REG_N_D' value='19'/>
      <enumerator name='REG_N_B01' value='20'/>
      <enumerator name='REG_M' value='21'/>
      <enumerator name='SDT_REG_N' value='22'/>
      <enumerator name='REG_NM' value='23'/>
      <enumerator name='REG_B' value='24'/>
      <enumerator name='BRANCH_12' value='25'/>
      <enumerator name='BRANCH_8' value='26'/>
      <enumerator name='IMM0_4' value='27'/>
      <enumerator name='IMM0_4BY2' value='28'/>
      <enumerator name='IMM0_4BY4' value='29'/>
      <enumerator name='IMM1_4' value='30'/>
      <enumerator name='IMM1_4BY2' value='31'/>
      <enumerator name='IMM1_4BY4' value='32'/>
      <enumerator name='PCRELIMM_8BY2' value='33'/>
      <enumerator name='PCRELIMM_8BY4' value='34'/>
      <enumerator name='IMM0_8' value='35'/>
      <enumerator name='IMM0_8BY2' value='36'/>
      <enumerator name='IMM0_8BY4' value='37'/>
      <enumerator name='IMM1_8' value='38'/>
      <enumerator name='IMM1_8BY2' value='39'/>
      <enumerator name='IMM1_8BY4' value='40'/>
      <enumerator name='PPI' value='41'/>
      <enumerator name='NOPX' value='42'/>
      <enumerator name='NOPY' value='43'/>
      <enumerator name='MOVX' value='44'/>
      <enumerator name='MOVY' value='45'/>
      <enumerator name='MOVX_NOPY' value='46'/>
      <enumerator name='MOVY_NOPX' value='47'/>
      <enumerator name='PSH' value='48'/>
      <enumerator name='PMUL' value='49'/>
      <enumerator name='PPI3' value='50'/>
      <enumerator name='PPI3NC' value='51'/>
      <enumerator name='PDC' value='52'/>
      <enumerator name='PPIC' value='53'/>
      <enumerator name='REPEAT' value='54'/>
      <enumerator name='IMM0_3c' value='55'/>
      <enumerator name='IMM0_3s' value='56'/>
      <enumerator name='IMM0_3Uc' value='57'/>
      <enumerator name='IMM0_3Us' value='58'/>
      <enumerator name='IMM0_20_4' value='59'/>
      <enumerator name='IMM0_20' value='60'/>
      <enumerator name='IMM0_20BY8' value='61'/>
      <enumerator name='DISP0_12' value='62'/>
      <enumerator name='DISP0_12BY2' value='63'/>
      <enumerator name='DISP0_12BY4' value='64'/>
      <enumerator name='DISP0_12BY8' value='65'/>
      <enumerator name='DISP1_12' value='66'/>
      <enumerator name='DISP1_12BY2' value='67'/>
      <enumerator name='DISP1_12BY4' value='68'/>
      <enumerator name='DISP1_12BY8' value='69'/>
    </enum-decl>
    <qualified-type-def type-id='type-id-393' const='yes' id='type-id-384'/>
    <var-decl name='sh_table' type-id='type-id-385' mangled-name='sh_table' visibility='default' filepath='./sh-opc.h' line='382' column='1' elf-symbol-id='sh_table'/>
    <function-decl name='print_insn_sh' mangled-name='print_insn_sh' filepath='./sh-dis.c' line='384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='print_insn_sh'>
      <parameter type-id='type-id-109' name='memaddr' filepath='./sh-dis.c' line='384' column='1'/>
      <parameter type-id='type-id-95' name='info' filepath='./sh-dis.c' line='384' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='aarch64-asm-2.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes' language='LANG_C99'>
    <function-decl name='aarch64_insert_operand' mangled-name='aarch64_insert_operand' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm-2.c' line='450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='aarch64_insert_operand'>
      <parameter type-id='type-id-396' name='self' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm-2.c' line='450' column='1'/>
      <parameter type-id='type-id-397' name='info' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm-2.c' line='451' column='1'/>
      <parameter type-id='type-id-398' name='code' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm-2.c' line='452' column='1'/>
      <parameter type-id='type-id-399' name='inst' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm-2.c' line='452' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='aarch64_find_real_opcode' mangled-name='aarch64_find_real_opcode' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm-2.c' line='26' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='aarch64_find_real_opcode'>
      <parameter type-id='type-id-400' name='opcode' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm-2.c' line='26' column='1'/>
      <return type-id='type-id-400'/>
    </function-decl>
    <pointer-type-def type-id='type-id-401' size-in-bits='64' id='type-id-398'/>
    <pointer-type-def type-id='type-id-402' size-in-bits='64' id='type-id-399'/>
    <pointer-type-def type-id='type-id-403' size-in-bits='64' id='type-id-400'/>
    <pointer-type-def type-id='type-id-404' size-in-bits='64' id='type-id-396'/>
    <pointer-type-def type-id='type-id-405' size-in-bits='64' id='type-id-397'/>
    <qualified-type-def type-id='type-id-406' const='yes' id='type-id-402'/>
    <qualified-type-def type-id='type-id-407' const='yes' id='type-id-403'/>
    <qualified-type-def type-id='type-id-408' const='yes' id='type-id-404'/>
    <qualified-type-def type-id='type-id-409' const='yes' id='type-id-405'/>
    <typedef-decl name='aarch64_insn' type-id='type-id-410' filepath='./../include/opcode/aarch64.h' line='37' column='1' id='type-id-401'/>
    <typedef-decl name='aarch64_inst' type-id='type-id-411' filepath='./../include/opcode/aarch64.h' line='846' column='1' id='type-id-406'/>
    <typedef-decl name='aarch64_opcode' type-id='type-id-412' filepath='./../include/opcode/aarch64.h' line='540' column='1' id='type-id-407'/>
    <typedef-decl name='aarch64_operand' type-id='type-id-413' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-opc.h' line='127' column='1' id='type-id-408'/>
    <typedef-decl name='aarch64_opnd_info' type-id='type-id-414' filepath='./../include/opcode/aarch64.h' line='819' column='1' id='type-id-409'/>
    <typedef-decl name='uint32_t' type-id='type-id-415' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-410'/>
    <class-decl name='aarch64_inst' size-in-bits='2496' is-struct='yes' visibility='default' filepath='./../include/opcode/aarch64.h' line='831' column='1' id='type-id-411'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-401' visibility='default' filepath='./../include/opcode/aarch64.h' line='834' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='opcode' type-id='type-id-400' visibility='default' filepath='./../include/opcode/aarch64.h' line='837' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cond' type-id='type-id-416' visibility='default' filepath='./../include/opcode/aarch64.h' line='840' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='operands' type-id='type-id-417' visibility='default' filepath='./../include/opcode/aarch64.h' line='843' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='aarch64_opcode' size-in-bits='960' is-struct='yes' visibility='default' filepath='./../include/opcode/aarch64.h' line='501' column='1' id='type-id-412'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-7' visibility='default' filepath='./../include/opcode/aarch64.h' line='504' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='opcode' type-id='type-id-401' visibility='default' filepath='./../include/opcode/aarch64.h' line='508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='mask' type-id='type-id-401' visibility='default' filepath='./../include/opcode/aarch64.h' line='514' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='iclass' type-id='type-id-418' visibility='default' filepath='./../include/opcode/aarch64.h' line='517' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='op' type-id='type-id-419' visibility='default' filepath='./../include/opcode/aarch64.h' line='520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avariant' type-id='type-id-420' visibility='default' filepath='./../include/opcode/aarch64.h' line='523' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='operands' type-id='type-id-421' visibility='default' filepath='./../include/opcode/aarch64.h' line='528' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='qualifiers_list' type-id='type-id-422' visibility='default' filepath='./../include/opcode/aarch64.h' line='534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='flags' type-id='type-id-410' visibility='default' filepath='./../include/opcode/aarch64.h' line='537' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='aarch64_operand' size-in-bits='384' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-opc.h' line='109' column='1' id='type-id-413'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op_class' type-id='type-id-423' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-opc.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-7' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-opc.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flags' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-opc.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='fields' type-id='type-id-424' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-opc.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='desc' type-id='type-id-7' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-opc.h' line='124' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='aarch64_opnd_info' size-in-bits='384' is-struct='yes' visibility='default' filepath='./../include/opcode/aarch64.h' line='734' column='1' id='type-id-414'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-425' visibility='default' filepath='./../include/opcode/aarch64.h' line='736' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='qualifier' type-id='type-id-426' visibility='default' filepath='./../include/opcode/aarch64.h' line='737' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='idx' type-id='type-id-5' visibility='default' filepath='./../include/opcode/aarch64.h' line='738' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='' type-id='type-id-427' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='shifter' type-id='type-id-428' visibility='default' filepath='./../include/opcode/aarch64.h' line='805' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='skip' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='807' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='present' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='815' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint32_t' type-id='type-id-4' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='41' column='1' id='type-id-415'/>
    <array-type-def dimensions='1' type-id='type-id-429' size-in-bits='128' alignment-in-bits='32' id='type-id-424'>
      <subrange length='4' type-id='type-id-49' id='type-id-324'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-425' size-in-bits='192' alignment-in-bits='32' id='type-id-421'>
      <subrange length='6' type-id='type-id-49' id='type-id-430'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-409' size-in-bits='2304' id='type-id-417'>
      <subrange length='6' type-id='type-id-49' id='type-id-430'/>
    </array-type-def>
    <array-type-def dimensions='2' type-id='type-id-426' size-in-bits='480' id='type-id-422'>
      <subrange length='10' type-id='type-id-49' id='type-id-431'/>
      <subrange length='6' type-id='type-id-49' id='type-id-430'/>
    </array-type-def>
    <class-decl name='__anonymous_struct__8' size-in-bits='96' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./../include/opcode/aarch64.h' line='798' column='1' id='type-id-428'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kind' type-id='type-id-432' visibility='default' filepath='./../include/opcode/aarch64.h' line='800' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='amount' type-id='type-id-5' visibility='default' filepath='./../include/opcode/aarch64.h' line='801' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='operator_present' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='802' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='amount_present' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='804' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-433' size-in-bits='64' id='type-id-416'/>
    <pointer-type-def type-id='type-id-434' size-in-bits='64' id='type-id-420'/>
    <enum-decl name='aarch64_insn_class' filepath='./../include/opcode/aarch64.h' line='314' column='1' id='type-id-418'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='addsub_carry' value='0'/>
      <enumerator name='addsub_ext' value='1'/>
      <enumerator name='addsub_imm' value='2'/>
      <enumerator name='addsub_shift' value='3'/>
      <enumerator name='asimdall' value='4'/>
      <enumerator name='asimddiff' value='5'/>
      <enumerator name='asimdelem' value='6'/>
      <enumerator name='asimdext' value='7'/>
      <enumerator name='asimdimm' value='8'/>
      <enumerator name='asimdins' value='9'/>
      <enumerator name='asimdmisc' value='10'/>
      <enumerator name='asimdperm' value='11'/>
      <enumerator name='asimdsame' value='12'/>
      <enumerator name='asimdshf' value='13'/>
      <enumerator name='asimdtbl' value='14'/>
      <enumerator name='asisddiff' value='15'/>
      <enumerator name='asisdelem' value='16'/>
      <enumerator name='asisdlse' value='17'/>
      <enumerator name='asisdlsep' value='18'/>
      <enumerator name='asisdlso' value='19'/>
      <enumerator name='asisdlsop' value='20'/>
      <enumerator name='asisdmisc' value='21'/>
      <enumerator name='asisdone' value='22'/>
      <enumerator name='asisdpair' value='23'/>
      <enumerator name='asisdsame' value='24'/>
      <enumerator name='asisdshf' value='25'/>
      <enumerator name='bitfield' value='26'/>
      <enumerator name='branch_imm' value='27'/>
      <enumerator name='branch_reg' value='28'/>
      <enumerator name='compbranch' value='29'/>
      <enumerator name='condbranch' value='30'/>
      <enumerator name='condcmp_imm' value='31'/>
      <enumerator name='condcmp_reg' value='32'/>
      <enumerator name='condsel' value='33'/>
      <enumerator name='cryptoaes' value='34'/>
      <enumerator name='cryptosha2' value='35'/>
      <enumerator name='cryptosha3' value='36'/>
      <enumerator name='dp_1src' value='37'/>
      <enumerator name='dp_2src' value='38'/>
      <enumerator name='dp_3src' value='39'/>
      <enumerator name='exception' value='40'/>
      <enumerator name='extract' value='41'/>
      <enumerator name='float2fix' value='42'/>
      <enumerator name='float2int' value='43'/>
      <enumerator name='floatccmp' value='44'/>
      <enumerator name='floatcmp' value='45'/>
      <enumerator name='floatdp1' value='46'/>
      <enumerator name='floatdp2' value='47'/>
      <enumerator name='floatdp3' value='48'/>
      <enumerator name='floatimm' value='49'/>
      <enumerator name='floatsel' value='50'/>
      <enumerator name='ldst_immpost' value='51'/>
      <enumerator name='ldst_immpre' value='52'/>
      <enumerator name='ldst_imm9' value='53'/>
      <enumerator name='ldst_pos' value='54'/>
      <enumerator name='ldst_regoff' value='55'/>
      <enumerator name='ldst_unpriv' value='56'/>
      <enumerator name='ldst_unscaled' value='57'/>
      <enumerator name='ldstexcl' value='58'/>
      <enumerator name='ldstnapair_offs' value='59'/>
      <enumerator name='ldstpair_off' value='60'/>
      <enumerator name='ldstpair_indexed' value='61'/>
      <enumerator name='loadlit' value='62'/>
      <enumerator name='log_imm' value='63'/>
      <enumerator name='log_shift' value='64'/>
      <enumerator name='lse_atomic' value='65'/>
      <enumerator name='movewide' value='66'/>
      <enumerator name='pcreladdr' value='67'/>
      <enumerator name='ic_system' value='68'/>
      <enumerator name='testbranch' value='69'/>
    </enum-decl>
    <enum-decl name='aarch64_op' filepath='./../include/opcode/aarch64.h' line='390' column='1' id='type-id-419'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='OP_NIL' value='0'/>
      <enumerator name='OP_STRB_POS' value='1'/>
      <enumerator name='OP_LDRB_POS' value='2'/>
      <enumerator name='OP_LDRSB_POS' value='3'/>
      <enumerator name='OP_STRH_POS' value='4'/>
      <enumerator name='OP_LDRH_POS' value='5'/>
      <enumerator name='OP_LDRSH_POS' value='6'/>
      <enumerator name='OP_STR_POS' value='7'/>
      <enumerator name='OP_LDR_POS' value='8'/>
      <enumerator name='OP_STRF_POS' value='9'/>
      <enumerator name='OP_LDRF_POS' value='10'/>
      <enumerator name='OP_LDRSW_POS' value='11'/>
      <enumerator name='OP_PRFM_POS' value='12'/>
      <enumerator name='OP_STURB' value='13'/>
      <enumerator name='OP_LDURB' value='14'/>
      <enumerator name='OP_LDURSB' value='15'/>
      <enumerator name='OP_STURH' value='16'/>
      <enumerator name='OP_LDURH' value='17'/>
      <enumerator name='OP_LDURSH' value='18'/>
      <enumerator name='OP_STUR' value='19'/>
      <enumerator name='OP_LDUR' value='20'/>
      <enumerator name='OP_STURV' value='21'/>
      <enumerator name='OP_LDURV' value='22'/>
      <enumerator name='OP_LDURSW' value='23'/>
      <enumerator name='OP_PRFUM' value='24'/>
      <enumerator name='OP_LDR_LIT' value='25'/>
      <enumerator name='OP_LDRV_LIT' value='26'/>
      <enumerator name='OP_LDRSW_LIT' value='27'/>
      <enumerator name='OP_PRFM_LIT' value='28'/>
      <enumerator name='OP_ADD' value='29'/>
      <enumerator name='OP_B' value='30'/>
      <enumerator name='OP_BL' value='31'/>
      <enumerator name='OP_MOVN' value='32'/>
      <enumerator name='OP_MOVZ' value='33'/>
      <enumerator name='OP_MOVK' value='34'/>
      <enumerator name='OP_MOV_IMM_LOG' value='35'/>
      <enumerator name='OP_MOV_IMM_WIDE' value='36'/>
      <enumerator name='OP_MOV_IMM_WIDEN' value='37'/>
      <enumerator name='OP_MOV_V' value='38'/>
      <enumerator name='OP_ASR_IMM' value='39'/>
      <enumerator name='OP_LSR_IMM' value='40'/>
      <enumerator name='OP_LSL_IMM' value='41'/>
      <enumerator name='OP_BIC' value='42'/>
      <enumerator name='OP_UBFX' value='43'/>
      <enumerator name='OP_BFXIL' value='44'/>
      <enumerator name='OP_SBFX' value='45'/>
      <enumerator name='OP_SBFIZ' value='46'/>
      <enumerator name='OP_BFI' value='47'/>
      <enumerator name='OP_BFC' value='48'/>
      <enumerator name='OP_UBFIZ' value='49'/>
      <enumerator name='OP_UXTB' value='50'/>
      <enumerator name='OP_UXTH' value='51'/>
      <enumerator name='OP_UXTW' value='52'/>
      <enumerator name='OP_CINC' value='53'/>
      <enumerator name='OP_CINV' value='54'/>
      <enumerator name='OP_CNEG' value='55'/>
      <enumerator name='OP_CSET' value='56'/>
      <enumerator name='OP_CSETM' value='57'/>
      <enumerator name='OP_FCVT' value='58'/>
      <enumerator name='OP_FCVTN' value='59'/>
      <enumerator name='OP_FCVTN2' value='60'/>
      <enumerator name='OP_FCVTL' value='61'/>
      <enumerator name='OP_FCVTL2' value='62'/>
      <enumerator name='OP_FCVTXN_S' value='63'/>
      <enumerator name='OP_ROR_IMM' value='64'/>
      <enumerator name='OP_SXTL' value='65'/>
      <enumerator name='OP_SXTL2' value='66'/>
      <enumerator name='OP_UXTL' value='67'/>
      <enumerator name='OP_UXTL2' value='68'/>
      <enumerator name='OP_TOTAL_NUM' value='69'/>
    </enum-decl>
    <enum-decl name='aarch64_operand_class' filepath='./../include/opcode/aarch64.h' line='109' column='1' id='type-id-423'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='AARCH64_OPND_CLASS_NIL' value='0'/>
      <enumerator name='AARCH64_OPND_CLASS_INT_REG' value='1'/>
      <enumerator name='AARCH64_OPND_CLASS_MODIFIED_REG' value='2'/>
      <enumerator name='AARCH64_OPND_CLASS_FP_REG' value='3'/>
      <enumerator name='AARCH64_OPND_CLASS_SIMD_REG' value='4'/>
      <enumerator name='AARCH64_OPND_CLASS_SIMD_ELEMENT' value='5'/>
      <enumerator name='AARCH64_OPND_CLASS_SISD_REG' value='6'/>
      <enumerator name='AARCH64_OPND_CLASS_SIMD_REGLIST' value='7'/>
      <enumerator name='AARCH64_OPND_CLASS_CP_REG' value='8'/>
      <enumerator name='AARCH64_OPND_CLASS_ADDRESS' value='9'/>
      <enumerator name='AARCH64_OPND_CLASS_IMMEDIATE' value='10'/>
      <enumerator name='AARCH64_OPND_CLASS_SYSTEM' value='11'/>
      <enumerator name='AARCH64_OPND_CLASS_COND' value='12'/>
    </enum-decl>
    <enum-decl name='aarch64_opnd' filepath='./../include/opcode/aarch64.h' line='129' column='1' id='type-id-425'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='AARCH64_OPND_NIL' value='0'/>
      <enumerator name='AARCH64_OPND_Rd' value='1'/>
      <enumerator name='AARCH64_OPND_Rn' value='2'/>
      <enumerator name='AARCH64_OPND_Rm' value='3'/>
      <enumerator name='AARCH64_OPND_Rt' value='4'/>
      <enumerator name='AARCH64_OPND_Rt2' value='5'/>
      <enumerator name='AARCH64_OPND_Rs' value='6'/>
      <enumerator name='AARCH64_OPND_Ra' value='7'/>
      <enumerator name='AARCH64_OPND_Rt_SYS' value='8'/>
      <enumerator name='AARCH64_OPND_Rd_SP' value='9'/>
      <enumerator name='AARCH64_OPND_Rn_SP' value='10'/>
      <enumerator name='AARCH64_OPND_PAIRREG' value='11'/>
      <enumerator name='AARCH64_OPND_Rm_EXT' value='12'/>
      <enumerator name='AARCH64_OPND_Rm_SFT' value='13'/>
      <enumerator name='AARCH64_OPND_Fd' value='14'/>
      <enumerator name='AARCH64_OPND_Fn' value='15'/>
      <enumerator name='AARCH64_OPND_Fm' value='16'/>
      <enumerator name='AARCH64_OPND_Fa' value='17'/>
      <enumerator name='AARCH64_OPND_Ft' value='18'/>
      <enumerator name='AARCH64_OPND_Ft2' value='19'/>
      <enumerator name='AARCH64_OPND_Sd' value='20'/>
      <enumerator name='AARCH64_OPND_Sn' value='21'/>
      <enumerator name='AARCH64_OPND_Sm' value='22'/>
      <enumerator name='AARCH64_OPND_Vd' value='23'/>
      <enumerator name='AARCH64_OPND_Vn' value='24'/>
      <enumerator name='AARCH64_OPND_Vm' value='25'/>
      <enumerator name='AARCH64_OPND_VdD1' value='26'/>
      <enumerator name='AARCH64_OPND_VnD1' value='27'/>
      <enumerator name='AARCH64_OPND_Ed' value='28'/>
      <enumerator name='AARCH64_OPND_En' value='29'/>
      <enumerator name='AARCH64_OPND_Em' value='30'/>
      <enumerator name='AARCH64_OPND_LVn' value='31'/>
      <enumerator name='AARCH64_OPND_LVt' value='32'/>
      <enumerator name='AARCH64_OPND_LVt_AL' value='33'/>
      <enumerator name='AARCH64_OPND_LEt' value='34'/>
      <enumerator name='AARCH64_OPND_Cn' value='35'/>
      <enumerator name='AARCH64_OPND_Cm' value='36'/>
      <enumerator name='AARCH64_OPND_IDX' value='37'/>
      <enumerator name='AARCH64_OPND_IMM_VLSL' value='38'/>
      <enumerator name='AARCH64_OPND_IMM_VLSR' value='39'/>
      <enumerator name='AARCH64_OPND_SIMD_IMM' value='40'/>
      <enumerator name='AARCH64_OPND_SIMD_IMM_SFT' value='41'/>
      <enumerator name='AARCH64_OPND_SIMD_FPIMM' value='42'/>
      <enumerator name='AARCH64_OPND_SHLL_IMM' value='43'/>
      <enumerator name='AARCH64_OPND_IMM0' value='44'/>
      <enumerator name='AARCH64_OPND_FPIMM0' value='45'/>
      <enumerator name='AARCH64_OPND_FPIMM' value='46'/>
      <enumerator name='AARCH64_OPND_IMMR' value='47'/>
      <enumerator name='AARCH64_OPND_IMMS' value='48'/>
      <enumerator name='AARCH64_OPND_WIDTH' value='49'/>
      <enumerator name='AARCH64_OPND_IMM' value='50'/>
      <enumerator name='AARCH64_OPND_UIMM3_OP1' value='51'/>
      <enumerator name='AARCH64_OPND_UIMM3_OP2' value='52'/>
      <enumerator name='AARCH64_OPND_UIMM4' value='53'/>
      <enumerator name='AARCH64_OPND_UIMM7' value='54'/>
      <enumerator name='AARCH64_OPND_BIT_NUM' value='55'/>
      <enumerator name='AARCH64_OPND_EXCEPTION' value='56'/>
      <enumerator name='AARCH64_OPND_CCMP_IMM' value='57'/>
      <enumerator name='AARCH64_OPND_NZCV' value='58'/>
      <enumerator name='AARCH64_OPND_LIMM' value='59'/>
      <enumerator name='AARCH64_OPND_AIMM' value='60'/>
      <enumerator name='AARCH64_OPND_HALF' value='61'/>
      <enumerator name='AARCH64_OPND_FBITS' value='62'/>
      <enumerator name='AARCH64_OPND_IMM_MOV' value='63'/>
      <enumerator name='AARCH64_OPND_COND' value='64'/>
      <enumerator name='AARCH64_OPND_COND1' value='65'/>
      <enumerator name='AARCH64_OPND_ADDR_ADRP' value='66'/>
      <enumerator name='AARCH64_OPND_ADDR_PCREL14' value='67'/>
      <enumerator name='AARCH64_OPND_ADDR_PCREL19' value='68'/>
      <enumerator name='AARCH64_OPND_ADDR_PCREL21' value='69'/>
      <enumerator name='AARCH64_OPND_ADDR_PCREL26' value='70'/>
      <enumerator name='AARCH64_OPND_ADDR_SIMPLE' value='71'/>
      <enumerator name='AARCH64_OPND_ADDR_REGOFF' value='72'/>
      <enumerator name='AARCH64_OPND_ADDR_SIMM7' value='73'/>
      <enumerator name='AARCH64_OPND_ADDR_SIMM9' value='74'/>
      <enumerator name='AARCH64_OPND_ADDR_SIMM9_2' value='75'/>
      <enumerator name='AARCH64_OPND_ADDR_UIMM12' value='76'/>
      <enumerator name='AARCH64_OPND_SIMD_ADDR_SIMPLE' value='77'/>
      <enumerator name='AARCH64_OPND_SIMD_ADDR_POST' value='78'/>
      <enumerator name='AARCH64_OPND_SYSREG' value='79'/>
      <enumerator name='AARCH64_OPND_PSTATEFIELD' value='80'/>
      <enumerator name='AARCH64_OPND_SYSREG_AT' value='81'/>
      <enumerator name='AARCH64_OPND_SYSREG_DC' value='82'/>
      <enumerator name='AARCH64_OPND_SYSREG_IC' value='83'/>
      <enumerator name='AARCH64_OPND_SYSREG_TLBI' value='84'/>
      <enumerator name='AARCH64_OPND_BARRIER' value='85'/>
      <enumerator name='AARCH64_OPND_BARRIER_ISB' value='86'/>
      <enumerator name='AARCH64_OPND_PRFOP' value='87'/>
      <enumerator name='AARCH64_OPND_BARRIER_PSB' value='88'/>
    </enum-decl>
    <typedef-decl name='aarch64_opnd_qualifier_t' type-id='type-id-66' filepath='./../include/opcode/aarch64.h' line='483' column='1' id='type-id-426'/>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='./../include/opcode/aarch64.h' line='740' column='1' id='type-id-427'>
      <data-member access='private'>
        <var-decl name='reg' type-id='type-id-435' visibility='default' filepath='./../include/opcode/aarch64.h' line='745' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='reglane' type-id='type-id-436' visibility='default' filepath='./../include/opcode/aarch64.h' line='750' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='reglist' type-id='type-id-437' visibility='default' filepath='./../include/opcode/aarch64.h' line='760' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='imm' type-id='type-id-438' visibility='default' filepath='./../include/opcode/aarch64.h' line='766' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='addr' type-id='type-id-439' visibility='default' filepath='./../include/opcode/aarch64.h' line='784' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='cond' type-id='type-id-416' visibility='default' filepath='./../include/opcode/aarch64.h' line='785' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sysreg' type-id='type-id-401' visibility='default' filepath='./../include/opcode/aarch64.h' line='787' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pstatefield' type-id='type-id-401' visibility='default' filepath='./../include/opcode/aarch64.h' line='789' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sysins_op' type-id='type-id-440' visibility='default' filepath='./../include/opcode/aarch64.h' line='790' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='barrier' type-id='type-id-441' visibility='default' filepath='./../include/opcode/aarch64.h' line='791' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='hint_option' type-id='type-id-441' visibility='default' filepath='./../include/opcode/aarch64.h' line='792' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='prfop' type-id='type-id-441' visibility='default' filepath='./../include/opcode/aarch64.h' line='793' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./../include/opcode/aarch64.h' line='762' column='1' id='type-id-438'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-442' visibility='default' filepath='./../include/opcode/aarch64.h' line='764' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='is_fp' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='765' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./../include/opcode/aarch64.h' line='768' column='1' id='type-id-439'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='base_regno' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='770' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='offset' type-id='type-id-443' visibility='default' filepath='./../include/opcode/aarch64.h' line='779' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='pcrel' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='780' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='writeback' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='781' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='preind' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='782' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='postind' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='783' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./../include/opcode/aarch64.h' line='752' column='1' id='type-id-437'>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='first_regno' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='754' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='num_regs' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='755' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23'>
        <var-decl name='has_index' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='757' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='index' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='759' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./../include/opcode/aarch64.h' line='746' column='1' id='type-id-436'>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='regno' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='748' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23'>
        <var-decl name='index' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='749' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./../include/opcode/aarch64.h' line='742' column='1' id='type-id-435'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='regno' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='744' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-444' const='yes' id='type-id-433'/>
    <qualified-type-def type-id='type-id-445' const='yes' id='type-id-434'/>
    <pointer-type-def type-id='type-id-446' size-in-bits='64' id='type-id-441'/>
    <pointer-type-def type-id='type-id-447' size-in-bits='64' id='type-id-440'/>
    <enum-decl name='aarch64_field_kind' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-opc.h' line='29' column='1' id='type-id-429'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='FLD_NIL' value='0'/>
      <enumerator name='FLD_cond2' value='1'/>
      <enumerator name='FLD_nzcv' value='2'/>
      <enumerator name='FLD_defgh' value='3'/>
      <enumerator name='FLD_abc' value='4'/>
      <enumerator name='FLD_imm19' value='5'/>
      <enumerator name='FLD_immhi' value='6'/>
      <enumerator name='FLD_immlo' value='7'/>
      <enumerator name='FLD_size' value='8'/>
      <enumerator name='FLD_vldst_size' value='9'/>
      <enumerator name='FLD_op' value='10'/>
      <enumerator name='FLD_Q' value='11'/>
      <enumerator name='FLD_Rt' value='12'/>
      <enumerator name='FLD_Rd' value='13'/>
      <enumerator name='FLD_Rn' value='14'/>
      <enumerator name='FLD_Rt2' value='15'/>
      <enumerator name='FLD_Ra' value='16'/>
      <enumerator name='FLD_op2' value='17'/>
      <enumerator name='FLD_CRm' value='18'/>
      <enumerator name='FLD_CRn' value='19'/>
      <enumerator name='FLD_op1' value='20'/>
      <enumerator name='FLD_op0' value='21'/>
      <enumerator name='FLD_imm3' value='22'/>
      <enumerator name='FLD_cond' value='23'/>
      <enumerator name='FLD_opcode' value='24'/>
      <enumerator name='FLD_cmode' value='25'/>
      <enumerator name='FLD_asisdlso_opcode' value='26'/>
      <enumerator name='FLD_len' value='27'/>
      <enumerator name='FLD_Rm' value='28'/>
      <enumerator name='FLD_Rs' value='29'/>
      <enumerator name='FLD_option' value='30'/>
      <enumerator name='FLD_S' value='31'/>
      <enumerator name='FLD_hw' value='32'/>
      <enumerator name='FLD_opc' value='33'/>
      <enumerator name='FLD_opc1' value='34'/>
      <enumerator name='FLD_shift' value='35'/>
      <enumerator name='FLD_type' value='36'/>
      <enumerator name='FLD_ldst_size' value='37'/>
      <enumerator name='FLD_imm6' value='38'/>
      <enumerator name='FLD_imm4' value='39'/>
      <enumerator name='FLD_imm5' value='40'/>
      <enumerator name='FLD_imm7' value='41'/>
      <enumerator name='FLD_imm8' value='42'/>
      <enumerator name='FLD_imm9' value='43'/>
      <enumerator name='FLD_imm12' value='44'/>
      <enumerator name='FLD_imm14' value='45'/>
      <enumerator name='FLD_imm16' value='46'/>
      <enumerator name='FLD_imm26' value='47'/>
      <enumerator name='FLD_imms' value='48'/>
      <enumerator name='FLD_immr' value='49'/>
      <enumerator name='FLD_immb' value='50'/>
      <enumerator name='FLD_immh' value='51'/>
      <enumerator name='FLD_N' value='52'/>
      <enumerator name='FLD_index' value='53'/>
      <enumerator name='FLD_index2' value='54'/>
      <enumerator name='FLD_sf' value='55'/>
      <enumerator name='FLD_lse_sz' value='56'/>
      <enumerator name='FLD_H' value='57'/>
      <enumerator name='FLD_L' value='58'/>
      <enumerator name='FLD_M' value='59'/>
      <enumerator name='FLD_b5' value='60'/>
      <enumerator name='FLD_b40' value='61'/>
      <enumerator name='FLD_scale' value='62'/>
    </enum-decl>
    <enum-decl name='aarch64_modifier_kind' filepath='./../include/opcode/aarch64.h' line='694' column='1' id='type-id-432'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='AARCH64_MOD_NONE' value='0'/>
      <enumerator name='AARCH64_MOD_MSL' value='1'/>
      <enumerator name='AARCH64_MOD_ROR' value='2'/>
      <enumerator name='AARCH64_MOD_ASR' value='3'/>
      <enumerator name='AARCH64_MOD_LSR' value='4'/>
      <enumerator name='AARCH64_MOD_LSL' value='5'/>
      <enumerator name='AARCH64_MOD_UXTB' value='6'/>
      <enumerator name='AARCH64_MOD_UXTH' value='7'/>
      <enumerator name='AARCH64_MOD_UXTW' value='8'/>
      <enumerator name='AARCH64_MOD_UXTX' value='9'/>
      <enumerator name='AARCH64_MOD_SXTB' value='10'/>
      <enumerator name='AARCH64_MOD_SXTH' value='11'/>
      <enumerator name='AARCH64_MOD_SXTW' value='12'/>
      <enumerator name='AARCH64_MOD_SXTX' value='13'/>
    </enum-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./../include/opcode/aarch64.h' line='771' column='1' id='type-id-443'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-448' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='is_reg' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='778' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-449' const='yes' id='type-id-446'/>
    <qualified-type-def type-id='type-id-450' const='yes' id='type-id-447'/>
    <typedef-decl name='aarch64_cond' type-id='type-id-451' filepath='./../include/opcode/aarch64.h' line='725' column='1' id='type-id-444'/>
    <typedef-decl name='aarch64_feature_set' type-id='type-id-49' filepath='./../include/opcode/aarch64.h' line='85' column='1' id='type-id-445'/>
    <typedef-decl name='int64_t' type-id='type-id-452' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='27' column='1' id='type-id-442'/>
    <class-decl name='aarch64_name_value_pair' size-in-bits='128' is-struct='yes' visibility='default' filepath='./../include/opcode/aarch64.h' line='649' column='1' id='type-id-449'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-7' visibility='default' filepath='./../include/opcode/aarch64.h' line='651' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value' type-id='type-id-401' visibility='default' filepath='./../include/opcode/aarch64.h' line='652' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='256' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-444' visibility='default' filepath='./../include/opcode/aarch64.h' line='719' column='1' id='type-id-451'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='names' type-id='type-id-453' visibility='default' filepath='./../include/opcode/aarch64.h' line='723' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='value' type-id='type-id-401' visibility='default' filepath='./../include/opcode/aarch64.h' line='724' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int64_t' type-id='type-id-89' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='43' column='1' id='type-id-452'/>
    <typedef-decl name='aarch64_sys_ins_reg' type-id='type-id-454' filepath='./../include/opcode/aarch64.h' line='680' column='1' id='type-id-450'/>
    <union-decl name='__anonymous_union__1' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='./../include/opcode/aarch64.h' line='773' column='1' id='type-id-448'>
      <data-member access='private'>
        <var-decl name='imm' type-id='type-id-5' visibility='default' filepath='./../include/opcode/aarch64.h' line='775' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='regno' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='776' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-450' visibility='default' filepath='./../include/opcode/aarch64.h' line='675' column='1' id='type-id-454'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-7' visibility='default' filepath='./../include/opcode/aarch64.h' line='677' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value' type-id='type-id-410' visibility='default' filepath='./../include/opcode/aarch64.h' line='678' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='flags' type-id='type-id-410' visibility='default' filepath='./../include/opcode/aarch64.h' line='679' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-7' size-in-bits='192' id='type-id-453'>
      <subrange length='3' type-id='type-id-49' id='type-id-455'/>
    </array-type-def>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='aarch64-asm.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-429' size-in-bits='128' alignment-in-bits='32' id='type-id-424'>
      <subrange length='4' type-id='type-id-49' id='type-id-324'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-425' size-in-bits='192' alignment-in-bits='32' id='type-id-421'>
      <subrange length='6' type-id='type-id-49' id='type-id-430'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-409' size-in-bits='2304' id='type-id-417'>
      <subrange length='6' type-id='type-id-49' id='type-id-430'/>
    </array-type-def>
    <array-type-def dimensions='2' type-id='type-id-426' size-in-bits='480' id='type-id-422'>
      <subrange length='10' type-id='type-id-49' id='type-id-431'/>
      <subrange length='6' type-id='type-id-49' id='type-id-430'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-7' size-in-bits='192' id='type-id-453'>
      <subrange length='3' type-id='type-id-49' id='type-id-455'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='96' id='type-id-456'>
      <subrange length='3' type-id='type-id-49' id='type-id-455'/>
    </array-type-def>
    <typedef-decl name='aarch64_opcode' type-id='type-id-412' filepath='./../include/opcode/aarch64.h' line='540' column='1' id='type-id-407'/>
    <class-decl name='aarch64_opcode' size-in-bits='960' is-struct='yes' visibility='default' filepath='./../include/opcode/aarch64.h' line='501' column='1' id='type-id-412'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-7' visibility='default' filepath='./../include/opcode/aarch64.h' line='504' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='opcode' type-id='type-id-401' visibility='default' filepath='./../include/opcode/aarch64.h' line='508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='mask' type-id='type-id-401' visibility='default' filepath='./../include/opcode/aarch64.h' line='514' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='iclass' type-id='type-id-418' visibility='default' filepath='./../include/opcode/aarch64.h' line='517' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='op' type-id='type-id-419' visibility='default' filepath='./../include/opcode/aarch64.h' line='520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avariant' type-id='type-id-420' visibility='default' filepath='./../include/opcode/aarch64.h' line='523' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='operands' type-id='type-id-421' visibility='default' filepath='./../include/opcode/aarch64.h' line='528' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='qualifiers_list' type-id='type-id-422' visibility='default' filepath='./../include/opcode/aarch64.h' line='534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='flags' type-id='type-id-410' visibility='default' filepath='./../include/opcode/aarch64.h' line='537' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='aarch64_insn' type-id='type-id-410' filepath='./../include/opcode/aarch64.h' line='37' column='1' id='type-id-401'/>
    <typedef-decl name='uint32_t' type-id='type-id-415' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-410'/>
    <typedef-decl name='__uint32_t' type-id='type-id-4' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='41' column='1' id='type-id-415'/>
    <enum-decl name='aarch64_insn_class' filepath='./../include/opcode/aarch64.h' line='314' column='1' id='type-id-418'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='addsub_carry' value='0'/>
      <enumerator name='addsub_ext' value='1'/>
      <enumerator name='addsub_imm' value='2'/>
      <enumerator name='addsub_shift' value='3'/>
      <enumerator name='asimdall' value='4'/>
      <enumerator name='asimddiff' value='5'/>
      <enumerator name='asimdelem' value='6'/>
      <enumerator name='asimdext' value='7'/>
      <enumerator name='asimdimm' value='8'/>
      <enumerator name='asimdins' value='9'/>
      <enumerator name='asimdmisc' value='10'/>
      <enumerator name='asimdperm' value='11'/>
      <enumerator name='asimdsame' value='12'/>
      <enumerator name='asimdshf' value='13'/>
      <enumerator name='asimdtbl' value='14'/>
      <enumerator name='asisddiff' value='15'/>
      <enumerator name='asisdelem' value='16'/>
      <enumerator name='asisdlse' value='17'/>
      <enumerator name='asisdlsep' value='18'/>
      <enumerator name='asisdlso' value='19'/>
      <enumerator name='asisdlsop' value='20'/>
      <enumerator name='asisdmisc' value='21'/>
      <enumerator name='asisdone' value='22'/>
      <enumerator name='asisdpair' value='23'/>
      <enumerator name='asisdsame' value='24'/>
      <enumerator name='asisdshf' value='25'/>
      <enumerator name='bitfield' value='26'/>
      <enumerator name='branch_imm' value='27'/>
      <enumerator name='branch_reg' value='28'/>
      <enumerator name='compbranch' value='29'/>
      <enumerator name='condbranch' value='30'/>
      <enumerator name='condcmp_imm' value='31'/>
      <enumerator name='condcmp_reg' value='32'/>
      <enumerator name='condsel' value='33'/>
      <enumerator name='cryptoaes' value='34'/>
      <enumerator name='cryptosha2' value='35'/>
      <enumerator name='cryptosha3' value='36'/>
      <enumerator name='dp_1src' value='37'/>
      <enumerator name='dp_2src' value='38'/>
      <enumerator name='dp_3src' value='39'/>
      <enumerator name='exception' value='40'/>
      <enumerator name='extract' value='41'/>
      <enumerator name='float2fix' value='42'/>
      <enumerator name='float2int' value='43'/>
      <enumerator name='floatccmp' value='44'/>
      <enumerator name='floatcmp' value='45'/>
      <enumerator name='floatdp1' value='46'/>
      <enumerator name='floatdp2' value='47'/>
      <enumerator name='floatdp3' value='48'/>
      <enumerator name='floatimm' value='49'/>
      <enumerator name='floatsel' value='50'/>
      <enumerator name='ldst_immpost' value='51'/>
      <enumerator name='ldst_immpre' value='52'/>
      <enumerator name='ldst_imm9' value='53'/>
      <enumerator name='ldst_pos' value='54'/>
      <enumerator name='ldst_regoff' value='55'/>
      <enumerator name='ldst_unpriv' value='56'/>
      <enumerator name='ldst_unscaled' value='57'/>
      <enumerator name='ldstexcl' value='58'/>
      <enumerator name='ldstnapair_offs' value='59'/>
      <enumerator name='ldstpair_off' value='60'/>
      <enumerator name='ldstpair_indexed' value='61'/>
      <enumerator name='loadlit' value='62'/>
      <enumerator name='log_imm' value='63'/>
      <enumerator name='log_shift' value='64'/>
      <enumerator name='lse_atomic' value='65'/>
      <enumerator name='movewide' value='66'/>
      <enumerator name='pcreladdr' value='67'/>
      <enumerator name='ic_system' value='68'/>
      <enumerator name='testbranch' value='69'/>
    </enum-decl>
    <enum-decl name='aarch64_op' filepath='./../include/opcode/aarch64.h' line='390' column='1' id='type-id-419'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='OP_NIL' value='0'/>
      <enumerator name='OP_STRB_POS' value='1'/>
      <enumerator name='OP_LDRB_POS' value='2'/>
      <enumerator name='OP_LDRSB_POS' value='3'/>
      <enumerator name='OP_STRH_POS' value='4'/>
      <enumerator name='OP_LDRH_POS' value='5'/>
      <enumerator name='OP_LDRSH_POS' value='6'/>
      <enumerator name='OP_STR_POS' value='7'/>
      <enumerator name='OP_LDR_POS' value='8'/>
      <enumerator name='OP_STRF_POS' value='9'/>
      <enumerator name='OP_LDRF_POS' value='10'/>
      <enumerator name='OP_LDRSW_POS' value='11'/>
      <enumerator name='OP_PRFM_POS' value='12'/>
      <enumerator name='OP_STURB' value='13'/>
      <enumerator name='OP_LDURB' value='14'/>
      <enumerator name='OP_LDURSB' value='15'/>
      <enumerator name='OP_STURH' value='16'/>
      <enumerator name='OP_LDURH' value='17'/>
      <enumerator name='OP_LDURSH' value='18'/>
      <enumerator name='OP_STUR' value='19'/>
      <enumerator name='OP_LDUR' value='20'/>
      <enumerator name='OP_STURV' value='21'/>
      <enumerator name='OP_LDURV' value='22'/>
      <enumerator name='OP_LDURSW' value='23'/>
      <enumerator name='OP_PRFUM' value='24'/>
      <enumerator name='OP_LDR_LIT' value='25'/>
      <enumerator name='OP_LDRV_LIT' value='26'/>
      <enumerator name='OP_LDRSW_LIT' value='27'/>
      <enumerator name='OP_PRFM_LIT' value='28'/>
      <enumerator name='OP_ADD' value='29'/>
      <enumerator name='OP_B' value='30'/>
      <enumerator name='OP_BL' value='31'/>
      <enumerator name='OP_MOVN' value='32'/>
      <enumerator name='OP_MOVZ' value='33'/>
      <enumerator name='OP_MOVK' value='34'/>
      <enumerator name='OP_MOV_IMM_LOG' value='35'/>
      <enumerator name='OP_MOV_IMM_WIDE' value='36'/>
      <enumerator name='OP_MOV_IMM_WIDEN' value='37'/>
      <enumerator name='OP_MOV_V' value='38'/>
      <enumerator name='OP_ASR_IMM' value='39'/>
      <enumerator name='OP_LSR_IMM' value='40'/>
      <enumerator name='OP_LSL_IMM' value='41'/>
      <enumerator name='OP_BIC' value='42'/>
      <enumerator name='OP_UBFX' value='43'/>
      <enumerator name='OP_BFXIL' value='44'/>
      <enumerator name='OP_SBFX' value='45'/>
      <enumerator name='OP_SBFIZ' value='46'/>
      <enumerator name='OP_BFI' value='47'/>
      <enumerator name='OP_BFC' value='48'/>
      <enumerator name='OP_UBFIZ' value='49'/>
      <enumerator name='OP_UXTB' value='50'/>
      <enumerator name='OP_UXTH' value='51'/>
      <enumerator name='OP_UXTW' value='52'/>
      <enumerator name='OP_CINC' value='53'/>
      <enumerator name='OP_CINV' value='54'/>
      <enumerator name='OP_CNEG' value='55'/>
      <enumerator name='OP_CSET' value='56'/>
      <enumerator name='OP_CSETM' value='57'/>
      <enumerator name='OP_FCVT' value='58'/>
      <enumerator name='OP_FCVTN' value='59'/>
      <enumerator name='OP_FCVTN2' value='60'/>
      <enumerator name='OP_FCVTL' value='61'/>
      <enumerator name='OP_FCVTL2' value='62'/>
      <enumerator name='OP_FCVTXN_S' value='63'/>
      <enumerator name='OP_ROR_IMM' value='64'/>
      <enumerator name='OP_SXTL' value='65'/>
      <enumerator name='OP_SXTL2' value='66'/>
      <enumerator name='OP_UXTL' value='67'/>
      <enumerator name='OP_UXTL2' value='68'/>
      <enumerator name='OP_TOTAL_NUM' value='69'/>
    </enum-decl>
    <typedef-decl name='aarch64_feature_set' type-id='type-id-49' filepath='./../include/opcode/aarch64.h' line='85' column='1' id='type-id-445'/>
    <enum-decl name='aarch64_opnd' filepath='./../include/opcode/aarch64.h' line='129' column='1' id='type-id-425'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='AARCH64_OPND_NIL' value='0'/>
      <enumerator name='AARCH64_OPND_Rd' value='1'/>
      <enumerator name='AARCH64_OPND_Rn' value='2'/>
      <enumerator name='AARCH64_OPND_Rm' value='3'/>
      <enumerator name='AARCH64_OPND_Rt' value='4'/>
      <enumerator name='AARCH64_OPND_Rt2' value='5'/>
      <enumerator name='AARCH64_OPND_Rs' value='6'/>
      <enumerator name='AARCH64_OPND_Ra' value='7'/>
      <enumerator name='AARCH64_OPND_Rt_SYS' value='8'/>
      <enumerator name='AARCH64_OPND_Rd_SP' value='9'/>
      <enumerator name='AARCH64_OPND_Rn_SP' value='10'/>
      <enumerator name='AARCH64_OPND_PAIRREG' value='11'/>
      <enumerator name='AARCH64_OPND_Rm_EXT' value='12'/>
      <enumerator name='AARCH64_OPND_Rm_SFT' value='13'/>
      <enumerator name='AARCH64_OPND_Fd' value='14'/>
      <enumerator name='AARCH64_OPND_Fn' value='15'/>
      <enumerator name='AARCH64_OPND_Fm' value='16'/>
      <enumerator name='AARCH64_OPND_Fa' value='17'/>
      <enumerator name='AARCH64_OPND_Ft' value='18'/>
      <enumerator name='AARCH64_OPND_Ft2' value='19'/>
      <enumerator name='AARCH64_OPND_Sd' value='20'/>
      <enumerator name='AARCH64_OPND_Sn' value='21'/>
      <enumerator name='AARCH64_OPND_Sm' value='22'/>
      <enumerator name='AARCH64_OPND_Vd' value='23'/>
      <enumerator name='AARCH64_OPND_Vn' value='24'/>
      <enumerator name='AARCH64_OPND_Vm' value='25'/>
      <enumerator name='AARCH64_OPND_VdD1' value='26'/>
      <enumerator name='AARCH64_OPND_VnD1' value='27'/>
      <enumerator name='AARCH64_OPND_Ed' value='28'/>
      <enumerator name='AARCH64_OPND_En' value='29'/>
      <enumerator name='AARCH64_OPND_Em' value='30'/>
      <enumerator name='AARCH64_OPND_LVn' value='31'/>
      <enumerator name='AARCH64_OPND_LVt' value='32'/>
      <enumerator name='AARCH64_OPND_LVt_AL' value='33'/>
      <enumerator name='AARCH64_OPND_LEt' value='34'/>
      <enumerator name='AARCH64_OPND_Cn' value='35'/>
      <enumerator name='AARCH64_OPND_Cm' value='36'/>
      <enumerator name='AARCH64_OPND_IDX' value='37'/>
      <enumerator name='AARCH64_OPND_IMM_VLSL' value='38'/>
      <enumerator name='AARCH64_OPND_IMM_VLSR' value='39'/>
      <enumerator name='AARCH64_OPND_SIMD_IMM' value='40'/>
      <enumerator name='AARCH64_OPND_SIMD_IMM_SFT' value='41'/>
      <enumerator name='AARCH64_OPND_SIMD_FPIMM' value='42'/>
      <enumerator name='AARCH64_OPND_SHLL_IMM' value='43'/>
      <enumerator name='AARCH64_OPND_IMM0' value='44'/>
      <enumerator name='AARCH64_OPND_FPIMM0' value='45'/>
      <enumerator name='AARCH64_OPND_FPIMM' value='46'/>
      <enumerator name='AARCH64_OPND_IMMR' value='47'/>
      <enumerator name='AARCH64_OPND_IMMS' value='48'/>
      <enumerator name='AARCH64_OPND_WIDTH' value='49'/>
      <enumerator name='AARCH64_OPND_IMM' value='50'/>
      <enumerator name='AARCH64_OPND_UIMM3_OP1' value='51'/>
      <enumerator name='AARCH64_OPND_UIMM3_OP2' value='52'/>
      <enumerator name='AARCH64_OPND_UIMM4' value='53'/>
      <enumerator name='AARCH64_OPND_UIMM7' value='54'/>
      <enumerator name='AARCH64_OPND_BIT_NUM' value='55'/>
      <enumerator name='AARCH64_OPND_EXCEPTION' value='56'/>
      <enumerator name='AARCH64_OPND_CCMP_IMM' value='57'/>
      <enumerator name='AARCH64_OPND_NZCV' value='58'/>
      <enumerator name='AARCH64_OPND_LIMM' value='59'/>
      <enumerator name='AARCH64_OPND_AIMM' value='60'/>
      <enumerator name='AARCH64_OPND_HALF' value='61'/>
      <enumerator name='AARCH64_OPND_FBITS' value='62'/>
      <enumerator name='AARCH64_OPND_IMM_MOV' value='63'/>
      <enumerator name='AARCH64_OPND_COND' value='64'/>
      <enumerator name='AARCH64_OPND_COND1' value='65'/>
      <enumerator name='AARCH64_OPND_ADDR_ADRP' value='66'/>
      <enumerator name='AARCH64_OPND_ADDR_PCREL14' value='67'/>
      <enumerator name='AARCH64_OPND_ADDR_PCREL19' value='68'/>
      <enumerator name='AARCH64_OPND_ADDR_PCREL21' value='69'/>
      <enumerator name='AARCH64_OPND_ADDR_PCREL26' value='70'/>
      <enumerator name='AARCH64_OPND_ADDR_SIMPLE' value='71'/>
      <enumerator name='AARCH64_OPND_ADDR_REGOFF' value='72'/>
      <enumerator name='AARCH64_OPND_ADDR_SIMM7' value='73'/>
      <enumerator name='AARCH64_OPND_ADDR_SIMM9' value='74'/>
      <enumerator name='AARCH64_OPND_ADDR_SIMM9_2' value='75'/>
      <enumerator name='AARCH64_OPND_ADDR_UIMM12' value='76'/>
      <enumerator name='AARCH64_OPND_SIMD_ADDR_SIMPLE' value='77'/>
      <enumerator name='AARCH64_OPND_SIMD_ADDR_POST' value='78'/>
      <enumerator name='AARCH64_OPND_SYSREG' value='79'/>
      <enumerator name='AARCH64_OPND_PSTATEFIELD' value='80'/>
      <enumerator name='AARCH64_OPND_SYSREG_AT' value='81'/>
      <enumerator name='AARCH64_OPND_SYSREG_DC' value='82'/>
      <enumerator name='AARCH64_OPND_SYSREG_IC' value='83'/>
      <enumerator name='AARCH64_OPND_SYSREG_TLBI' value='84'/>
      <enumerator name='AARCH64_OPND_BARRIER' value='85'/>
      <enumerator name='AARCH64_OPND_BARRIER_ISB' value='86'/>
      <enumerator name='AARCH64_OPND_PRFOP' value='87'/>
      <enumerator name='AARCH64_OPND_BARRIER_PSB' value='88'/>
    </enum-decl>
    <typedef-decl name='aarch64_opnd_qualifier_t' type-id='type-id-66' filepath='./../include/opcode/aarch64.h' line='483' column='1' id='type-id-426'/>
    <typedef-decl name='aarch64_inst' type-id='type-id-411' filepath='./../include/opcode/aarch64.h' line='846' column='1' id='type-id-406'/>
    <class-decl name='aarch64_inst' size-in-bits='2496' is-struct='yes' visibility='default' filepath='./../include/opcode/aarch64.h' line='831' column='1' id='type-id-411'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-401' visibility='default' filepath='./../include/opcode/aarch64.h' line='834' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='opcode' type-id='type-id-400' visibility='default' filepath='./../include/opcode/aarch64.h' line='837' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cond' type-id='type-id-416' visibility='default' filepath='./../include/opcode/aarch64.h' line='840' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='operands' type-id='type-id-417' visibility='default' filepath='./../include/opcode/aarch64.h' line='843' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='aarch64_cond' type-id='type-id-451' filepath='./../include/opcode/aarch64.h' line='725' column='1' id='type-id-444'/>
    <class-decl name='__anonymous_struct__' size-in-bits='256' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-444' visibility='default' filepath='./../include/opcode/aarch64.h' line='719' column='1' id='type-id-451'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='names' type-id='type-id-453' visibility='default' filepath='./../include/opcode/aarch64.h' line='723' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='value' type-id='type-id-401' visibility='default' filepath='./../include/opcode/aarch64.h' line='724' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='aarch64_opnd_info' type-id='type-id-414' filepath='./../include/opcode/aarch64.h' line='819' column='1' id='type-id-409'/>
    <class-decl name='aarch64_opnd_info' size-in-bits='384' is-struct='yes' visibility='default' filepath='./../include/opcode/aarch64.h' line='734' column='1' id='type-id-414'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-425' visibility='default' filepath='./../include/opcode/aarch64.h' line='736' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='qualifier' type-id='type-id-426' visibility='default' filepath='./../include/opcode/aarch64.h' line='737' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='idx' type-id='type-id-5' visibility='default' filepath='./../include/opcode/aarch64.h' line='738' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='' type-id='type-id-427' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='shifter' type-id='type-id-428' visibility='default' filepath='./../include/opcode/aarch64.h' line='805' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='skip' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='807' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='present' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='815' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='./../include/opcode/aarch64.h' line='740' column='1' id='type-id-427'>
      <data-member access='private'>
        <var-decl name='reg' type-id='type-id-435' visibility='default' filepath='./../include/opcode/aarch64.h' line='745' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='reglane' type-id='type-id-436' visibility='default' filepath='./../include/opcode/aarch64.h' line='750' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='reglist' type-id='type-id-437' visibility='default' filepath='./../include/opcode/aarch64.h' line='760' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='imm' type-id='type-id-438' visibility='default' filepath='./../include/opcode/aarch64.h' line='766' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='addr' type-id='type-id-439' visibility='default' filepath='./../include/opcode/aarch64.h' line='784' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='cond' type-id='type-id-416' visibility='default' filepath='./../include/opcode/aarch64.h' line='785' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sysreg' type-id='type-id-401' visibility='default' filepath='./../include/opcode/aarch64.h' line='787' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pstatefield' type-id='type-id-401' visibility='default' filepath='./../include/opcode/aarch64.h' line='789' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sysins_op' type-id='type-id-440' visibility='default' filepath='./../include/opcode/aarch64.h' line='790' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='barrier' type-id='type-id-441' visibility='default' filepath='./../include/opcode/aarch64.h' line='791' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='hint_option' type-id='type-id-441' visibility='default' filepath='./../include/opcode/aarch64.h' line='792' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='prfop' type-id='type-id-441' visibility='default' filepath='./../include/opcode/aarch64.h' line='793' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./../include/opcode/aarch64.h' line='742' column='1' id='type-id-435'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='regno' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='744' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./../include/opcode/aarch64.h' line='746' column='1' id='type-id-436'>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='regno' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='748' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23'>
        <var-decl name='index' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='749' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./../include/opcode/aarch64.h' line='752' column='1' id='type-id-437'>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='first_regno' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='754' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='num_regs' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='755' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23'>
        <var-decl name='has_index' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='757' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='index' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='759' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./../include/opcode/aarch64.h' line='762' column='1' id='type-id-438'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-442' visibility='default' filepath='./../include/opcode/aarch64.h' line='764' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='is_fp' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='765' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int64_t' type-id='type-id-452' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='27' column='1' id='type-id-442'/>
    <typedef-decl name='__int64_t' type-id='type-id-89' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='43' column='1' id='type-id-452'/>
    <class-decl name='__anonymous_struct__5' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./../include/opcode/aarch64.h' line='768' column='1' id='type-id-439'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='base_regno' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='770' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='offset' type-id='type-id-443' visibility='default' filepath='./../include/opcode/aarch64.h' line='779' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='pcrel' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='780' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='writeback' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='781' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='preind' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='782' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='postind' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='783' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./../include/opcode/aarch64.h' line='771' column='1' id='type-id-443'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-448' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='is_reg' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='778' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='./../include/opcode/aarch64.h' line='773' column='1' id='type-id-448'>
      <data-member access='private'>
        <var-decl name='imm' type-id='type-id-5' visibility='default' filepath='./../include/opcode/aarch64.h' line='775' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='regno' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='776' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='aarch64_sys_ins_reg' type-id='type-id-454' filepath='./../include/opcode/aarch64.h' line='680' column='1' id='type-id-450'/>
    <class-decl name='__anonymous_struct__7' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-450' visibility='default' filepath='./../include/opcode/aarch64.h' line='675' column='1' id='type-id-454'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-7' visibility='default' filepath='./../include/opcode/aarch64.h' line='677' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value' type-id='type-id-410' visibility='default' filepath='./../include/opcode/aarch64.h' line='678' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='flags' type-id='type-id-410' visibility='default' filepath='./../include/opcode/aarch64.h' line='679' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='aarch64_name_value_pair' size-in-bits='128' is-struct='yes' visibility='default' filepath='./../include/opcode/aarch64.h' line='649' column='1' id='type-id-449'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-7' visibility='default' filepath='./../include/opcode/aarch64.h' line='651' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value' type-id='type-id-401' visibility='default' filepath='./../include/opcode/aarch64.h' line='652' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='96' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./../include/opcode/aarch64.h' line='798' column='1' id='type-id-428'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kind' type-id='type-id-432' visibility='default' filepath='./../include/opcode/aarch64.h' line='800' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='amount' type-id='type-id-5' visibility='default' filepath='./../include/opcode/aarch64.h' line='801' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='operator_present' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='802' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='amount_present' type-id='type-id-4' visibility='default' filepath='./../include/opcode/aarch64.h' line='804' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='aarch64_modifier_kind' filepath='./../include/opcode/aarch64.h' line='694' column='1' id='type-id-432'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='AARCH64_MOD_NONE' value='0'/>
      <enumerator name='AARCH64_MOD_MSL' value='1'/>
      <enumerator name='AARCH64_MOD_ROR' value='2'/>
      <enumerator name='AARCH64_MOD_ASR' value='3'/>
      <enumerator name='AARCH64_MOD_LSR' value='4'/>
      <enumerator name='AARCH64_MOD_LSL' value='5'/>
      <enumerator name='AARCH64_MOD_UXTB' value='6'/>
      <enumerator name='AARCH64_MOD_UXTH' value='7'/>
      <enumerator name='AARCH64_MOD_UXTW' value='8'/>
      <enumerator name='AARCH64_MOD_UXTX' value='9'/>
      <enumerator name='AARCH64_MOD_SXTB' value='10'/>
      <enumerator name='AARCH64_MOD_SXTH' value='11'/>
      <enumerator name='AARCH64_MOD_SXTW' value='12'/>
      <enumerator name='AARCH64_MOD_SXTX' value='13'/>
    </enum-decl>
    <typedef-decl name='aarch64_operand_error' type-id='type-id-457' filepath='./../include/opcode/aarch64.h' line='918' column='1' id='type-id-458'/>
    <class-decl name='aarch64_operand_error' size-in-bits='256' is-struct='yes' visibility='default' filepath='./../include/opcode/aarch64.h' line='910' column='1' id='type-id-457'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kind' type-id='type-id-459' visibility='default' filepath='./../include/opcode/aarch64.h' line='912' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='index' type-id='type-id-5' visibility='default' filepath='./../include/opcode/aarch64.h' line='913' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='error' type-id='type-id-7' visibility='default' filepath='./../include/opcode/aarch64.h' line='914' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data' type-id='type-id-456' visibility='default' filepath='./../include/opcode/aarch64.h' line='915' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='aarch64_operand_error_kind' filepath='./../include/opcode/aarch64.h' line='896' column='1' id='type-id-459'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='AARCH64_OPDE_NIL' value='0'/>
      <enumerator name='AARCH64_OPDE_RECOVERABLE' value='1'/>
      <enumerator name='AARCH64_OPDE_SYNTAX_ERROR' value='2'/>
      <enumerator name='AARCH64_OPDE_FATAL_SYNTAX_ERROR' value='3'/>
      <enumerator name='AARCH64_OPDE_INVALID_VARIANT' value='4'/>
      <enumerator name='AARCH64_OPDE_OUT_OF_RANGE' value='5'/>
      <enumerator name='AARCH64_OPDE_UNALIGNED' value='6'/>
      <enumerator name='AARCH64_OPDE_REG_LIST' value='7'/>
      <enumerator name='AARCH64_OPDE_OTHER_ERROR' value='8'/>
    </enum-decl>
    <typedef-decl name='aarch64_operand' type-id='type-id-413' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-opc.h' line='127' column='1' id='type-id-408'/>
    <class-decl name='aarch64_operand' size-in-bits='384' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-opc.h' line='109' column='1' id='type-id-413'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op_class' type-id='type-id-423' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-opc.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-7' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-opc.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flags' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-opc.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='fields' type-id='type-id-424' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-opc.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='desc' type-id='type-id-7' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-opc.h' line='124' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='aarch64_operand_class' filepath='./../include/opcode/aarch64.h' line='109' column='1' id='type-id-423'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='AARCH64_OPND_CLASS_NIL' value='0'/>
      <enumerator name='AARCH64_OPND_CLASS_INT_REG' value='1'/>
      <enumerator name='AARCH64_OPND_CLASS_MODIFIED_REG' value='2'/>
      <enumerator name='AARCH64_OPND_CLASS_FP_REG' value='3'/>
      <enumerator name='AARCH64_OPND_CLASS_SIMD_REG' value='4'/>
      <enumerator name='AARCH64_OPND_CLASS_SIMD_ELEMENT' value='5'/>
      <enumerator name='AARCH64_OPND_CLASS_SISD_REG' value='6'/>
      <enumerator name='AARCH64_OPND_CLASS_SIMD_REGLIST' value='7'/>
      <enumerator name='AARCH64_OPND_CLASS_CP_REG' value='8'/>
      <enumerator name='AARCH64_OPND_CLASS_ADDRESS' value='9'/>
      <enumerator name='AARCH64_OPND_CLASS_IMMEDIATE' value='10'/>
      <enumerator name='AARCH64_OPND_CLASS_SYSTEM' value='11'/>
      <enumerator name='AARCH64_OPND_CLASS_COND' value='12'/>
    </enum-decl>
    <enum-decl name='aarch64_field_kind' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-opc.h' line='29' column='1' id='type-id-429'>
      <underlying-type type-id='type-id-10'/>
      <enumerator name='FLD_NIL' value='0'/>
      <enumerator name='FLD_cond2' value='1'/>
      <enumerator name='FLD_nzcv' value='2'/>
      <enumerator name='FLD_defgh' value='3'/>
      <enumerator name='FLD_abc' value='4'/>
      <enumerator name='FLD_imm19' value='5'/>
      <enumerator name='FLD_immhi' value='6'/>
      <enumerator name='FLD_immlo' value='7'/>
      <enumerator name='FLD_size' value='8'/>
      <enumerator name='FLD_vldst_size' value='9'/>
      <enumerator name='FLD_op' value='10'/>
      <enumerator name='FLD_Q' value='11'/>
      <enumerator name='FLD_Rt' value='12'/>
      <enumerator name='FLD_Rd' value='13'/>
      <enumerator name='FLD_Rn' value='14'/>
      <enumerator name='FLD_Rt2' value='15'/>
      <enumerator name='FLD_Ra' value='16'/>
      <enumerator name='FLD_op2' value='17'/>
      <enumerator name='FLD_CRm' value='18'/>
      <enumerator name='FLD_CRn' value='19'/>
      <enumerator name='FLD_op1' value='20'/>
      <enumerator name='FLD_op0' value='21'/>
      <enumerator name='FLD_imm3' value='22'/>
      <enumerator name='FLD_cond' value='23'/>
      <enumerator name='FLD_opcode' value='24'/>
      <enumerator name='FLD_cmode' value='25'/>
      <enumerator name='FLD_asisdlso_opcode' value='26'/>
      <enumerator name='FLD_len' value='27'/>
      <enumerator name='FLD_Rm' value='28'/>
      <enumerator name='FLD_Rs' value='29'/>
      <enumerator name='FLD_option' value='30'/>
      <enumerator name='FLD_S' value='31'/>
      <enumerator name='FLD_hw' value='32'/>
      <enumerator name='FLD_opc' value='33'/>
      <enumerator name='FLD_opc1' value='34'/>
      <enumerator name='FLD_shift' value='35'/>
      <enumerator name='FLD_type' value='36'/>
      <enumerator name='FLD_ldst_size' value='37'/>
      <enumerator name='FLD_imm6' value='38'/>
      <enumerator name='FLD_imm4' value='39'/>
      <enumerator name='FLD_imm5' value='40'/>
      <enumerator name='FLD_imm7' value='41'/>
      <enumerator name='FLD_imm8' value='42'/>
      <enumerator name='FLD_imm9' value='43'/>
      <enumerator name='FLD_imm12' value='44'/>
      <enumerator name='FLD_imm14' value='45'/>
      <enumerator name='FLD_imm16' value='46'/>
      <enumerator name='FLD_imm26' value='47'/>
      <enumerator name='FLD_imms' value='48'/>
      <enumerator name='FLD_immr' value='49'/>
      <enumerator name='FLD_immb' value='50'/>
      <enumerator name='FLD_immh' value='51'/>
      <enumerator name='FLD_N' value='52'/>
      <enumerator name='FLD_index' value='53'/>
      <enumerator name='FLD_index2' value='54'/>
      <enumerator name='FLD_sf' value='55'/>
      <enumerator name='FLD_lse_sz' value='56'/>
      <enumerator name='FLD_H' value='57'/>
      <enumerator name='FLD_L' value='58'/>
      <enumerator name='FLD_M' value='59'/>
      <enumerator name='FLD_b5' value='60'/>
      <enumerator name='FLD_b40' value='61'/>
      <enumerator name='FLD_scale' value='62'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-401' size-in-bits='64' id='type-id-398'/>
    <pointer-type-def type-id='type-id-458' size-in-bits='64' id='type-id-460'/>
    <pointer-type-def type-id='type-id-426' size-in-bits='64' id='type-id-461'/>
    <qualified-type-def type-id='type-id-444' const='yes' id='type-id-433'/>
    <pointer-type-def type-id='type-id-433' size-in-bits='64' id='type-id-416'/>
    <qualified-type-def type-id='type-id-445' const='yes' id='type-id-434'/>
    <pointer-type-def type-id='type-id-434' size-in-bits='64' id='type-id-420'/>
    <qualified-type-def type-id='type-id-406' const='yes' id='type-id-402'/>
    <pointer-type-def type-id='type-id-402' size-in-bits='64' id='type-id-399'/>
    <qualified-type-def type-id='type-id-449' const='yes' id='type-id-446'/>
    <pointer-type-def type-id='type-id-446' size-in-bits='64' id='type-id-441'/>
    <qualified-type-def type-id='type-id-407' const='yes' id='type-id-403'/>
    <pointer-type-def type-id='type-id-403' size-in-bits='64' id='type-id-400'/>
    <qualified-type-def type-id='type-id-408' const='yes' id='type-id-404'/>
    <pointer-type-def type-id='type-id-404' size-in-bits='64' id='type-id-396'/>
    <qualified-type-def type-id='type-id-409' const='yes' id='type-id-405'/>
    <pointer-type-def type-id='type-id-405' size-in-bits='64' id='type-id-397'/>
    <qualified-type-def type-id='type-id-450' const='yes' id='type-id-447'/>
    <pointer-type-def type-id='type-id-447' size-in-bits='64' id='type-id-440'/>
    <function-decl name='aarch64_opcode_encode' mangled-name='aarch64_opcode_encode' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='1253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='aarch64_opcode_encode'>
      <parameter type-id='type-id-400' name='opcode' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='1253' column='1'/>
      <parameter type-id='type-id-399' name='inst_ori' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='1254' column='1'/>
      <parameter type-id='type-id-398' name='code' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='1254' column='1'/>
      <parameter type-id='type-id-461' name='qlf_seq' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='1255' column='1'/>
      <parameter type-id='type-id-460' name='mismatch_detail' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='1256' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='aarch64_ins_reg_shifted' mangled-name='aarch64_ins_reg_shifted' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='709' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='aarch64_ins_reg_shifted'>
      <parameter type-id='type-id-396' name='self' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='709' column='1'/>
      <parameter type-id='type-id-397' name='info' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='710' column='1'/>
      <parameter type-id='type-id-398' name='code' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='710' column='1'/>
      <parameter type-id='type-id-399' name='inst' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='711' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='aarch64_ins_reg_extended' mangled-name='aarch64_ins_reg_extended' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='686' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='aarch64_ins_reg_extended'>
      <parameter type-id='type-id-396' name='self' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='686' column='1'/>
      <parameter type-id='type-id-397' name='info' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='687' column='1'/>
      <parameter type-id='type-id-398' name='code' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='687' column='1'/>
      <parameter type-id='type-id-399' name='inst' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='688' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='aarch64_ins_hint' mangled-name='aarch64_ins_hint' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='674' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='aarch64_ins_hint'>
      <parameter type-id='type-id-396' name='self' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='674' column='1'/>
      <parameter type-id='type-id-397' name='info' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='675' column='1'/>
      <parameter type-id='type-id-398' name='code' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='675' column='1'/>
      <parameter type-id='type-id-399' name='inst' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='676' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='aarch64_ins_prfop' mangled-name='aarch64_ins_prfop' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='661' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='aarch64_ins_prfop'>
      <parameter type-id='type-id-396' name='self' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='661' column='1'/>
      <parameter type-id='type-id-397' name='info' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='662' column='1'/>
      <parameter type-id='type-id-398' name='code' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='662' column='1'/>
      <parameter type-id='type-id-399' name='inst' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='663' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='aarch64_ins_barrier' mangled-name='aarch64_ins_barrier' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='648' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='aarch64_ins_barrier'>
      <parameter type-id='type-id-396' name='self' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='648' column='1'/>
      <parameter type-id='type-id-397' name='info' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='649' column='1'/>
      <parameter type-id='type-id-398' name='code' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='649' column='1'/>
      <parameter type-id='type-id-399' name='inst' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='650' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='aarch64_ins_sysins_op' mangled-name='aarch64_ins_sysins_op' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='635' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='aarch64_ins_sysins_op'>
      <parameter type-id='type-id-396' name='self' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='635' column='1'/>
      <parameter type-id='type-id-397' name='info' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='636' column='1'/>
      <parameter type-id='type-id-398' name='code' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='636' column='1'/>
      <parameter type-id='type-id-399' name='inst' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='637' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='aarch64_ins_pstatefield' mangled-name='aarch64_ins_pstatefield' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='623' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='aarch64_ins_pstatefield'>
      <parameter type-id='type-id-396' name='self' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='623' column='1'/>
      <parameter type-id='type-id-397' name='info' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='624' column='1'/>
      <parameter type-id='type-id-398' name='code' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='624' column='1'/>
      <parameter type-id='type-id-399' name='inst' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='625' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='aarch64_ins_sysreg' mangled-name='aarch64_ins_sysreg' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='611' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='aarch64_ins_sysreg'>
      <parameter type-id='type-id-396' name='self' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='611' column='1'/>
      <parameter type-id='type-id-397' name='info' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='612' column='1'/>
      <parameter type-id='type-id-398' name='code' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='612' column='1'/>
      <parameter type-id='type-id-399' name='inst' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='613' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='aarch64_ins_cond' mangled-name='aarch64_ins_cond' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='600' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='aarch64_ins_cond'>
      <parameter type-id='type-id-396' name='self' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='600' column='1'/>
      <parameter type-id='type-id-397' name='info' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='601' column='1'/>
      <parameter type-id='type-id-398' name='code' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='601' column='1'/>
      <parameter type-id='type-id-399' name='inst' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='602' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='aarch64_ins_simd_addr_post' mangled-name='aarch64_ins_simd_addr_post' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='584' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='aarch64_ins_simd_addr_post'>
      <parameter type-id='type-id-396' name='self' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='584' column='1'/>
      <parameter type-id='type-id-397' name='info' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='585' column='1'/>
      <parameter type-id='type-id-398' name='code' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='585' column='1'/>
      <parameter type-id='type-id-399' name='inst' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='586' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='aarch64_ins_addr_uimm12' mangled-name='aarch64_ins_addr_uimm12' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='567' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='aarch64_ins_addr_uimm12'>
      <parameter type-id='type-id-396' name='self' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='567' column='1'/>
      <parameter type-id='type-id-397' name='info' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='568' column='1'/>
      <parameter type-id='type-id-398' name='code' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='569' column='1'/>
      <parameter type-id='type-id-399' name='inst' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='570' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='aarch64_ins_addr_simm' mangled-name='aarch64_ins_addr_simm' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='535' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='aarch64_ins_addr_simm'>
      <parameter type-id='type-id-396' name='self' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='535' column='1'/>
      <parameter type-id='type-id-397' name='info' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='536' column='1'/>
      <parameter type-id='type-id-398' name='code' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='537' column='1'/>
      <parameter type-id='type-id-399' name='inst' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='538' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='aarch64_ins_addr_regoff' mangled-name='aarch64_ins_addr_regoff' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='503' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='aarch64_ins_addr_regoff'>
      <parameter type-id='type-id-396' name='self' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='503' column='1'/>
      <parameter type-id='type-id-397' name='info' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='504' column='1'/>
      <parameter type-id='type-id-398' name='code' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='504' column='1'/>
      <parameter type-id='type-id-399' name='inst' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='505' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='aarch64_ins_addr_simple' mangled-name='aarch64_ins_addr_simple' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='491' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='aarch64_ins_addr_simple'>
      <parameter type-id='type-id-396' name='self' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='491' column='1'/>
      <parameter type-id='type-id-397' name='info' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='492' column='1'/>
      <parameter type-id='type-id-398' name='code' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='492' column='1'/>
      <parameter type-id='type-id-399' name='inst' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='493' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='aarch64_ins_ft' mangled-name='aarch64_ins_ft' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='455' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='aarch64_ins_ft'>
      <parameter type-id='type-id-396' name='self' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='455' column='1'/>
      <parameter type-id='type-id-397' name='info' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='455' column='1'/>
      <parameter type-id='type-id-398' name='code' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='456' column='1'/>
      <parameter type-id='type-id-399' name='inst' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='456' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='aarch64_ins_limm' mangled-name='aarch64_ins_limm' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='aarch64_ins_limm'>
      <parameter type-id='type-id-396' name='self' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='434' column='1'/>
      <parameter type-id='type-id-397' name='info' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='434' column='1'/>
      <parameter type-id='type-id-398' name='code' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='435' column='1'/>
      <parameter type-id='type-id-399' name='inst' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='435' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='aarch64_ins_aimm' mangled-name='aarch64_ins_aimm' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='420' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='aarch64_ins_aimm'>
      <parameter type-id='type-id-396' name='self' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='420' column='1'/>
      <parameter type-id='type-id-397' name='info' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='420' column='1'/>
      <parameter type-id='type-id-398' name='code' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='421' column='1'/>
      <parameter type-id='type-id-399' name='inst' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='421' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='aarch64_ins_fbits' mangled-name='aarch64_ins_fbits' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='409' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='aarch64_ins_fbits'>
      <parameter type-id='type-id-396' name='self' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='409' column='1'/>
      <parameter type-id='type-id-397' name='info' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='409' column='1'/>
      <parameter type-id='type-id-398' name='code' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='410' column='1'/>
      <parameter type-id='type-id-399' name='inst' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='411' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='aarch64_ins_advsimd_imm_modified' mangled-name='aarch64_ins_advsimd_imm_modified' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='351' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='aarch64_ins_advsimd_imm_modified'>
      <parameter type-id='type-id-396' name='self' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='351' column='1'/>
      <parameter type-id='type-id-397' name='info' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='352' column='1'/>
      <parameter type-id='type-id-398' name='code' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='353' column='1'/>
      <parameter type-id='type-id-399' name='inst' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='354' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='aarch64_ins_imm_half' mangled-name='aarch64_ins_imm_half' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='338' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='aarch64_ins_imm_half'>
      <parameter type-id='type-id-396' name='self' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='338' column='1'/>
      <parameter type-id='type-id-397' name='info' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='338' column='1'/>
      <parameter type-id='type-id-398' name='code' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='339' column='1'/>
      <parameter type-id='type-id-399' name='inst' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='339' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='aarch64_ins_advsimd_imm_shift' mangled-name='aarch64_ins_advsimd_imm_shift' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='262' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='aarch64_ins_advsimd_imm_shift'>
      <parameter type-id='type-id-396' name='self' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='262' column='1'/>
      <parameter type-id='type-id-397' name='info' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='263' column='1'/>
      <parameter type-id='type-id-398' name='code' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='264' column='1'/>
      <parameter type-id='type-id-399' name='inst' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='264' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='aarch64_ins_ldst_elemlist' mangled-name='aarch64_ins_ldst_elemlist' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='213' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='aarch64_ins_ldst_elemlist'>
      <parameter type-id='type-id-396' name='self' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='213' column='1'/>
      <parameter type-id='type-id-397' name='info' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='214' column='1'/>
      <parameter type-id='type-id-398' name='code' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='214' column='1'/>
      <parameter type-id='type-id-399' name='inst' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='215' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='aarch64_ins_ldst_reglist_r' mangled-name='aarch64_ins_ldst_reglist_r' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='aarch64_ins_ldst_reglist_r'>
      <parameter type-id='type-id-396' name='self' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='188' column='1'/>
      <parameter type-id='type-id-397' name='info' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='189' column='1'/>
      <parameter type-id='type-id-398' name='code' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='189' column='1'/>
      <parameter type-id='type-id-399' name='inst' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='190' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='aarch64_ins_ldst_reglist' mangled-name='aarch64_ins_ldst_reglist' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='aarch64_ins_ldst_reglist'>
      <parameter type-id='type-id-396' name='self' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.26-tp6fjfo5bbhrbne2f5fjz6mlnse2pmzs/spack-src/opcodes/aarch64-asm.c' line='145' column='1'/>
