<abi-corpus path='/opt/spack/opt/spack/linux-ubuntu18.04-x86_64/gcc-7.5.0/python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/lib/libpython2.7.so' architecture='elf-amd-x86_64' soname='libpython2.7.so.1.0'>
  <elf-needed>
    <dependency name='libssl.so.1.0.0'/>
    <dependency name='libcrypto.so.1.0.0'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libutil.so.1'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='PyAST_Check' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_Compile' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_FromNode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_mod2obj' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_obj2mod' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArena_AddPyObject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArena_Free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_Py_TrueStruct' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ZeroStruct' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_abstract_hack' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ascii_whitespace' size='128' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_capitalize__doc__' size='124' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_capsule_hack' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_cobject_hack' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_table' size='1024' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_tolower' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_toupper' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isalnum__doc__' size='132' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isalpha__doc__' size='130' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isdigit__doc__' size='126' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_islower__doc__' size='141' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isspace__doc__' size='130' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_istitle__doc__' size='230' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isupper__doc__' size='141' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_lower__doc__' size='93' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_swapcase__doc__' size='123' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_title__doc__' size='155' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_upper__doc__' size='93' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/_codecsmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='init_codecs' mangled-name='init_codecs' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/_codecsmodule.c' line='1113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='init_codecs'>
      <return type-id='type-id-1'/>
    </function-decl>
    <type-decl name='void' id='type-id-1'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/_sre.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='init_sre' mangled-name='init_sre' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/_sre.c' line='3989' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='init_sre'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/_ssl.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='init_ssl' mangled-name='init_ssl' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/_ssl.c' line='3854' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='init_ssl'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/_weakref.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='init_weakref' mangled-name='init_weakref' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/_weakref.c' line='92' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='init_weakref'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/errnomodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='initerrno' mangled-name='initerrno' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/errnomodule.c' line='56' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='initerrno'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/gcmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <type-decl name='long double' size-in-bits='128' id='type-id-2'/>
    <typedef-decl name='PyGC_Head' type-id='type-id-3' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/objimpl.h' line='259' column='1' id='type-id-4'/>
    <union-decl name='_gc_head' size-in-bits='256' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/objimpl.h' line='252' column='1' id='type-id-3'>
      <data-member access='private'>
        <var-decl name='gc' type-id='type-id-5' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/objimpl.h' line='257' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='dummy' type-id='type-id-2' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/objimpl.h' line='258' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/objimpl.h' line='253' column='1' id='type-id-5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gc_next' type-id='type-id-6' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/objimpl.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='gc_prev' type-id='type-id-6' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/objimpl.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='gc_refs' type-id='type-id-7' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/objimpl.h' line='256' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-8'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-6'/>
    <var-decl name='_PyGC_generation0' type-id='type-id-8' mangled-name='_PyGC_generation0' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/objimpl.h' line='261' column='1' elf-symbol-id='_PyGC_generation0'/>
    <function-decl name='_PyObject_GC_Del' mangled-name='_PyObject_GC_Del' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/gcmodule.c' line='1567' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_Del'>
      <parameter type-id='type-id-9' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/gcmodule.c' line='1567' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyObject_GC_Del' mangled-name='PyObject_GC_Del' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/gcmodule.c' line='1553' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_Del'>
      <parameter type-id='type-id-10' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/gcmodule.c' line='1553' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyObject_GC_Resize' mangled-name='_PyObject_GC_Resize' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/gcmodule.c' line='1538' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_Resize'>
      <parameter type-id='type-id-11' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/gcmodule.c' line='1538' column='1'/>
      <parameter type-id='type-id-7' name='nitems' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/gcmodule.c' line='1538' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_PyObject_GC_NewVar' mangled-name='_PyObject_GC_NewVar' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/gcmodule.c' line='1528' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_NewVar'>
      <parameter type-id='type-id-12' name='tp' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/gcmodule.c' line='1528' column='1'/>
      <parameter type-id='type-id-7' name='nitems' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/gcmodule.c' line='1528' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_PyObject_GC_New' mangled-name='_PyObject_GC_New' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/gcmodule.c' line='1519' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_New'>
      <parameter type-id='type-id-12' name='tp' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/gcmodule.c' line='1519' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_PyObject_GC_UnTrack' mangled-name='_PyObject_GC_UnTrack' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/gcmodule.c' line='1487' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_UnTrack'>
      <parameter type-id='type-id-9' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/gcmodule.c' line='1487' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyObject_GC_Track' mangled-name='_PyObject_GC_Track' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/gcmodule.c' line='1470' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_Track'>
      <parameter type-id='type-id-9' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/gcmodule.c' line='1470' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyObject_GC_Track' mangled-name='PyObject_GC_Track' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/gcmodule.c' line='1463' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_Track'>
      <parameter type-id='type-id-10' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/gcmodule.c' line='1463' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyGC_Dump' mangled-name='_PyGC_Dump' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/gcmodule.c' line='1449' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyGC_Dump'>
      <parameter type-id='type-id-8' name='g' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/gcmodule.c' line='1449' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyGC_Collect' mangled-name='PyGC_Collect' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/gcmodule.c' line='1432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyGC_Collect'>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='initgc' mangled-name='initgc' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/gcmodule.c' line='1386' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='initgc'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyObject_GC_UnTrack' mangled-name='PyObject_GC_UnTrack' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/gcmodule.c' line='1476' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_UnTrack'>
      <parameter type-id='type-id-10' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/gcmodule.c' line='1476' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyObject_GC_Malloc' mangled-name='_PyObject_GC_Malloc' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/gcmodule.c' line='1493' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_Malloc'>
      <parameter type-id='type-id-13' name='basicsize' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/gcmodule.c' line='1493' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-9'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-12'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-11'/>
    <typedef-decl name='Py_ssize_t' type-id='type-id-17' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyport.h' line='183' column='1' id='type-id-7'/>
    <typedef-decl name='size_t' type-id='type-id-18' filepath='/usr/lib/gcc/x86_64-linux-gnu/7/include/stddef.h' line='216' column='1' id='type-id-13'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-10'/>
    <typedef-decl name='PyObject' type-id='type-id-19' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='108' column='1' id='type-id-14'/>
    <typedef-decl name='PyTypeObject' type-id='type-id-20' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='411' column='1' id='type-id-15'/>
    <typedef-decl name='PyVarObject' type-id='type-id-21' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='112' column='1' id='type-id-16'/>
    <typedef-decl name='ssize_t' type-id='type-id-22' filepath='/usr/include/stdio.h' line='71' column='1' id='type-id-17'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-18'/>
    <class-decl name='_object' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='106' column='1' id='type-id-19'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_refcnt' type-id='type-id-7' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ob_type' type-id='type-id-23' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='107' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_typeobject' size-in-bits='3136' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='324' column='1' id='type-id-20'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_refcnt' type-id='type-id-7' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ob_type' type-id='type-id-23' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ob_size' type-id='type-id-7' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tp_name' type-id='type-id-24' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tp_basicsize' type-id='type-id-7' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tp_itemsize' type-id='type-id-7' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tp_dealloc' type-id='type-id-25' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tp_print' type-id='type-id-26' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='tp_getattr' type-id='type-id-27' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tp_setattr' type-id='type-id-28' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='tp_compare' type-id='type-id-29' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='335' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='tp_repr' type-id='type-id-30' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='336' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='tp_as_number' type-id='type-id-31' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='340' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='tp_as_sequence' type-id='type-id-32' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='341' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='tp_as_mapping' type-id='type-id-33' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='342' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='tp_hash' type-id='type-id-34' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='tp_call' type-id='type-id-35' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='347' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='tp_str' type-id='type-id-30' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='348' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='tp_getattro' type-id='type-id-36' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='tp_setattro' type-id='type-id-37' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='350' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='tp_as_buffer' type-id='type-id-38' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='353' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='tp_flags' type-id='type-id-39' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='356' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='tp_doc' type-id='type-id-24' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='358' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='tp_traverse' type-id='type-id-40' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='362' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='tp_clear' type-id='type-id-41' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='tp_richcompare' type-id='type-id-42' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='369' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='tp_weaklistoffset' type-id='type-id-7' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='tp_iter' type-id='type-id-43' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='376' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='tp_iternext' type-id='type-id-44' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='377' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='tp_methods' type-id='type-id-45' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='tp_members' type-id='type-id-46' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='381' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='tp_getset' type-id='type-id-47' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='382' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='tp_base' type-id='type-id-23' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='tp_dict' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='384' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='tp_descr_get' type-id='type-id-48' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='385' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tp_descr_set' type-id='type-id-49' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='tp_dictoffset' type-id='type-id-7' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='387' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='tp_init' type-id='type-id-50' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='388' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='tp_alloc' type-id='type-id-51' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='tp_new' type-id='type-id-52' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='tp_free' type-id='type-id-53' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='tp_is_gc' type-id='type-id-41' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='tp_bases' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='tp_mro' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='tp_cache' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='395' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='tp_subclasses' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='tp_weaklist' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='397' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='tp_del' type-id='type-id-25' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='398' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='tp_version_tag' type-id='type-id-54' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='401' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-16' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='110' column='1' id='type-id-21'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_refcnt' type-id='type-id-7' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ob_type' type-id='type-id-23' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ob_size' type-id='type-id-7' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__ssize_t' type-id='type-id-39' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='181' column='1' id='type-id-22'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-38'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-47'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-33'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-46'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-45'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-32'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-23'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-24'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-39'/>
    <typedef-decl name='allocfunc' type-id='type-id-63' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='322' column='1' id='type-id-51'/>
    <typedef-decl name='cmpfunc' type-id='type-id-64' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='312' column='1' id='type-id-29'/>
    <typedef-decl name='descrgetfunc' type-id='type-id-65' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='318' column='1' id='type-id-48'/>
    <typedef-decl name='descrsetfunc' type-id='type-id-66' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='319' column='1' id='type-id-49'/>
    <typedef-decl name='destructor' type-id='type-id-67' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='306' column='1' id='type-id-25'/>
    <typedef-decl name='freefunc' type-id='type-id-68' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='305' column='1' id='type-id-53'/>
    <typedef-decl name='getattrfunc' type-id='type-id-69' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='308' column='1' id='type-id-27'/>
    <typedef-decl name='getattrofunc' type-id='type-id-70' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='309' column='1' id='type-id-36'/>
    <typedef-decl name='getiterfunc' type-id='type-id-71' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='316' column='1' id='type-id-43'/>
    <typedef-decl name='hashfunc' type-id='type-id-72' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='314' column='1' id='type-id-34'/>
    <typedef-decl name='initproc' type-id='type-id-66' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='320' column='1' id='type-id-50'/>
    <typedef-decl name='inquiry' type-id='type-id-73' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='136' column='1' id='type-id-41'/>
    <typedef-decl name='iternextfunc' type-id='type-id-71' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='317' column='1' id='type-id-44'/>
    <typedef-decl name='newfunc' type-id='type-id-74' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='321' column='1' id='type-id-52'/>
    <typedef-decl name='printfunc' type-id='type-id-75' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='307' column='1' id='type-id-26'/>
    <typedef-decl name='reprfunc' type-id='type-id-71' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='313' column='1' id='type-id-30'/>
    <typedef-decl name='richcmpfunc' type-id='type-id-76' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='315' column='1' id='type-id-42'/>
    <typedef-decl name='setattrfunc' type-id='type-id-77' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='310' column='1' id='type-id-28'/>
    <typedef-decl name='setattrofunc' type-id='type-id-66' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='311' column='1' id='type-id-37'/>
    <typedef-decl name='ternaryfunc' type-id='type-id-65' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='135' column='1' id='type-id-35'/>
    <typedef-decl name='traverseproc' type-id='type-id-78' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='217' column='1' id='type-id-40'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-54'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-71'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-70'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-65'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-76'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-69'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-74'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-63'/>
    <class-decl name='PyGetSetDef' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/descrobject.h' line='11' column='1' id='type-id-56'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-86' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/descrobject.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='get' type-id='type-id-87' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/descrobject.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='set' type-id='type-id-88' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/descrobject.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='doc' type-id='type-id-86' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/descrobject.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='closure' type-id='type-id-10' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/descrobject.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyMemberDef' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/structmember.h' line='36' column='1' id='type-id-58'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-86' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/structmember.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-89' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/structmember.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offset' type-id='type-id-7' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/structmember.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flags' type-id='type-id-89' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/structmember.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='doc' type-id='type-id-86' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/structmember.h' line='42' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyMethodDef' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/methodobject.h' line='37' column='1' id='type-id-59'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ml_name' type-id='type-id-24' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/methodobject.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ml_meth' type-id='type-id-90' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/methodobject.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ml_flags' type-id='type-id-89' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/methodobject.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ml_doc' type-id='type-id-24' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/methodobject.h' line='42' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-91' const='yes' id='type-id-62'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-73'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-75'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-64'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-66'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-77'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-78'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-72'/>
    <typedef-decl name='PyBufferProcs' type-id='type-id-99' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='302' column='1' id='type-id-55'/>
    <typedef-decl name='PyMappingMethods' type-id='type-id-100' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='293' column='1' id='type-id-57'/>
    <typedef-decl name='PyNumberMethods' type-id='type-id-101' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='273' column='1' id='type-id-60'/>
    <typedef-decl name='PySequenceMethods' type-id='type-id-102' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='287' column='1' id='type-id-61'/>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-67'/>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-68'/>
    <type-decl name='char' size-in-bits='8' id='type-id-91'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-86'/>
    <class-decl name='__anonymous_struct__' size-in-bits='2496' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-60' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='219' column='1' id='type-id-101'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_add' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nb_subtract' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nb_multiply' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nb_divide' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nb_remainder' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nb_divmod' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nb_power' type-id='type-id-35' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nb_negative' type-id='type-id-106' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nb_positive' type-id='type-id-106' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='nb_absolute' type-id='type-id-106' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='nb_nonzero' type-id='type-id-41' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='nb_invert' type-id='type-id-106' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='nb_lshift' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='nb_rshift' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='nb_and' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='nb_xor' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='nb_or' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='nb_coerce' type-id='type-id-107' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='nb_int' type-id='type-id-106' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='nb_long' type-id='type-id-106' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='nb_float' type-id='type-id-106' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='nb_oct' type-id='type-id-106' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='nb_hex' type-id='type-id-106' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='nb_inplace_add' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='nb_inplace_subtract' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='nb_inplace_multiply' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='nb_inplace_divide' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='nb_inplace_remainder' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='nb_inplace_power' type-id='type-id-35' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='nb_inplace_lshift' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='nb_inplace_rshift' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='nb_inplace_and' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='nb_inplace_xor' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='nb_inplace_or' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='nb_floor_divide' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='nb_true_divide' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='nb_inplace_floor_divide' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='nb_inplace_true_divide' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='nb_index' type-id='type-id-106' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='272' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-57' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='289' column='1' id='type-id-100'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mp_length' type-id='type-id-108' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp_subscript' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mp_ass_subscript' type-id='type-id-109' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='292' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='640' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-61' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='275' column='1' id='type-id-102'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sq_length' type-id='type-id-108' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sq_concat' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sq_repeat' type-id='type-id-110' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sq_item' type-id='type-id-110' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='sq_slice' type-id='type-id-111' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='sq_ass_item' type-id='type-id-112' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='sq_ass_slice' type-id='type-id-113' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='sq_contains' type-id='type-id-114' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='sq_inplace_concat' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='sq_inplace_repeat' type-id='type-id-110' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='286' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='384' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-55' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='295' column='1' id='type-id-99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bf_getreadbuffer' type-id='type-id-115' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bf_getwritebuffer' type-id='type-id-116' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='bf_getsegcount' type-id='type-id-117' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bf_getcharbuffer' type-id='type-id-118' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bf_getbuffer' type-id='type-id-119' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='bf_releasebuffer' type-id='type-id-120' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='301' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-89'/>
    <typedef-decl name='PyCFunction' type-id='type-id-70' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/methodobject.h' line='18' column='1' id='type-id-90'/>
    <typedef-decl name='getter' type-id='type-id-121' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/descrobject.h' line='8' column='1' id='type-id-87'/>
    <typedef-decl name='setter' type-id='type-id-122' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/descrobject.h' line='9' column='1' id='type-id-88'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-121'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-122'/>
    <typedef-decl name='binaryfunc' type-id='type-id-70' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='134' column='1' id='type-id-105'/>
    <typedef-decl name='charbufferproc' type-id='type-id-125' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='160' column='1' id='type-id-118'/>
    <typedef-decl name='coercion' type-id='type-id-126' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='138' column='1' id='type-id-107'/>
    <typedef-decl name='getbufferproc' type-id='type-id-127' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='181' column='1' id='type-id-119'/>
    <typedef-decl name='lenfunc' type-id='type-id-128' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='137' column='1' id='type-id-108'/>
    <typedef-decl name='objobjargproc' type-id='type-id-66' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='147' column='1' id='type-id-109'/>
    <typedef-decl name='objobjproc' type-id='type-id-64' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='215' column='1' id='type-id-114'/>
    <typedef-decl name='readbufferproc' type-id='type-id-129' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='157' column='1' id='type-id-115'/>
    <typedef-decl name='releasebufferproc' type-id='type-id-130' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='182' column='1' id='type-id-120'/>
    <typedef-decl name='segcountproc' type-id='type-id-131' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='159' column='1' id='type-id-117'/>
    <typedef-decl name='ssizeargfunc' type-id='type-id-132' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='141' column='1' id='type-id-110'/>
    <typedef-decl name='ssizeobjargproc' type-id='type-id-133' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='145' column='1' id='type-id-112'/>
    <typedef-decl name='ssizessizeargfunc' type-id='type-id-134' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='142' column='1' id='type-id-111'/>
    <typedef-decl name='ssizessizeobjargproc' type-id='type-id-135' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='146' column='1' id='type-id-113'/>
    <typedef-decl name='unaryfunc' type-id='type-id-71' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='133' column='1' id='type-id-106'/>
    <typedef-decl name='writebufferproc' type-id='type-id-129' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='158' column='1' id='type-id-116'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-132'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-134'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-126'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-127'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-133'/>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-135'/>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-128'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-131'/>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-125'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-129'/>
    <pointer-type-def type-id='type-id-146' size-in-bits='64' id='type-id-130'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/getbuildinfo.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='type-id-91'/>
    <type-decl name='void' id='type-id-1'/>
    <qualified-type-def type-id='type-id-91' const='yes' id='type-id-62'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-24'/>
    <function-decl name='_Py_svnversion' mangled-name='_Py_svnversion' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/getbuildinfo.c' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_svnversion'>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='Py_GetBuildInfo' mangled-name='Py_GetBuildInfo' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/getbuildinfo.c' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetBuildInfo'>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='_Py_hgidentifier' mangled-name='_Py_hgidentifier' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/getbuildinfo.c' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hgidentifier'>
      <return type-id='type-id-24'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/getpath.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='Py_GetProgramFullPath' mangled-name='Py_GetProgramFullPath' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/getpath.c' line='702' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetProgramFullPath'>
      <return type-id='type-id-86'/>
    </function-decl>
    <function-decl name='Py_GetExecPrefix' mangled-name='Py_GetExecPrefix' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/getpath.c' line='694' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetExecPrefix'>
      <return type-id='type-id-86'/>
    </function-decl>
    <function-decl name='Py_GetPrefix' mangled-name='Py_GetPrefix' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/getpath.c' line='686' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetPrefix'>
      <return type-id='type-id-86'/>
    </function-decl>
    <function-decl name='Py_GetPath' mangled-name='Py_GetPath' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/getpath.c' line='678' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetPath'>
      <return type-id='type-id-86'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/main.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-148'/>
    <function-decl name='Py_GetArgcArgv' mangled-name='Py_GetArgcArgv' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/main.c' line='695' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetArgcArgv'>
      <parameter type-id='type-id-149' name='argc' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/main.c' line='695' column='1'/>
      <parameter type-id='type-id-148' name='argv' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/main.c' line='695' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='Py_Main' mangled-name='Py_Main' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/main.c' line='239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_Main'>
      <parameter type-id='type-id-89' name='argc' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/main.c' line='239' column='1'/>
      <parameter type-id='type-id-147' name='argv' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/main.c' line='239' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-147'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-149'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/posixmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <typedef-decl name='uid_t' type-id='type-id-150' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='80' column='1' id='type-id-151'/>
    <typedef-decl name='__uid_t' type-id='type-id-54' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='134' column='1' id='type-id-150'/>
    <function-decl name='initposix' mangled-name='initposix' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/posixmodule.c' line='9409' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='initposix'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_Uid_Converter' mangled-name='_Py_Uid_Converter' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/posixmodule.c' line='372' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_Uid_Converter'>
      <parameter type-id='type-id-9' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/posixmodule.c' line='372' column='1'/>
      <parameter type-id='type-id-10' name='p' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/posixmodule.c' line='372' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='_Py_Gid_Converter' mangled-name='_Py_Gid_Converter' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/posixmodule.c' line='424' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_Gid_Converter'>
      <parameter type-id='type-id-9' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/posixmodule.c' line='424' column='1'/>
      <parameter type-id='type-id-10' name='p' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/posixmodule.c' line='424' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='_PyInt_FromUid' mangled-name='_PyInt_FromUid' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/posixmodule.c' line='356' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyInt_FromUid'>
      <parameter type-id='type-id-151' name='uid' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/posixmodule.c' line='356' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/pwdmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='initpwd' mangled-name='initpwd' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/pwdmodule.c' line='192' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='initpwd'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/signalmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyOS_AfterFork' mangled-name='PyOS_AfterFork' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/signalmodule.c' line='996' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_AfterFork'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyOS_InterruptOccurred' mangled-name='PyOS_InterruptOccurred' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/signalmodule.c' line='970' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_InterruptOccurred'>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyOS_FiniInterrupts' mangled-name='PyOS_FiniInterrupts' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/signalmodule.c' line='964' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_FiniInterrupts'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyOS_InitInterrupts' mangled-name='PyOS_InitInterrupts' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/signalmodule.c' line='957' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_InitInterrupts'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyErr_SetInterrupt' mangled-name='PyErr_SetInterrupt' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/signalmodule.c' line='951' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_SetInterrupt'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='initsignal' mangled-name='initsignal' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/signalmodule.c' line='572' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='initsignal'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySignal_SetWakeupFd' mangled-name='PySignal_SetWakeupFd' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/signalmodule.c' line='438' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySignal_SetWakeupFd'>
      <parameter type-id='type-id-89' name='fd' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/signalmodule.c' line='438' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyErr_CheckSignals' mangled-name='PyErr_CheckSignals' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/signalmodule.c' line='893' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_CheckSignals'>
      <return type-id='type-id-89'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/symtablemodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='init_symtable' mangled-name='init_symtable' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/symtablemodule.c' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='init_symtable'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/threadmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='initthread' mangled-name='initthread' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/threadmodule.c' line='897' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='initthread'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/xxsubtype.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='initxxsubtype' mangled-name='initxxsubtype' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/xxsubtype.c' line='261' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='initxxsubtype'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/zipimport.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='initzipimport' mangled-name='initzipimport' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Modules/zipimport.c' line='1208' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='initzipimport'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <type-decl name='variadic parameter type' id='type-id-152'/>
    <qualified-type-def type-id='type-id-7' const='yes' id='type-id-153'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-154'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-155'/>
    <function-decl name='PyObject_GetIter' mangled-name='PyObject_GetIter' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='3067' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetIter'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='3067' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_PyObject_RealIsSubclass' mangled-name='_PyObject_RealIsSubclass' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='3060' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_RealIsSubclass'>
      <parameter type-id='type-id-9' name='derived' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='3060' column='1'/>
      <parameter type-id='type-id-9' name='cls' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='3060' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='_PyObject_RealIsInstance' mangled-name='_PyObject_RealIsInstance' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='3054' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_RealIsInstance'>
      <parameter type-id='type-id-9' name='inst' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='3054' column='1'/>
      <parameter type-id='type-id-9' name='cls' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='3054' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyObject_IsSubclass' mangled-name='PyObject_IsSubclass' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='3005' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_IsSubclass'>
      <parameter type-id='type-id-9' name='derived' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='3005' column='1'/>
      <parameter type-id='type-id-9' name='cls' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='3005' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyObject_IsInstance' mangled-name='PyObject_IsInstance' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2922' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_IsInstance'>
      <parameter type-id='type-id-9' name='inst' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2922' column='1'/>
      <parameter type-id='type-id-9' name='cls' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2922' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyObject_CallFunctionObjArgs' mangled-name='PyObject_CallFunctionObjArgs' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2742' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallFunctionObjArgs'>
      <parameter type-id='type-id-9' name='callable' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2742' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyObject_CallMethodObjArgs' mangled-name='PyObject_CallMethodObjArgs' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2714' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallMethodObjArgs'>
      <parameter type-id='type-id-9' name='callable' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2714' column='1'/>
      <parameter type-id='type-id-9' name='name' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2714' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_PyObject_CallMethod_SizeT' mangled-name='_PyObject_CallMethod_SizeT' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2646' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_CallMethod_SizeT'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2646' column='1'/>
      <parameter type-id='type-id-86' name='name' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2646' column='1'/>
      <parameter type-id='type-id-86' name='format' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2646' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyObject_CallMethod' mangled-name='PyObject_CallMethod' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2609' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallMethod'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2609' column='1'/>
      <parameter type-id='type-id-86' name='name' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2609' column='1'/>
      <parameter type-id='type-id-86' name='format' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2609' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_PyObject_CallFunction_SizeT' mangled-name='_PyObject_CallFunction_SizeT' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2589' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_CallFunction_SizeT'>
      <parameter type-id='type-id-9' name='callable' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2589' column='1'/>
      <parameter type-id='type-id-86' name='format' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2589' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyObject_CallFunction' mangled-name='PyObject_CallFunction' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2569' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallFunction'>
      <parameter type-id='type-id-9' name='callable' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2569' column='1'/>
      <parameter type-id='type-id-86' name='format' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2569' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyObject_Call' mangled-name='PyObject_Call' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2521' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Call'>
      <parameter type-id='type-id-9' name='func' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2521' column='1'/>
      <parameter type-id='type-id-9' name='arg' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2521' column='1'/>
      <parameter type-id='type-id-9' name='kw' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2521' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyObject_CallObject' mangled-name='PyObject_CallObject' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2515' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallObject'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2515' column='1'/>
      <parameter type-id='type-id-9' name='a' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2515' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyMapping_HasKey' mangled-name='PyMapping_HasKey' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2497' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_HasKey'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2497' column='1'/>
      <parameter type-id='type-id-9' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2497' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyMapping_HasKeyString' mangled-name='PyMapping_HasKeyString' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2483' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_HasKeyString'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2483' column='1'/>
      <parameter type-id='type-id-86' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2483' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyMapping_SetItemString' mangled-name='PyMapping_SetItemString' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2464' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_SetItemString'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2464' column='1'/>
      <parameter type-id='type-id-86' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2464' column='1'/>
      <parameter type-id='type-id-9' name='value' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2464' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyMapping_Length' mangled-name='PyMapping_Length' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2441' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Length'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2441' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyMapping_Check' mangled-name='PyMapping_Check' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2410' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Check'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2410' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PySequence_Index' mangled-name='PySequence_Index' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2402' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Index'>
      <parameter type-id='type-id-9' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2402' column='1'/>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2402' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PySequence_In' mangled-name='PySequence_In' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2396' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_In'>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2396' column='1'/>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2396' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PySequence_Count' mangled-name='PySequence_Count' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2372' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Count'>
      <parameter type-id='type-id-9' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2372' column='1'/>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2372' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PySequence_Fast' mangled-name='PySequence_Fast' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2257' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Fast'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2257' column='1'/>
      <parameter type-id='type-id-24' name='m' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2257' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PySequence_Tuple' mangled-name='PySequence_Tuple' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Tuple'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2153' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PySequence_DelSlice' mangled-name='PySequence_DelSlice' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_DelSlice'>
      <parameter type-id='type-id-9' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2124' column='1'/>
      <parameter type-id='type-id-7' name='i1' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2124' column='1'/>
      <parameter type-id='type-id-7' name='i2' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2124' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PySequence_SetSlice' mangled-name='PySequence_SetSlice' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2085' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_SetSlice'>
      <parameter type-id='type-id-9' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2085' column='1'/>
      <parameter type-id='type-id-7' name='i1' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2085' column='1'/>
      <parameter type-id='type-id-7' name='i2' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2085' column='1'/>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2085' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PySequence_GetSlice' mangled-name='PySequence_GetSlice' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1996' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_GetSlice'>
      <parameter type-id='type-id-9' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1996' column='1'/>
      <parameter type-id='type-id-7' name='i1' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1996' column='1'/>
      <parameter type-id='type-id-7' name='i2' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1996' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PySequence_InPlaceRepeat' mangled-name='PySequence_InPlaceRepeat' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1943' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_InPlaceRepeat'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1943' column='1'/>
      <parameter type-id='type-id-7' name='count' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1943' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PySequence_InPlaceConcat' mangled-name='PySequence_InPlaceConcat' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1919' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_InPlaceConcat'>
      <parameter type-id='type-id-9' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1919' column='1'/>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1919' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PySequence_Repeat' mangled-name='PySequence_Repeat' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1890' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Repeat'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1890' column='1'/>
      <parameter type-id='type-id-7' name='count' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1890' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PySequence_Concat' mangled-name='PySequence_Concat' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1866' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Concat'>
      <parameter type-id='type-id-9' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1866' column='1'/>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1866' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PySequence_Length' mangled-name='PySequence_Length' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1859' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Length'>
      <parameter type-id='type-id-9' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1859' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyNumber_ToBase' mangled-name='PyNumber_ToBase' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1802' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_ToBase'>
      <parameter type-id='type-id-9' name='n' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1802' column='1'/>
      <parameter type-id='type-id-89' name='base' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1802' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_Float' mangled-name='PyNumber_Float' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1776' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Float'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1776' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_Long' mangled-name='PyNumber_Long' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1696' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Long'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1696' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_Int' mangled-name='PyNumber_Int' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1611' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Int'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1611' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_AsSsize_t' mangled-name='PyNumber_AsSsize_t' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1522' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_AsSsize_t'>
      <parameter type-id='type-id-9' name='item' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1522' column='1'/>
      <parameter type-id='type-id-9' name='err' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1522' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyNumber_Index' mangled-name='PyNumber_Index' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1490' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Index'>
      <parameter type-id='type-id-9' name='item' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1490' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_Absolute' mangled-name='PyNumber_Absolute' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1453' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Absolute'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1453' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_Invert' mangled-name='PyNumber_Invert' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1439' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Invert'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1439' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_Positive' mangled-name='PyNumber_Positive' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1425' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Positive'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1425' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_Negative' mangled-name='PyNumber_Negative' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Negative'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1411' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_InPlacePower' mangled-name='PyNumber_InPlacePower' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1396' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlacePower'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1396' column='1'/>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1396' column='1'/>
      <parameter type-id='type-id-9' name='z' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1396' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceRemainder' mangled-name='PyNumber_InPlaceRemainder' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceRemainder'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1389' column='1'/>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1389' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceMultiply' mangled-name='PyNumber_InPlaceMultiply' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1359' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceMultiply'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1359' column='1'/>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1359' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceAdd' mangled-name='PyNumber_InPlaceAdd' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1337' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceAdd'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1337' column='1'/>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1337' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceTrueDivide' mangled-name='PyNumber_InPlaceTrueDivide' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1329' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceTrueDivide'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1329' column='1'/>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1329' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceFloorDivide' mangled-name='PyNumber_InPlaceFloorDivide' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1321' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceFloorDivide'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1321' column='1'/>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1321' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceDivide' mangled-name='PyNumber_InPlaceDivide' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceDivide'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1318' column='1'/>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1318' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceSubtract' mangled-name='PyNumber_InPlaceSubtract' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1317' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceSubtract'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1317' column='1'/>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1317' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceRshift' mangled-name='PyNumber_InPlaceRshift' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceRshift'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1316' column='1'/>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1316' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceLshift' mangled-name='PyNumber_InPlaceLshift' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1315' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceLshift'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1315' column='1'/>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1315' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceAnd' mangled-name='PyNumber_InPlaceAnd' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1314' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceAnd'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1314' column='1'/>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1314' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceXor' mangled-name='PyNumber_InPlaceXor' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceXor'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1313' column='1'/>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1313' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceOr' mangled-name='PyNumber_InPlaceOr' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1312' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceOr'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1312' column='1'/>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1312' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_Power' mangled-name='PyNumber_Power' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Power'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1253' column='1'/>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1253' column='1'/>
      <parameter type-id='type-id-9' name='z' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1253' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_Remainder' mangled-name='PyNumber_Remainder' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Remainder'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1247' column='1'/>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1247' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_TrueDivide' mangled-name='PyNumber_TrueDivide' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1240' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_TrueDivide'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1240' column='1'/>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1240' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_FloorDivide' mangled-name='PyNumber_FloorDivide' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_FloorDivide'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1233' column='1'/>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1233' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_Multiply' mangled-name='PyNumber_Multiply' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1214' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Multiply'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1214' column='1'/>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1214' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_Add' mangled-name='PyNumber_Add' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1183' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Add'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1183' column='1'/>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1183' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_Divmod' mangled-name='PyNumber_Divmod' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Divmod'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1180' column='1'/>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1180' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_Divide' mangled-name='PyNumber_Divide' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Divide'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1179' column='1'/>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1179' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_Subtract' mangled-name='PyNumber_Subtract' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Subtract'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1178' column='1'/>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1178' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_Rshift' mangled-name='PyNumber_Rshift' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1177' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Rshift'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1177' column='1'/>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1177' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_Lshift' mangled-name='PyNumber_Lshift' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Lshift'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1176' column='1'/>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1176' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_And' mangled-name='PyNumber_And' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1175' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_And'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1175' column='1'/>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1175' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_Xor' mangled-name='PyNumber_Xor' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Xor'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1174' column='1'/>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1174' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_Or' mangled-name='PyNumber_Or' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Or'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1173' column='1'/>
      <parameter type-id='type-id-9' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1173' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_Check' mangled-name='PyNumber_Check' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='883' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Check'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='883' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyObject_Format' mangled-name='PyObject_Format' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='724' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Format'>
      <parameter type-id='type-id-9' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='724' column='1'/>
      <parameter type-id='type-id-9' name='format_spec' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='724' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyBuffer_Release' mangled-name='PyBuffer_Release' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='714' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_Release'>
      <parameter type-id='type-id-156' name='view' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='714' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyBuffer_FillInfo' mangled-name='PyBuffer_FillInfo' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='680' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FillInfo'>
      <parameter type-id='type-id-156' name='view' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='680' column='1'/>
      <parameter type-id='type-id-9' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='680' column='1'/>
      <parameter type-id='type-id-10' name='buf' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='680' column='1'/>
      <parameter type-id='type-id-7' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='680' column='1'/>
      <parameter type-id='type-id-89' name='readonly' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='681' column='1'/>
      <parameter type-id='type-id-89' name='flags' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='681' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyBuffer_FillContiguousStrides' mangled-name='PyBuffer_FillContiguousStrides' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='656' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FillContiguousStrides'>
      <parameter type-id='type-id-89' name='nd' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='656' column='1'/>
      <parameter type-id='type-id-157' name='shape' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='656' column='1'/>
      <parameter type-id='type-id-157' name='strides' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='657' column='1'/>
      <parameter type-id='type-id-89' name='itemsize' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='657' column='1'/>
      <parameter type-id='type-id-91' name='fort' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='658' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyObject_CopyData' mangled-name='PyObject_CopyData' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='585' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CopyData'>
      <parameter type-id='type-id-9' name='dest' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='585' column='1'/>
      <parameter type-id='type-id-9' name='src' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='585' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyBuffer_FromContiguous' mangled-name='PyBuffer_FromContiguous' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='534' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FromContiguous'>
      <parameter type-id='type-id-156' name='view' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='534' column='1'/>
      <parameter type-id='type-id-10' name='buf' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='534' column='1'/>
      <parameter type-id='type-id-7' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='534' column='1'/>
      <parameter type-id='type-id-91' name='fort' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='534' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyBuffer_ToContiguous' mangled-name='PyBuffer_ToContiguous' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='483' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_ToContiguous'>
      <parameter type-id='type-id-10' name='buf' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='483' column='1'/>
      <parameter type-id='type-id-156' name='view' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='483' column='1'/>
      <parameter type-id='type-id-7' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='483' column='1'/>
      <parameter type-id='type-id-91' name='fort' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='483' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='_Py_add_one_to_index_C' mangled-name='_Py_add_one_to_index_C' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='462' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_add_one_to_index_C'>
      <parameter type-id='type-id-89' name='nd' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='462' column='1'/>
      <parameter type-id='type-id-157' name='index' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='462' column='1'/>
      <parameter type-id='type-id-154' name='shape' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='462' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_add_one_to_index_F' mangled-name='_Py_add_one_to_index_F' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='446' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_add_one_to_index_F'>
      <parameter type-id='type-id-89' name='nd' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='446' column='1'/>
      <parameter type-id='type-id-157' name='index' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='446' column='1'/>
      <parameter type-id='type-id-154' name='shape' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='446' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyBuffer_GetPointer' mangled-name='PyBuffer_GetPointer' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_GetPointer'>
      <parameter type-id='type-id-156' name='view' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='430' column='1'/>
      <parameter type-id='type-id-157' name='indices' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='430' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='PyObject_GetBuffer' mangled-name='PyObject_GetBuffer' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='360' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetBuffer'>
      <parameter type-id='type-id-9' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='360' column='1'/>
      <parameter type-id='type-id-156' name='view' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='360' column='1'/>
      <parameter type-id='type-id-89' name='flags' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='360' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyObject_AsWriteBuffer' mangled-name='PyObject_AsWriteBuffer' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='324' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsWriteBuffer'>
      <parameter type-id='type-id-9' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='324' column='1'/>
      <parameter type-id='type-id-158' name='buffer' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='325' column='1'/>
      <parameter type-id='type-id-157' name='buffer_len' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='326' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyObject_AsReadBuffer' mangled-name='PyObject_AsReadBuffer' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsReadBuffer'>
      <parameter type-id='type-id-9' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='291' column='1'/>
      <parameter type-id='type-id-158' name='buffer' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='292' column='1'/>
      <parameter type-id='type-id-157' name='buffer_len' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='293' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyObject_CheckReadBuffer' mangled-name='PyObject_CheckReadBuffer' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CheckReadBuffer'>
      <parameter type-id='type-id-9' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='279' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyObject_DelItemString' mangled-name='PyObject_DelItemString' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_DelItemString'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='227' column='1'/>
      <parameter type-id='type-id-86' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='227' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyObject_Length' mangled-name='PyObject_Length' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Length'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='79' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyObject_Type' mangled-name='PyObject_Type' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Type'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='49' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyObject_Cmp' mangled-name='PyObject_Cmp' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Cmp'>
      <parameter type-id='type-id-9' name='o1' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='33' column='1'/>
      <parameter type-id='type-id-9' name='o2' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='33' column='1'/>
      <parameter type-id='type-id-149' name='result' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='33' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyObject_AsCharBuffer' mangled-name='PyObject_AsCharBuffer' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsCharBuffer'>
      <parameter type-id='type-id-9' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='245' column='1'/>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='246' column='1'/>
      <parameter type-id='type-id-157' name='buffer_len' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='247' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyBuffer_IsContiguous' mangled-name='PyBuffer_IsContiguous' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='414' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_IsContiguous'>
      <parameter type-id='type-id-156' name='view' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='414' column='1'/>
      <parameter type-id='type-id-91' name='fort' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='414' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='_PyNumber_ConvertIntegralToInt' mangled-name='_PyNumber_ConvertIntegralToInt' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1567' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyNumber_ConvertIntegralToInt'>
      <parameter type-id='type-id-9' name='integral' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1567' column='1'/>
      <parameter type-id='type-id-24' name='error_format' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1567' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PySequence_Check' mangled-name='PySequence_Check' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1827' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Check'>
      <parameter type-id='type-id-9' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1827' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PySequence_Size' mangled-name='PySequence_Size' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1840' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Size'>
      <parameter type-id='type-id-9' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1840' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PySequence_GetItem' mangled-name='PySequence_GetItem' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1972' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_GetItem'>
      <parameter type-id='type-id-9' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1972' column='1'/>
      <parameter type-id='type-id-7' name='i' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='1972' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyObject_GetItem' mangled-name='PyObject_GetItem' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetItem'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='135' column='1'/>
      <parameter type-id='type-id-9' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='135' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PySequence_SetItem' mangled-name='PySequence_SetItem' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2031' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_SetItem'>
      <parameter type-id='type-id-9' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2031' column='1'/>
      <parameter type-id='type-id-7' name='i' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2031' column='1'/>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2031' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyObject_SetItem' mangled-name='PyObject_SetItem' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_SetItem'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='163' column='1'/>
      <parameter type-id='type-id-9' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='163' column='1'/>
      <parameter type-id='type-id-9' name='value' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='163' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PySequence_DelItem' mangled-name='PySequence_DelItem' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2058' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_DelItem'>
      <parameter type-id='type-id-9' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2058' column='1'/>
      <parameter type-id='type-id-7' name='i' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2058' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyObject_DelItem' mangled-name='PyObject_DelItem' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_DelItem'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='195' column='1'/>
      <parameter type-id='type-id-9' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='195' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PySequence_List' mangled-name='PySequence_List' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_List'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2235' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyMapping_Size' mangled-name='PyMapping_Size' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2422' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Size'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2422' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyObject_Size' mangled-name='PyObject_Size' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Size'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='61' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyMapping_GetItemString' mangled-name='PyMapping_GetItemString' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2448' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_GetItemString'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2448' column='1'/>
      <parameter type-id='type-id-86' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2448' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_PyObject_LengthHint' mangled-name='_PyObject_LengthHint' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='93' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_LengthHint'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='93' column='1'/>
      <parameter type-id='type-id-7' name='defaultvalue' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='93' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyIter_Next' mangled-name='PyIter_Next' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='3100' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyIter_Next'>
      <parameter type-id='type-id-9' name='iter' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='3100' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_PySequence_IterSearch' mangled-name='_PySequence_IterSearch' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySequence_IterSearch'>
      <parameter type-id='type-id-9' name='seq' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2289' column='1'/>
      <parameter type-id='type-id-9' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2289' column='1'/>
      <parameter type-id='type-id-89' name='operation' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2289' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PySequence_Contains' mangled-name='PySequence_Contains' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2381' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Contains'>
      <parameter type-id='type-id-9' name='seq' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2381' column='1'/>
      <parameter type-id='type-id-9' name='ob' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/abstract.c' line='2381' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <pointer-type-def type-id='type-id-159' size-in-bits='64' id='type-id-156'/>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-157'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-158'/>
    <typedef-decl name='Py_buffer' type-id='type-id-160' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='179' column='1' id='type-id-159'/>
    <class-decl name='bufferinfo' size-in-bits='768' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='164' column='1' id='type-id-160'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf' type-id='type-id-10' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='obj' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='len' type-id='type-id-7' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='itemsize' type-id='type-id-7' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='readonly' type-id='type-id-89' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ndim' type-id='type-id-89' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='format' type-id='type-id-86' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='shape' type-id='type-id-157' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='strides' type-id='type-id-157' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='suboffsets' type-id='type-id-157' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='smalltable' type-id='type-id-161' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='internal' type-id='type-id-10' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='178' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-7' size-in-bits='128' id='type-id-161'>
      <subrange length='2' type-id='type-id-18' id='type-id-162'/>
    </array-type-def>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/boolobject.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <typedef-decl name='PyTypeObject' type-id='type-id-20' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/object.h' line='411' column='1' id='type-id-15'/>
    <typedef-decl name='PyIntObject' type-id='type-id-163' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/intobject.h' line='26' column='1' id='type-id-164'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-164' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/intobject.h' line='23' column='1' id='type-id-163'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_refcnt' type-id='type-id-7' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/intobject.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ob_type' type-id='type-id-23' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/intobject.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ob_ival' type-id='type-id-39' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/intobject.h' line='25' column='1'/>
      </data-member>
    </class-decl>
    <var-decl name='PyBool_Type' type-id='type-id-15' mangled-name='PyBool_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/boolobject.h' line='12' column='1' elf-symbol-id='PyBool_Type'/>
    <var-decl name='_Py_ZeroStruct' type-id='type-id-164' mangled-name='_Py_ZeroStruct' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/boolobject.h' line='20' column='1' elf-symbol-id='_Py_ZeroStruct'/>
    <var-decl name='_Py_TrueStruct' type-id='type-id-164' mangled-name='_Py_TrueStruct' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/boolobject.h' line='20' column='1' elf-symbol-id='_Py_TrueStruct'/>
    <function-decl name='PyBool_FromLong' mangled-name='PyBool_FromLong' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/boolobject.c' line='38' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBool_FromLong'>
      <parameter type-id='type-id-39' name='ok' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/boolobject.c' line='38' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bufferobject.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyBuffer_Type' type-id='type-id-15' mangled-name='PyBuffer_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/bufferobject.h' line='13' column='1' elf-symbol-id='PyBuffer_Type'/>
    <function-decl name='PyBuffer_New' mangled-name='PyBuffer_New' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bufferobject.c' line='200' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_New'>
      <parameter type-id='type-id-7' name='size' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bufferobject.c' line='200' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyBuffer_FromReadWriteMemory' mangled-name='PyBuffer_FromReadWriteMemory' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bufferobject.c' line='194' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FromReadWriteMemory'>
      <parameter type-id='type-id-10' name='ptr' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bufferobject.c' line='194' column='1'/>
      <parameter type-id='type-id-7' name='size' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bufferobject.c' line='194' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyBuffer_FromMemory' mangled-name='PyBuffer_FromMemory' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bufferobject.c' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FromMemory'>
      <parameter type-id='type-id-10' name='ptr' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bufferobject.c' line='188' column='1'/>
      <parameter type-id='type-id-7' name='size' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bufferobject.c' line='188' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyBuffer_FromReadWriteObject' mangled-name='PyBuffer_FromReadWriteObject' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bufferobject.c' line='172' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FromReadWriteObject'>
      <parameter type-id='type-id-9' name='base' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bufferobject.c' line='172' column='1'/>
      <parameter type-id='type-id-7' name='offset' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bufferobject.c' line='172' column='1'/>
      <parameter type-id='type-id-7' name='size' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bufferobject.c' line='172' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyBuffer_FromObject' mangled-name='PyBuffer_FromObject' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bufferobject.c' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FromObject'>
      <parameter type-id='type-id-9' name='base' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bufferobject.c' line='156' column='1'/>
      <parameter type-id='type-id-7' name='offset' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bufferobject.c' line='156' column='1'/>
      <parameter type-id='type-id-7' name='size' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bufferobject.c' line='156' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytearrayobject.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-91' size-in-bits='infinite' id='type-id-165'>
      <subrange length='infinite' id='type-id-166'/>
    </array-type-def>
    <var-decl name='_PyByteArray_empty_string' type-id='type-id-165' mangled-name='_PyByteArray_empty_string' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/bytearrayobject.h' line='52' column='1' elf-symbol-id='_PyByteArray_empty_string'/>
    <var-decl name='PyByteArray_Type' type-id='type-id-15' mangled-name='PyByteArray_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/bytearrayobject.h' line='31' column='1' elf-symbol-id='PyByteArray_Type'/>
    <var-decl name='PyByteArrayIter_Type' type-id='type-id-15' mangled-name='PyByteArrayIter_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/bytearrayobject.h' line='32' column='1' elf-symbol-id='PyByteArrayIter_Type'/>
    <function-decl name='PyByteArray_Concat' mangled-name='PyByteArray_Concat' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytearrayobject.c' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Concat'>
      <parameter type-id='type-id-9' name='a' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytearrayobject.c' line='274' column='1'/>
      <parameter type-id='type-id-9' name='b' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytearrayobject.c' line='274' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyByteArray_Resize' mangled-name='PyByteArray_Resize' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytearrayobject.c' line='224' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Resize'>
      <parameter type-id='type-id-9' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytearrayobject.c' line='224' column='1'/>
      <parameter type-id='type-id-7' name='size' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytearrayobject.c' line='224' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyByteArray_AsString' mangled-name='PyByteArray_AsString' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytearrayobject.c' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_AsString'>
      <parameter type-id='type-id-9' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytearrayobject.c' line='215' column='1'/>
      <return type-id='type-id-86'/>
    </function-decl>
    <function-decl name='PyByteArray_Size' mangled-name='PyByteArray_Size' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytearrayobject.c' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Size'>
      <parameter type-id='type-id-9' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytearrayobject.c' line='206' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyByteArray_FromStringAndSize' mangled-name='PyByteArray_FromStringAndSize' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytearrayobject.c' line='168' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_FromStringAndSize'>
      <parameter type-id='type-id-24' name='bytes' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytearrayobject.c' line='168' column='1'/>
      <parameter type-id='type-id-7' name='size' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytearrayobject.c' line='168' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyByteArray_FromObject' mangled-name='PyByteArray_FromObject' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytearrayobject.c' line='161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_FromObject'>
      <parameter type-id='type-id-9' name='input' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytearrayobject.c' line='161' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyByteArray_Init' mangled-name='PyByteArray_Init' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytearrayobject.c' line='16' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Init'>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyByteArray_Fini' mangled-name='PyByteArray_Fini' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytearrayobject.c' line='11' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Fini'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-62' size-in-bits='infinite' id='type-id-167'>
      <subrange length='infinite' id='type-id-166'/>
    </array-type-def>
    <var-decl name='_Py_isspace__doc__' type-id='type-id-167' mangled-name='_Py_isspace__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/bytes_methods.h' line='24' column='1' elf-symbol-id='_Py_isspace__doc__'/>
    <var-decl name='_Py_isalpha__doc__' type-id='type-id-167' mangled-name='_Py_isalpha__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/bytes_methods.h' line='25' column='1' elf-symbol-id='_Py_isalpha__doc__'/>
    <var-decl name='_Py_isalnum__doc__' type-id='type-id-167' mangled-name='_Py_isalnum__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/bytes_methods.h' line='26' column='1' elf-symbol-id='_Py_isalnum__doc__'/>
    <var-decl name='_Py_isdigit__doc__' type-id='type-id-167' mangled-name='_Py_isdigit__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/bytes_methods.h' line='27' column='1' elf-symbol-id='_Py_isdigit__doc__'/>
    <var-decl name='_Py_islower__doc__' type-id='type-id-167' mangled-name='_Py_islower__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/bytes_methods.h' line='28' column='1' elf-symbol-id='_Py_islower__doc__'/>
    <var-decl name='_Py_isupper__doc__' type-id='type-id-167' mangled-name='_Py_isupper__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/bytes_methods.h' line='29' column='1' elf-symbol-id='_Py_isupper__doc__'/>
    <var-decl name='_Py_istitle__doc__' type-id='type-id-167' mangled-name='_Py_istitle__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/bytes_methods.h' line='30' column='1' elf-symbol-id='_Py_istitle__doc__'/>
    <var-decl name='_Py_lower__doc__' type-id='type-id-167' mangled-name='_Py_lower__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/bytes_methods.h' line='31' column='1' elf-symbol-id='_Py_lower__doc__'/>
    <var-decl name='_Py_upper__doc__' type-id='type-id-167' mangled-name='_Py_upper__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/bytes_methods.h' line='32' column='1' elf-symbol-id='_Py_upper__doc__'/>
    <var-decl name='_Py_title__doc__' type-id='type-id-167' mangled-name='_Py_title__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/bytes_methods.h' line='33' column='1' elf-symbol-id='_Py_title__doc__'/>
    <var-decl name='_Py_capitalize__doc__' type-id='type-id-167' mangled-name='_Py_capitalize__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/bytes_methods.h' line='34' column='1' elf-symbol-id='_Py_capitalize__doc__'/>
    <var-decl name='_Py_swapcase__doc__' type-id='type-id-167' mangled-name='_Py_swapcase__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/bytes_methods.h' line='35' column='1' elf-symbol-id='_Py_swapcase__doc__'/>
    <function-decl name='_Py_bytes_swapcase' mangled-name='_Py_bytes_swapcase' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='375' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_swapcase'>
      <parameter type-id='type-id-86' name='result' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='375' column='1'/>
      <parameter type-id='type-id-86' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='375' column='1'/>
      <parameter type-id='type-id-7' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='375' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_capitalize' mangled-name='_Py_bytes_capitalize' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='339' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_capitalize'>
      <parameter type-id='type-id-86' name='result' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='339' column='1'/>
      <parameter type-id='type-id-86' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='339' column='1'/>
      <parameter type-id='type-id-7' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='339' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_title' mangled-name='_Py_bytes_title' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='304' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_title'>
      <parameter type-id='type-id-86' name='result' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='304' column='1'/>
      <parameter type-id='type-id-86' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='304' column='1'/>
      <parameter type-id='type-id-7' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='304' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_upper' mangled-name='_Py_bytes_upper' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='275' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_upper'>
      <parameter type-id='type-id-86' name='result' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='275' column='1'/>
      <parameter type-id='type-id-24' name='cptr' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='275' column='1'/>
      <parameter type-id='type-id-7' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='275' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_lower' mangled-name='_Py_bytes_lower' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_lower'>
      <parameter type-id='type-id-86' name='result' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='247' column='1'/>
      <parameter type-id='type-id-24' name='cptr' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='247' column='1'/>
      <parameter type-id='type-id-7' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='247' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_istitle' mangled-name='_Py_bytes_istitle' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_istitle'>
      <parameter type-id='type-id-24' name='cptr' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='201' column='1'/>
      <parameter type-id='type-id-7' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='201' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_Py_bytes_isupper' mangled-name='_Py_bytes_isupper' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_isupper'>
      <parameter type-id='type-id-24' name='cptr' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='165' column='1'/>
      <parameter type-id='type-id-7' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='165' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_Py_bytes_islower' mangled-name='_Py_bytes_islower' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_islower'>
      <parameter type-id='type-id-24' name='cptr' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='131' column='1'/>
      <parameter type-id='type-id-7' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='131' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_Py_bytes_isdigit' mangled-name='_Py_bytes_isdigit' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_isdigit'>
      <parameter type-id='type-id-24' name='cptr' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='101' column='1'/>
      <parameter type-id='type-id-7' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='101' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_Py_bytes_isalnum' mangled-name='_Py_bytes_isalnum' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_isalnum'>
      <parameter type-id='type-id-24' name='cptr' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='71' column='1'/>
      <parameter type-id='type-id-7' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='71' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_Py_bytes_isalpha' mangled-name='_Py_bytes_isalpha' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_isalpha'>
      <parameter type-id='type-id-24' name='cptr' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='41' column='1'/>
      <parameter type-id='type-id-7' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='41' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_Py_bytes_isspace' mangled-name='_Py_bytes_isspace' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='11' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_isspace'>
      <parameter type-id='type-id-24' name='cptr' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='11' column='1'/>
      <parameter type-id='type-id-7' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/bytes_methods.c' line='11' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <typedef-decl name='PyCapsule_Destructor' type-id='type-id-67' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pycapsule.h' line='23' column='1' id='type-id-168'/>
    <var-decl name='PyCapsule_Type' type-id='type-id-15' mangled-name='PyCapsule_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pycapsule.h' line='21' column='1' elf-symbol-id='PyCapsule_Type'/>
    <function-decl name='PyCapsule_Import' mangled-name='PyCapsule_Import' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_Import'>
      <parameter type-id='type-id-24' name='name' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='195' column='1'/>
      <parameter type-id='type-id-89' name='no_block' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='195' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='PyCapsule_SetContext' mangled-name='PyCapsule_SetContext' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_SetContext'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='181' column='1'/>
      <parameter type-id='type-id-10' name='context' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='181' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyCapsule_SetDestructor' mangled-name='PyCapsule_SetDestructor' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_SetDestructor'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='167' column='1'/>
      <parameter type-id='type-id-168' name='destructor' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='167' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyCapsule_SetName' mangled-name='PyCapsule_SetName' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_SetName'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='153' column='1'/>
      <parameter type-id='type-id-24' name='name' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='153' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyCapsule_SetPointer' mangled-name='PyCapsule_SetPointer' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_SetPointer'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='134' column='1'/>
      <parameter type-id='type-id-10' name='pointer' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='134' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyCapsule_GetContext' mangled-name='PyCapsule_GetContext' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_GetContext'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='122' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='PyCapsule_GetDestructor' mangled-name='PyCapsule_GetDestructor' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_GetDestructor'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='110' column='1'/>
      <return type-id='type-id-168'/>
    </function-decl>
    <function-decl name='PyCapsule_GetName' mangled-name='PyCapsule_GetName' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_GetName'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='98' column='1'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='PyCapsule_GetPointer' mangled-name='PyCapsule_GetPointer' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_GetPointer'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='80' column='1'/>
      <parameter type-id='type-id-24' name='name' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='80' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='PyCapsule_New' mangled-name='PyCapsule_New' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_New'>
      <parameter type-id='type-id-10' name='pointer' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='44' column='1'/>
      <parameter type-id='type-id-24' name='name' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='44' column='1'/>
      <parameter type-id='type-id-168' name='destructor' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='44' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyCapsule_IsValid' mangled-name='PyCapsule_IsValid' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_IsValid'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='68' column='1'/>
      <parameter type-id='type-id-24' name='name' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/capsule.c' line='68' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/cellobject.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyCell_Type' type-id='type-id-15' mangled-name='PyCell_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/cellobject.h' line='14' column='1' elf-symbol-id='PyCell_Type'/>
    <function-decl name='PyCell_Set' mangled-name='PyCell_Set' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/cellobject.c' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCell_Set'>
      <parameter type-id='type-id-9' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/cellobject.c' line='32' column='1'/>
      <parameter type-id='type-id-9' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/cellobject.c' line='32' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyCell_Get' mangled-name='PyCell_Get' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/cellobject.c' line='21' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCell_Get'>
      <parameter type-id='type-id-9' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/cellobject.c' line='21' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyCell_New' mangled-name='PyCell_New' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/cellobject.c' line='6' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCell_New'>
      <parameter type-id='type-id-9' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/cellobject.c' line='6' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyClass_Type' type-id='type-id-15' mangled-name='PyClass_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/classobject.h' line='39' column='1' elf-symbol-id='PyClass_Type'/>
    <var-decl name='PyInstance_Type' type-id='type-id-15' mangled-name='PyInstance_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/classobject.h' line='39' column='1' elf-symbol-id='PyInstance_Type'/>
    <var-decl name='PyMethod_Type' type-id='type-id-15' mangled-name='PyMethod_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/classobject.h' line='39' column='1' elf-symbol-id='PyMethod_Type'/>
    <function-decl name='PyMethod_Fini' mangled-name='PyMethod_Fini' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='2693' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMethod_Fini'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyMethod_ClearFreeList' mangled-name='PyMethod_ClearFreeList' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='2678' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMethod_ClearFreeList'>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyMethod_New' mangled-name='PyMethod_New' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='2253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMethod_New'>
      <parameter type-id='type-id-9' name='func' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='2253' column='1'/>
      <parameter type-id='type-id-9' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='2253' column='1'/>
      <parameter type-id='type-id-9' name='klass' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='2253' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_PyInstance_Lookup' mangled-name='_PyInstance_Lookup' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='793' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyInstance_Lookup'>
      <parameter type-id='type-id-9' name='pinst' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='793' column='1'/>
      <parameter type-id='type-id-9' name='name' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='793' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyInstance_New' mangled-name='PyInstance_New' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='550' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInstance_New'>
      <parameter type-id='type-id-9' name='klass' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='550' column='1'/>
      <parameter type-id='type-id-9' name='arg' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='550' column='1'/>
      <parameter type-id='type-id-9' name='kw' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='550' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyInstance_NewRaw' mangled-name='PyInstance_NewRaw' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='516' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInstance_NewRaw'>
      <parameter type-id='type-id-9' name='klass' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='516' column='1'/>
      <parameter type-id='type-id-9' name='dict' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='516' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyMethod_Class' mangled-name='PyMethod_Class' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMethod_Class'>
      <parameter type-id='type-id-9' name='im' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='159' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyMethod_Self' mangled-name='PyMethod_Self' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMethod_Self'>
      <parameter type-id='type-id-9' name='im' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='149' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyMethod_Function' mangled-name='PyMethod_Function' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='139' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMethod_Function'>
      <parameter type-id='type-id-9' name='im' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='139' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyClass_New' mangled-name='PyClass_New' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyClass_New'>
      <parameter type-id='type-id-9' name='bases' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='29' column='1'/>
      <parameter type-id='type-id-9' name='dict' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='29' column='1'/>
      <parameter type-id='type-id-9' name='name' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='29' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyClass_IsSubclass' mangled-name='PyClass_IsSubclass' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='487' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyClass_IsSubclass'>
      <parameter type-id='type-id-9' name='klass' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='487' column='1'/>
      <parameter type-id='type-id-9' name='base' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/classobject.c' line='487' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/cobject.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-170'/>
    <var-decl name='PyCObject_Type' type-id='type-id-15' mangled-name='PyCObject_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/cobject.h' line='43' column='1' elf-symbol-id='PyCObject_Type'/>
    <function-decl name='PyCObject_SetVoidPtr' mangled-name='PyCObject_SetVoidPtr' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/cobject.c' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCObject_SetVoidPtr'>
      <parameter type-id='type-id-9' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/cobject.c' line='115' column='1'/>
      <parameter type-id='type-id-10' name='cobj' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/cobject.c' line='115' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyCObject_Import' mangled-name='PyCObject_Import' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/cobject.c' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCObject_Import'>
      <parameter type-id='type-id-86' name='module_name' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/cobject.c' line='99' column='1'/>
      <parameter type-id='type-id-86' name='name' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/cobject.c' line='99' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='PyCObject_GetDesc' mangled-name='PyCObject_GetDesc' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/cobject.c' line='84' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCObject_GetDesc'>
      <parameter type-id='type-id-9' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/cobject.c' line='84' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='PyCObject_FromVoidPtrAndDesc' mangled-name='PyCObject_FromVoidPtrAndDesc' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/cobject.c' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCObject_FromVoidPtrAndDesc'>
      <parameter type-id='type-id-10' name='cobj' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/cobject.c' line='39' column='1'/>
      <parameter type-id='type-id-10' name='desc' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/cobject.c' line='39' column='1'/>
      <parameter type-id='type-id-170' name='destr' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/cobject.c' line='40' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyCObject_FromVoidPtr' mangled-name='PyCObject_FromVoidPtr' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/cobject.c' line='20' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCObject_FromVoidPtr'>
      <parameter type-id='type-id-10' name='cobj' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/cobject.c' line='20' column='1'/>
      <parameter type-id='type-id-68' name='destr' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/cobject.c' line='20' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyCObject_AsVoidPtr' mangled-name='PyCObject_AsVoidPtr' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/cobject.c' line='65' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCObject_AsVoidPtr'>
      <parameter type-id='type-id-9' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/cobject.c' line='65' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-169'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-1'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/codeobject.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <typedef-decl name='PyCodeObject' type-id='type-id-171' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/code.h' line='30' column='1' id='type-id-172'/>
    <class-decl name='__anonymous_struct__' size-in-bits='1024' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-172' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/code.h' line='10' column='1' id='type-id-171'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_refcnt' type-id='type-id-7' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/code.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ob_type' type-id='type-id-23' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/code.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='co_argcount' type-id='type-id-89' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/code.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='co_nlocals' type-id='type-id-89' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/code.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='co_stacksize' type-id='type-id-89' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/code.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='co_flags' type-id='type-id-89' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/code.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='co_code' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/code.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='co_consts' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/code.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='co_names' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/code.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='co_varnames' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/code.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='co_freevars' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/code.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='co_cellvars' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/code.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='co_filename' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/code.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='co_name' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/code.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='co_firstlineno' type-id='type-id-89' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/code.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='co_lnotab' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/code.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='co_zombieframe' type-id='type-id-10' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/code.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='co_weakreflist' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/code.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyAddrPair' type-id='type-id-173' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/code.h' line='93' column='1' id='type-id-174'/>
    <class-decl name='_addr_pair' size-in-bits='64' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/code.h' line='90' column='1' id='type-id-173'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ap_lower' type-id='type-id-89' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/code.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ap_upper' type-id='type-id-89' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/code.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-175'/>
    <pointer-type-def type-id='type-id-172' size-in-bits='64' id='type-id-176'/>
    <var-decl name='PyCode_Type' type-id='type-id-15' mangled-name='PyCode_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/code.h' line='65' column='1' elf-symbol-id='PyCode_Type'/>
    <function-decl name='_PyCode_CheckLineNumber' mangled-name='_PyCode_CheckLineNumber' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/codeobject.c' line='536' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyCode_CheckLineNumber'>
      <parameter type-id='type-id-176' name='co' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/codeobject.c' line='536' column='1'/>
      <parameter type-id='type-id-89' name='lasti' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/codeobject.c' line='536' column='1'/>
      <parameter type-id='type-id-175' name='bounds' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/codeobject.c' line='536' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyCode_Addr2Line' mangled-name='PyCode_Addr2Line' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/codeobject.c' line='518' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCode_Addr2Line'>
      <parameter type-id='type-id-176' name='co' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/codeobject.c' line='518' column='1'/>
      <parameter type-id='type-id-89' name='addrq' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/codeobject.c' line='518' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyCode_NewEmpty' mangled-name='PyCode_NewEmpty' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/codeobject.c' line='112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCode_NewEmpty'>
      <parameter type-id='type-id-24' name='filename' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/codeobject.c' line='112' column='1'/>
      <parameter type-id='type-id-24' name='funcname' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/codeobject.c' line='112' column='1'/>
      <parameter type-id='type-id-89' name='firstlineno' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/codeobject.c' line='112' column='1'/>
      <return type-id='type-id-176'/>
    </function-decl>
    <function-decl name='PyCode_New' mangled-name='PyCode_New' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/codeobject.c' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCode_New'>
      <parameter type-id='type-id-89' name='argcount' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/codeobject.c' line='44' column='1'/>
      <parameter type-id='type-id-89' name='nlocals' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/codeobject.c' line='44' column='1'/>
      <parameter type-id='type-id-89' name='stacksize' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/codeobject.c' line='44' column='1'/>
      <parameter type-id='type-id-89' name='flags' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/codeobject.c' line='44' column='1'/>
      <parameter type-id='type-id-9' name='code' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/codeobject.c' line='45' column='1'/>
      <parameter type-id='type-id-9' name='consts' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/codeobject.c' line='45' column='1'/>
      <parameter type-id='type-id-9' name='names' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/codeobject.c' line='45' column='1'/>
      <parameter type-id='type-id-9' name='varnames' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/codeobject.c' line='46' column='1'/>
      <parameter type-id='type-id-9' name='freevars' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/codeobject.c' line='46' column='1'/>
      <parameter type-id='type-id-9' name='cellvars' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/codeobject.c' line='46' column='1'/>
      <parameter type-id='type-id-9' name='filename' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/codeobject.c' line='47' column='1'/>
      <parameter type-id='type-id-9' name='name' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/codeobject.c' line='47' column='1'/>
      <parameter type-id='type-id-89' name='firstlineno' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/codeobject.c' line='47' column='1'/>
      <parameter type-id='type-id-9' name='lnotab' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/codeobject.c' line='48' column='1'/>
      <return type-id='type-id-176'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <type-decl name='double' size-in-bits='64' id='type-id-177'/>
    <typedef-decl name='Py_complex' type-id='type-id-178' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/complexobject.h' line='12' column='1' id='type-id-179'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-179' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/complexobject.h' line='9' column='1' id='type-id-178'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='real' type-id='type-id-177' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/complexobject.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='imag' type-id='type-id-177' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/complexobject.h' line='11' column='1'/>
      </data-member>
    </class-decl>
    <var-decl name='PyComplex_Type' type-id='type-id-15' mangled-name='PyComplex_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/complexobject.h' line='45' column='1' elf-symbol-id='PyComplex_Type'/>
    <function-decl name='PyComplex_AsCComplex' mangled-name='PyComplex_AsCComplex' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyComplex_AsCComplex'>
      <parameter type-id='type-id-9' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='320' column='1'/>
      <return type-id='type-id-179'/>
    </function-decl>
    <function-decl name='PyComplex_ImagAsDouble' mangled-name='PyComplex_ImagAsDouble' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='277' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyComplex_ImagAsDouble'>
      <parameter type-id='type-id-9' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='277' column='1'/>
      <return type-id='type-id-177'/>
    </function-decl>
    <function-decl name='PyComplex_RealAsDouble' mangled-name='PyComplex_RealAsDouble' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='266' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyComplex_RealAsDouble'>
      <parameter type-id='type-id-9' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='266' column='1'/>
      <return type-id='type-id-177'/>
    </function-decl>
    <function-decl name='PyComplex_FromDoubles' mangled-name='PyComplex_FromDoubles' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='257' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyComplex_FromDoubles'>
      <parameter type-id='type-id-177' name='real' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='257' column='1'/>
      <parameter type-id='type-id-177' name='imag' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='257' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyComplex_FromCComplex' mangled-name='PyComplex_FromCComplex' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='234' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyComplex_FromCComplex'>
      <parameter type-id='type-id-179' name='cval' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='234' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_Py_c_abs' mangled-name='_Py_c_abs' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_c_abs'>
      <parameter type-id='type-id-179' name='z' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='191' column='1'/>
      <return type-id='type-id-177'/>
    </function-decl>
    <function-decl name='_Py_c_pow' mangled-name='_Py_c_pow' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_c_pow'>
      <parameter type-id='type-id-179' name='a' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='128' column='1'/>
      <parameter type-id='type-id-179' name='b' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='128' column='1'/>
      <return type-id='type-id-179'/>
    </function-decl>
    <function-decl name='_Py_c_quot' mangled-name='_Py_c_quot' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_c_quot'>
      <parameter type-id='type-id-179' name='a' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='70' column='1'/>
      <parameter type-id='type-id-179' name='b' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='70' column='1'/>
      <return type-id='type-id-179'/>
    </function-decl>
    <function-decl name='_Py_c_prod' mangled-name='_Py_c_prod' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_c_prod'>
      <parameter type-id='type-id-179' name='a' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='61' column='1'/>
      <parameter type-id='type-id-179' name='b' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='61' column='1'/>
      <return type-id='type-id-179'/>
    </function-decl>
    <function-decl name='_Py_c_neg' mangled-name='_Py_c_neg' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_c_neg'>
      <parameter type-id='type-id-179' name='a' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='52' column='1'/>
      <return type-id='type-id-179'/>
    </function-decl>
    <function-decl name='_Py_c_diff' mangled-name='_Py_c_diff' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_c_diff'>
      <parameter type-id='type-id-179' name='a' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='43' column='1'/>
      <parameter type-id='type-id-179' name='b' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='43' column='1'/>
      <return type-id='type-id-179'/>
    </function-decl>
    <function-decl name='_Py_c_sum' mangled-name='_Py_c_sum' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='34' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_c_sum'>
      <parameter type-id='type-id-179' name='a' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='34' column='1'/>
      <parameter type-id='type-id-179' name='b' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/complexobject.c' line='34' column='1'/>
      <return type-id='type-id-179'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/descrobject.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <class-decl name='wrapperbase' size-in-bits='448' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/descrobject.h' line='25' column='1' id='type-id-180'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-86' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/descrobject.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='offset' type-id='type-id-89' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/descrobject.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='function' type-id='type-id-10' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/descrobject.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='wrapper' type-id='type-id-181' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/descrobject.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='doc' type-id='type-id-86' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/descrobject.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='flags' type-id='type-id-89' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/descrobject.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='name_strobj' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/descrobject.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wrapperfunc' type-id='type-id-182' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/descrobject.h' line='19' column='1' id='type-id-181'/>
    <typedef-decl name='PyGetSetDef' type-id='type-id-56' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/descrobject.h' line='17' column='1' id='type-id-183'/>
    <typedef-decl name='PyMemberDef' type-id='type-id-58' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/structmember.h' line='43' column='1' id='type-id-184'/>
    <typedef-decl name='PyMethodDef' type-id='type-id-59' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/methodobject.h' line='44' column='1' id='type-id-185'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' id='type-id-182'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-12'/>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-187'/>
    <var-decl name='PyMemberDescr_Type' type-id='type-id-15' mangled-name='PyMemberDescr_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/descrobject.h' line='73' column='1' elf-symbol-id='PyMemberDescr_Type'/>
    <var-decl name='PyGetSetDescr_Type' type-id='type-id-15' mangled-name='PyGetSetDescr_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/descrobject.h' line='72' column='1' elf-symbol-id='PyGetSetDescr_Type'/>
    <var-decl name='PyWrapperDescr_Type' type-id='type-id-15' mangled-name='PyWrapperDescr_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/descrobject.h' line='70' column='1' elf-symbol-id='PyWrapperDescr_Type'/>
    <var-decl name='PyDictProxy_Type' type-id='type-id-15' mangled-name='PyDictProxy_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/descrobject.h' line='71' column='1' elf-symbol-id='PyDictProxy_Type'/>
    <var-decl name='PyProperty_Type' type-id='type-id-15' mangled-name='PyProperty_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/descrobject.h' line='89' column='1' elf-symbol-id='PyProperty_Type'/>
    <function-decl name='PyWrapper_New' mangled-name='PyWrapper_New' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/descrobject.c' line='1095' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyWrapper_New'>
      <parameter type-id='type-id-9' name='d' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/descrobject.c' line='1095' column='1'/>
      <parameter type-id='type-id-9' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/descrobject.c' line='1095' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyDictProxy_New' mangled-name='PyDictProxy_New' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/descrobject.c' line='914' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDictProxy_New'>
      <parameter type-id='type-id-9' name='dict' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/descrobject.c' line='914' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyDescr_NewWrapper' mangled-name='PyDescr_NewWrapper' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/descrobject.c' line='676' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDescr_NewWrapper'>
      <parameter type-id='type-id-12' name='type' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/descrobject.c' line='676' column='1'/>
      <parameter type-id='type-id-187' name='base' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/descrobject.c' line='676' column='1'/>
      <parameter type-id='type-id-10' name='wrapped' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/descrobject.c' line='676' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyDescr_NewGetSet' mangled-name='PyDescr_NewGetSet' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/descrobject.c' line='664' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDescr_NewGetSet'>
      <parameter type-id='type-id-12' name='type' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/descrobject.c' line='664' column='1'/>
      <parameter type-id='type-id-47' name='getset' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/descrobject.c' line='664' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyDescr_NewMember' mangled-name='PyDescr_NewMember' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/descrobject.c' line='652' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDescr_NewMember'>
      <parameter type-id='type-id-12' name='type' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/descrobject.c' line='652' column='1'/>
      <parameter type-id='type-id-46' name='member' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/descrobject.c' line='652' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyDescr_NewClassMethod' mangled-name='PyDescr_NewClassMethod' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/descrobject.c' line='640' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDescr_NewClassMethod'>
      <parameter type-id='type-id-12' name='type' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/descrobject.c' line='640' column='1'/>
      <parameter type-id='type-id-45' name='method' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/descrobject.c' line='640' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyDescr_NewMethod' mangled-name='PyDescr_NewMethod' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/descrobject.c' line='628' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDescr_NewMethod'>
      <parameter type-id='type-id-12' name='type' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/descrobject.c' line='628' column='1'/>
      <parameter type-id='type-id-45' name='method' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/descrobject.c' line='628' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-186'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-9'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-188'/>
    <var-decl name='PyDict_Type' type-id='type-id-15' mangled-name='PyDict_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/dictobject.h' line='91' column='1' elf-symbol-id='PyDict_Type'/>
    <var-decl name='PyDictIterKey_Type' type-id='type-id-15' mangled-name='PyDictIterKey_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/dictobject.h' line='92' column='1' elf-symbol-id='PyDictIterKey_Type'/>
    <var-decl name='PyDictIterValue_Type' type-id='type-id-15' mangled-name='PyDictIterValue_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/dictobject.h' line='93' column='1' elf-symbol-id='PyDictIterValue_Type'/>
    <var-decl name='PyDictIterItem_Type' type-id='type-id-15' mangled-name='PyDictIterItem_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/dictobject.h' line='94' column='1' elf-symbol-id='PyDictIterItem_Type'/>
    <var-decl name='PyDictKeys_Type' type-id='type-id-15' mangled-name='PyDictKeys_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/dictobject.h' line='95' column='1' elf-symbol-id='PyDictKeys_Type'/>
    <var-decl name='PyDictItems_Type' type-id='type-id-15' mangled-name='PyDictItems_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/dictobject.h' line='96' column='1' elf-symbol-id='PyDictItems_Type'/>
    <var-decl name='PyDictValues_Type' type-id='type-id-15' mangled-name='PyDictValues_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/dictobject.h' line='97' column='1' elf-symbol-id='PyDictValues_Type'/>
    <function-decl name='PyDict_DelItemString' mangled-name='PyDict_DelItemString' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='2445' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_DelItemString'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='2445' column='1'/>
      <parameter type-id='type-id-24' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='2445' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyDict_SetItemString' mangled-name='PyDict_SetItemString' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='2431' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_SetItemString'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='2431' column='1'/>
      <parameter type-id='type-id-24' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='2431' column='1'/>
      <parameter type-id='type-id-9' name='item' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='2431' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyDict_GetItemString' mangled-name='PyDict_GetItemString' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='2419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_GetItemString'>
      <parameter type-id='type-id-9' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='2419' column='1'/>
      <parameter type-id='type-id-24' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='2419' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_PyDict_Contains' mangled-name='_PyDict_Contains' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='2298' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_Contains'>
      <parameter type-id='type-id-9' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='2298' column='1'/>
      <parameter type-id='type-id-9' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='2298' column='1'/>
      <parameter type-id='type-id-39' name='hash' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='2298' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyDict_Contains' mangled-name='PyDict_Contains' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='2280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_Contains'>
      <parameter type-id='type-id-9' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='2280' column='1'/>
      <parameter type-id='type-id-9' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='2280' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyDict_Items' mangled-name='PyDict_Items' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='1701' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_Items'>
      <parameter type-id='type-id-9' name='mp' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='1701' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyDict_Values' mangled-name='PyDict_Values' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='1691' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_Values'>
      <parameter type-id='type-id-9' name='mp' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='1691' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyDict_Keys' mangled-name='PyDict_Keys' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='1681' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_Keys'>
      <parameter type-id='type-id-9' name='mp' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='1681' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyDict_Size' mangled-name='PyDict_Size' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='1671' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_Size'>
      <parameter type-id='type-id-9' name='mp' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='1671' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyDict_Merge' mangled-name='PyDict_Merge' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='1550' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_Merge'>
      <parameter type-id='type-id-9' name='a' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='1550' column='1'/>
      <parameter type-id='type-id-9' name='b' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='1550' column='1'/>
      <parameter type-id='type-id-89' name='override' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='1550' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyDict_Update' mangled-name='PyDict_Update' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='1544' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_Update'>
      <parameter type-id='type-id-9' name='a' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='1544' column='1'/>
      <parameter type-id='type-id-9' name='b' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='1544' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyDict_MergeFromSeq2' mangled-name='PyDict_MergeFromSeq2' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='1474' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_MergeFromSeq2'>
      <parameter type-id='type-id-9' name='d' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='1474' column='1'/>
      <parameter type-id='type-id-9' name='seq2' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='1474' column='1'/>
      <parameter type-id='type-id-89' name='override' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='1474' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyDict_DelItem' mangled-name='PyDict_DelItem' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='822' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_DelItem'>
      <parameter type-id='type-id-9' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='822' column='1'/>
      <parameter type-id='type-id-9' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='822' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyDict_GetItem' mangled-name='PyDict_GetItem' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='708' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_GetItem'>
      <parameter type-id='type-id-9' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='708' column='1'/>
      <parameter type-id='type-id-9' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='708' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_PyDict_NewPresized' mangled-name='_PyDict_NewPresized' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='686' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_NewPresized'>
      <parameter type-id='type-id-7' name='minused' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='686' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_PyDict_MaybeUntrack' mangled-name='_PyDict_MaybeUntrack' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='481' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_MaybeUntrack'>
      <parameter type-id='type-id-9' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='481' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyDict_New' mangled-name='PyDict_New' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_New'>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyDict_Fini' mangled-name='PyDict_Fini' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_Fini'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyDict_SetItem' mangled-name='PyDict_SetItem' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='798' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_SetItem'>
      <parameter type-id='type-id-9' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='798' column='1'/>
      <parameter type-id='type-id-9' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='798' column='1'/>
      <parameter type-id='type-id-9' name='value' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='798' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyDict_Clear' mangled-name='PyDict_Clear' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='860' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_Clear'>
      <parameter type-id='type-id-9' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='860' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyDict_Next' mangled-name='PyDict_Next' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='944' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_Next'>
      <parameter type-id='type-id-9' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='944' column='1'/>
      <parameter type-id='type-id-157' name='ppos' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='944' column='1'/>
      <parameter type-id='type-id-189' name='pkey' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='944' column='1'/>
      <parameter type-id='type-id-189' name='pvalue' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='944' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='_PyDict_Next' mangled-name='_PyDict_Next' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='971' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyDict_Next'>
      <parameter type-id='type-id-9' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='971' column='1'/>
      <parameter type-id='type-id-157' name='ppos' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='971' column='1'/>
      <parameter type-id='type-id-189' name='pkey' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='971' column='1'/>
      <parameter type-id='type-id-189' name='pvalue' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='971' column='1'/>
      <parameter type-id='type-id-188' name='phash' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='971' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='PyDict_Copy' mangled-name='PyDict_Copy' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='1653' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_Copy'>
      <parameter type-id='type-id-9' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/dictobject.c' line='1653' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-189'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/enumobject.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyEnum_Type' type-id='type-id-15' mangled-name='PyEnum_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/enumobject.h' line='10' column='1' elf-symbol-id='PyEnum_Type'/>
    <var-decl name='PyReversed_Type' type-id='type-id-15' mangled-name='PyReversed_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/enumobject.h' line='11' column='1' elf-symbol-id='PyReversed_Type'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Objects/exceptions.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/spack-build' language='LANG_C99'>
    <typedef-decl name='Py_UNICODE' type-id='type-id-190' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/unicodeobject.h' line='137' column='1' id='type-id-191'/>
    <qualified-type-def type-id='type-id-191' const='yes' id='type-id-192'/>
    <pointer-type-def type-id='type-id-192' size-in-bits='64' id='type-id-193'/>
    <var-decl name='PyExc_BaseException' type-id='type-id-9' mangled-name='PyExc_BaseException' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='118' column='1' elf-symbol-id='PyExc_BaseException'/>
    <var-decl name='PyExc_Exception' type-id='type-id-9' mangled-name='PyExc_Exception' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='119' column='1' elf-symbol-id='PyExc_Exception'/>
    <var-decl name='PyExc_StandardError' type-id='type-id-9' mangled-name='PyExc_StandardError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='122' column='1' elf-symbol-id='PyExc_StandardError'/>
    <var-decl name='PyExc_TypeError' type-id='type-id-9' mangled-name='PyExc_TypeError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='148' column='1' elf-symbol-id='PyExc_TypeError'/>
    <var-decl name='PyExc_StopIteration' type-id='type-id-9' mangled-name='PyExc_StopIteration' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='120' column='1' elf-symbol-id='PyExc_StopIteration'/>
    <var-decl name='PyExc_GeneratorExit' type-id='type-id-9' mangled-name='PyExc_GeneratorExit' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='121' column='1' elf-symbol-id='PyExc_GeneratorExit'/>
    <var-decl name='PyExc_SystemExit' type-id='type-id-9' mangled-name='PyExc_SystemExit' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='147' column='1' elf-symbol-id='PyExc_SystemExit'/>
    <var-decl name='PyExc_KeyboardInterrupt' type-id='type-id-9' mangled-name='PyExc_KeyboardInterrupt' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='136' column='1' elf-symbol-id='PyExc_KeyboardInterrupt'/>
    <var-decl name='PyExc_ImportError' type-id='type-id-9' mangled-name='PyExc_ImportError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='133' column='1' elf-symbol-id='PyExc_ImportError'/>
    <var-decl name='PyExc_EnvironmentError' type-id='type-id-9' mangled-name='PyExc_EnvironmentError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='130' column='1' elf-symbol-id='PyExc_EnvironmentError'/>
    <var-decl name='PyExc_IOError' type-id='type-id-9' mangled-name='PyExc_IOError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='131' column='1' elf-symbol-id='PyExc_IOError'/>
    <var-decl name='PyExc_OSError' type-id='type-id-9' mangled-name='PyExc_OSError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='132' column='1' elf-symbol-id='PyExc_OSError'/>
    <var-decl name='PyExc_EOFError' type-id='type-id-9' mangled-name='PyExc_EOFError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='128' column='1' elf-symbol-id='PyExc_EOFError'/>
    <var-decl name='PyExc_RuntimeError' type-id='type-id-9' mangled-name='PyExc_RuntimeError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='140' column='1' elf-symbol-id='PyExc_RuntimeError'/>
    <var-decl name='PyExc_NotImplementedError' type-id='type-id-9' mangled-name='PyExc_NotImplementedError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='141' column='1' elf-symbol-id='PyExc_NotImplementedError'/>
    <var-decl name='PyExc_NameError' type-id='type-id-9' mangled-name='PyExc_NameError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='138' column='1' elf-symbol-id='PyExc_NameError'/>
    <var-decl name='PyExc_UnboundLocalError' type-id='type-id-9' mangled-name='PyExc_UnboundLocalError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='149' column='1' elf-symbol-id='PyExc_UnboundLocalError'/>
    <var-decl name='PyExc_AttributeError' type-id='type-id-9' mangled-name='PyExc_AttributeError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='127' column='1' elf-symbol-id='PyExc_AttributeError'/>
    <var-decl name='PyExc_SyntaxError' type-id='type-id-9' mangled-name='PyExc_SyntaxError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='142' column='1' elf-symbol-id='PyExc_SyntaxError'/>
    <var-decl name='PyExc_IndentationError' type-id='type-id-9' mangled-name='PyExc_IndentationError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='143' column='1' elf-symbol-id='PyExc_IndentationError'/>
    <var-decl name='PyExc_TabError' type-id='type-id-9' mangled-name='PyExc_TabError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='144' column='1' elf-symbol-id='PyExc_TabError'/>
    <var-decl name='PyExc_LookupError' type-id='type-id-9' mangled-name='PyExc_LookupError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='124' column='1' elf-symbol-id='PyExc_LookupError'/>
    <var-decl name='PyExc_IndexError' type-id='type-id-9' mangled-name='PyExc_IndexError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='134' column='1' elf-symbol-id='PyExc_IndexError'/>
    <var-decl name='PyExc_KeyError' type-id='type-id-9' mangled-name='PyExc_KeyError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='135' column='1' elf-symbol-id='PyExc_KeyError'/>
    <var-decl name='PyExc_ValueError' type-id='type-id-9' mangled-name='PyExc_ValueError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='154' column='1' elf-symbol-id='PyExc_ValueError'/>
    <var-decl name='PyExc_UnicodeError' type-id='type-id-9' mangled-name='PyExc_UnicodeError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='150' column='1' elf-symbol-id='PyExc_UnicodeError'/>
    <var-decl name='PyExc_UnicodeEncodeError' type-id='type-id-9' mangled-name='PyExc_UnicodeEncodeError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='151' column='1' elf-symbol-id='PyExc_UnicodeEncodeError'/>
    <var-decl name='PyExc_UnicodeDecodeError' type-id='type-id-9' mangled-name='PyExc_UnicodeDecodeError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='152' column='1' elf-symbol-id='PyExc_UnicodeDecodeError'/>
    <var-decl name='PyExc_UnicodeTranslateError' type-id='type-id-9' mangled-name='PyExc_UnicodeTranslateError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='153' column='1' elf-symbol-id='PyExc_UnicodeTranslateError'/>
    <var-decl name='PyExc_AssertionError' type-id='type-id-9' mangled-name='PyExc_AssertionError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='126' column='1' elf-symbol-id='PyExc_AssertionError'/>
    <var-decl name='PyExc_ArithmeticError' type-id='type-id-9' mangled-name='PyExc_ArithmeticError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='123' column='1' elf-symbol-id='PyExc_ArithmeticError'/>
    <var-decl name='PyExc_FloatingPointError' type-id='type-id-9' mangled-name='PyExc_FloatingPointError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='129' column='1' elf-symbol-id='PyExc_FloatingPointError'/>
    <var-decl name='PyExc_OverflowError' type-id='type-id-9' mangled-name='PyExc_OverflowError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='139' column='1' elf-symbol-id='PyExc_OverflowError'/>
    <var-decl name='PyExc_ZeroDivisionError' type-id='type-id-9' mangled-name='PyExc_ZeroDivisionError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='155' column='1' elf-symbol-id='PyExc_ZeroDivisionError'/>
    <var-decl name='PyExc_SystemError' type-id='type-id-9' mangled-name='PyExc_SystemError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='146' column='1' elf-symbol-id='PyExc_SystemError'/>
    <var-decl name='PyExc_ReferenceError' type-id='type-id-9' mangled-name='PyExc_ReferenceError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='145' column='1' elf-symbol-id='PyExc_ReferenceError'/>
    <var-decl name='PyExc_MemoryError' type-id='type-id-9' mangled-name='PyExc_MemoryError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='137' column='1' elf-symbol-id='PyExc_MemoryError'/>
    <var-decl name='PyExc_BufferError' type-id='type-id-9' mangled-name='PyExc_BufferError' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='163' column='1' elf-symbol-id='PyExc_BufferError'/>
    <var-decl name='PyExc_Warning' type-id='type-id-9' mangled-name='PyExc_Warning' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='169' column='1' elf-symbol-id='PyExc_Warning'/>
    <var-decl name='PyExc_UserWarning' type-id='type-id-9' mangled-name='PyExc_UserWarning' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='170' column='1' elf-symbol-id='PyExc_UserWarning'/>
    <var-decl name='PyExc_DeprecationWarning' type-id='type-id-9' mangled-name='PyExc_DeprecationWarning' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='171' column='1' elf-symbol-id='PyExc_DeprecationWarning'/>
    <var-decl name='PyExc_PendingDeprecationWarning' type-id='type-id-9' mangled-name='PyExc_PendingDeprecationWarning' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='172' column='1' elf-symbol-id='PyExc_PendingDeprecationWarning'/>
    <var-decl name='PyExc_SyntaxWarning' type-id='type-id-9' mangled-name='PyExc_SyntaxWarning' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='173' column='1' elf-symbol-id='PyExc_SyntaxWarning'/>
    <var-decl name='PyExc_RuntimeWarning' type-id='type-id-9' mangled-name='PyExc_RuntimeWarning' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='174' column='1' elf-symbol-id='PyExc_RuntimeWarning'/>
    <var-decl name='PyExc_FutureWarning' type-id='type-id-9' mangled-name='PyExc_FutureWarning' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='175' column='1' elf-symbol-id='PyExc_FutureWarning'/>
    <var-decl name='PyExc_ImportWarning' type-id='type-id-9' mangled-name='PyExc_ImportWarning' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='176' column='1' elf-symbol-id='PyExc_ImportWarning'/>
    <var-decl name='PyExc_UnicodeWarning' type-id='type-id-9' mangled-name='PyExc_UnicodeWarning' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='177' column='1' elf-symbol-id='PyExc_UnicodeWarning'/>
    <var-decl name='PyExc_BytesWarning' type-id='type-id-9' mangled-name='PyExc_BytesWarning' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-2.7.9-lq4zgexuff7cavzhsedzjfykt2xo4f65/spack-src/Include/pyerrors.h' line='178' column='1' elf-symbol-id='PyExc_BytesWarning'/>
