<abi-corpus path='/opt/spack/opt/spack/linux-ubuntu18.04-x86_64/gcc-7.5.0/binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/lib/libbfd.so' architecture='elf-amd-x86_64' soname='libbfd-2.24.so'>
  <elf-needed>
    <dependency name='libintl.so.8'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libz.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_bfd_aarch64_elf_add_symbol_hook' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_bfd_aarch64_elf_grok_prstatus' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_bfd_aarch64_elf_put_addend' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_bfd_aarch64_elf_resolve_relocation' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_bfd_abort' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_bfd_add_bfd_to_archive_cache' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_bfd_add_merge_section' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='vms_lib_txt_vec' size='856' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='w65_vec' size='856' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='we32kcoff_vec' size='856' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='widenable' size='176' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='x86_64coff_vec' size='856' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='x86_64pe_vec' size='856' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='x86_64pei_vec' size='856' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xc16xl_info_struct' size='80' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xc16xs_info_struct' size='80' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xcoff64_calculate_relocation' size='224' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xcoff64_howto_table' size='2560' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xcoff_calculate_relocation' size='224' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xcoff_complain_overflow' size='32' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xcoff_dwsect_names' size='192' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xcoff_howto_table' size='2480' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xtensa_default_isa' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xtensa_modules' size='248' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xtisa_errno' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xtisa_error_msg' size='1024' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='z80coff_vec' size='856' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='z8kcoff_vec' size='856' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='./archures.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd' language='LANG_C99'>
    <typedef-decl name='bfd_arch_info_type' type-id='type-id-1' filepath='./bfd.h' line='2270' column='1' id='type-id-2'/>
    <qualified-type-def type-id='type-id-3' const='yes' id='type-id-4'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-5'/>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-6'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-7'/>
    <var-decl name='bfd_default_arch_struct' type-id='type-id-6' mangled-name='bfd_default_arch_struct' visibility='default' filepath='./libbfd.h' line='2843' column='1' elf-symbol-id='bfd_default_arch_struct'/>
    <function-decl name='bfd_arch_default_fill' mangled-name='bfd_arch_default_fill' filepath='./archures.c' line='1379' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bfd_arch_default_fill'>
      <parameter type-id='type-id-8' name='count' filepath='./archures.c' line='1379' column='1'/>
      <parameter type-id='type-id-9' name='is_bigendian' filepath='./archures.c' line='1380' column='1'/>
      <parameter type-id='type-id-9' name='code' filepath='./archures.c' line='1381' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='bfd_arch_mach_octets_per_byte' mangled-name='bfd_arch_mach_octets_per_byte' filepath='./archures.c' line='1353' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bfd_arch_mach_octets_per_byte'>
      <parameter type-id='type-id-11' name='arch' filepath='./archures.c' line='1353' column='1'/>
      <parameter type-id='type-id-12' name='mach' filepath='./archures.c' line='1354' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='bfd_octets_per_byte' mangled-name='bfd_octets_per_byte' filepath='./archures.c' line='1331' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bfd_octets_per_byte'>
      <parameter type-id='type-id-14' name='abfd' filepath='./archures.c' line='1331' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='bfd_printable_arch_mach' mangled-name='bfd_printable_arch_mach' filepath='./archures.c' line='1308' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bfd_printable_arch_mach'>
      <parameter type-id='type-id-11' name='arch' filepath='./archures.c' line='1308' column='1'/>
      <parameter type-id='type-id-12' name='machine' filepath='./archures.c' line='1308' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='bfd_lookup_arch' mangled-name='bfd_lookup_arch' filepath='./archures.c' line='1274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bfd_lookup_arch'>
      <parameter type-id='type-id-11' name='arch' filepath='./archures.c' line='1274' column='1'/>
      <parameter type-id='type-id-12' name='machine' filepath='./archures.c' line='1274' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='bfd_get_arch_info' mangled-name='bfd_get_arch_info' filepath='./archures.c' line='1253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bfd_get_arch_info'>
      <parameter type-id='type-id-14' name='abfd' filepath='./archures.c' line='1253' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='bfd_default_scan' mangled-name='bfd_default_scan' filepath='./archures.c' line='1033' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bfd_default_scan'>
      <parameter type-id='type-id-7' name='info' filepath='./archures.c' line='1033' column='1'/>
      <parameter type-id='type-id-15' name='string' filepath='./archures.c' line='1033' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='bfd_default_compatible' mangled-name='bfd_default_compatible' filepath='./archures.c' line='1001' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bfd_default_compatible'>
      <parameter type-id='type-id-7' name='a' filepath='./archures.c' line='1001' column='1'/>
      <parameter type-id='type-id-7' name='b' filepath='./archures.c' line='1002' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='bfd_arch_bits_per_address' mangled-name='bfd_arch_bits_per_address' filepath='./archures.c' line='983' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bfd_arch_bits_per_address'>
      <parameter type-id='type-id-14' name='abfd' filepath='./archures.c' line='983' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='bfd_arch_bits_per_byte' mangled-name='bfd_arch_bits_per_byte' filepath='./archures.c' line='965' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bfd_arch_bits_per_byte'>
      <parameter type-id='type-id-14' name='abfd' filepath='./archures.c' line='965' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='bfd_get_mach' mangled-name='bfd_get_mach' filepath='./archures.c' line='947' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bfd_get_mach'>
      <parameter type-id='type-id-14' name='abfd' filepath='./archures.c' line='947' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='bfd_get_arch' mangled-name='bfd_get_arch' filepath='./archures.c' line='929' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bfd_get_arch'>
      <parameter type-id='type-id-14' name='abfd' filepath='./archures.c' line='929' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='bfd_default_set_arch_mach' mangled-name='bfd_default_set_arch_mach' filepath='./archures.c' line='903' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bfd_default_set_arch_mach'>
      <parameter type-id='type-id-14' name='abfd' filepath='./archures.c' line='903' column='1'/>
      <parameter type-id='type-id-11' name='arch' filepath='./archures.c' line='904' column='1'/>
      <parameter type-id='type-id-12' name='mach' filepath='./archures.c' line='905' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='bfd_set_arch_info' mangled-name='bfd_set_arch_info' filepath='./archures.c' line='882' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bfd_set_arch_info'>
      <parameter type-id='type-id-14' name='abfd' filepath='./archures.c' line='882' column='1'/>
      <parameter type-id='type-id-7' name='arg' filepath='./archures.c' line='882' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='bfd_arch_get_compatible' mangled-name='bfd_arch_get_compatible' filepath='./archures.c' line='822' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bfd_arch_get_compatible'>
      <parameter type-id='type-id-5' name='abfd' filepath='./archures.c' line='822' column='1'/>
      <parameter type-id='type-id-5' name='bbfd' filepath='./archures.c' line='823' column='1'/>
      <parameter type-id='type-id-9' name='accept_unknowns' filepath='./archures.c' line='824' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='bfd_arch_list' mangled-name='bfd_arch_list' filepath='./archures.c' line='765' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bfd_arch_list'>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='bfd_scan_arch' mangled-name='bfd_scan_arch' filepath='./archures.c' line='735' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bfd_scan_arch'>
      <parameter type-id='type-id-15' name='string' filepath='./archures.c' line='735' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='bfd_printable_name' mangled-name='bfd_printable_name' filepath='./archures.c' line='716' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bfd_printable_name'>
      <parameter type-id='type-id-14' name='abfd' filepath='./archures.c' line='716' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-14'/>
    <class-decl name='bfd_arch_info' size-in-bits='640' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2243' column='1' id='type-id-1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bits_per_word' type-id='type-id-19' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bits_per_address' type-id='type-id-19' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bits_per_byte' type-id='type-id-19' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='arch' type-id='type-id-11' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mach' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='arch_name' type-id='type-id-15' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='printable_name' type-id='type-id-15' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='section_align_power' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='the_default' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='compatible' type-id='type-id-20' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='scan' type-id='type-id-21' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='fill' type-id='type-id-22' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='next' type-id='type-id-23' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2268' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-15'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-17'/>
    <enum-decl name='bfd_architecture' filepath='./bfd.h' line='1824' column='1' id='type-id-11'>
      <underlying-type type-id='type-id-25'/>
      <enumerator name='bfd_arch_unknown' value='0'/>
      <enumerator name='bfd_arch_obscure' value='1'/>
      <enumerator name='bfd_arch_m68k' value='2'/>
      <enumerator name='bfd_arch_vax' value='3'/>
      <enumerator name='bfd_arch_i960' value='4'/>
      <enumerator name='bfd_arch_or32' value='5'/>
      <enumerator name='bfd_arch_sparc' value='6'/>
      <enumerator name='bfd_arch_spu' value='7'/>
      <enumerator name='bfd_arch_mips' value='8'/>
      <enumerator name='bfd_arch_i386' value='9'/>
      <enumerator name='bfd_arch_l1om' value='10'/>
      <enumerator name='bfd_arch_k1om' value='11'/>
      <enumerator name='bfd_arch_we32k' value='12'/>
      <enumerator name='bfd_arch_tahoe' value='13'/>
      <enumerator name='bfd_arch_i860' value='14'/>
      <enumerator name='bfd_arch_i370' value='15'/>
      <enumerator name='bfd_arch_romp' value='16'/>
      <enumerator name='bfd_arch_convex' value='17'/>
      <enumerator name='bfd_arch_m88k' value='18'/>
      <enumerator name='bfd_arch_m98k' value='19'/>
      <enumerator name='bfd_arch_pyramid' value='20'/>
      <enumerator name='bfd_arch_h8300' value='21'/>
      <enumerator name='bfd_arch_pdp11' value='22'/>
      <enumerator name='bfd_arch_plugin' value='23'/>
      <enumerator name='bfd_arch_powerpc' value='24'/>
      <enumerator name='bfd_arch_rs6000' value='25'/>
      <enumerator name='bfd_arch_hppa' value='26'/>
      <enumerator name='bfd_arch_d10v' value='27'/>
      <enumerator name='bfd_arch_d30v' value='28'/>
      <enumerator name='bfd_arch_dlx' value='29'/>
      <enumerator name='bfd_arch_m68hc11' value='30'/>
      <enumerator name='bfd_arch_m68hc12' value='31'/>
      <enumerator name='bfd_arch_m9s12x' value='32'/>
      <enumerator name='bfd_arch_m9s12xg' value='33'/>
      <enumerator name='bfd_arch_z8k' value='34'/>
      <enumerator name='bfd_arch_h8500' value='35'/>
      <enumerator name='bfd_arch_sh' value='36'/>
      <enumerator name='bfd_arch_alpha' value='37'/>
      <enumerator name='bfd_arch_arm' value='38'/>
      <enumerator name='bfd_arch_ns32k' value='39'/>
      <enumerator name='bfd_arch_w65' value='40'/>
      <enumerator name='bfd_arch_tic30' value='41'/>
      <enumerator name='bfd_arch_tic4x' value='42'/>
      <enumerator name='bfd_arch_tic54x' value='43'/>
      <enumerator name='bfd_arch_tic6x' value='44'/>
      <enumerator name='bfd_arch_tic80' value='45'/>
      <enumerator name='bfd_arch_v850' value='46'/>
      <enumerator name='bfd_arch_v850_rh850' value='47'/>
      <enumerator name='bfd_arch_arc' value='48'/>
      <enumerator name='bfd_arch_m32c' value='49'/>
      <enumerator name='bfd_arch_m32r' value='50'/>
      <enumerator name='bfd_arch_mn10200' value='51'/>
      <enumerator name='bfd_arch_mn10300' value='52'/>
      <enumerator name='bfd_arch_fr30' value='53'/>
      <enumerator name='bfd_arch_frv' value='54'/>
      <enumerator name='bfd_arch_moxie' value='55'/>
      <enumerator name='bfd_arch_mcore' value='56'/>
      <enumerator name='bfd_arch_mep' value='57'/>
      <enumerator name='bfd_arch_metag' value='58'/>
      <enumerator name='bfd_arch_ia64' value='59'/>
      <enumerator name='bfd_arch_ip2k' value='60'/>
      <enumerator name='bfd_arch_iq2000' value='61'/>
      <enumerator name='bfd_arch_epiphany' value='62'/>
      <enumerator name='bfd_arch_mt' value='63'/>
      <enumerator name='bfd_arch_pj' value='64'/>
      <enumerator name='bfd_arch_avr' value='65'/>
      <enumerator name='bfd_arch_bfin' value='66'/>
      <enumerator name='bfd_arch_cr16' value='67'/>
      <enumerator name='bfd_arch_cr16c' value='68'/>
      <enumerator name='bfd_arch_crx' value='69'/>
      <enumerator name='bfd_arch_cris' value='70'/>
      <enumerator name='bfd_arch_rl78' value='71'/>
      <enumerator name='bfd_arch_rx' value='72'/>
      <enumerator name='bfd_arch_s390' value='73'/>
      <enumerator name='bfd_arch_score' value='74'/>
      <enumerator name='bfd_arch_openrisc' value='75'/>
      <enumerator name='bfd_arch_mmix' value='76'/>
      <enumerator name='bfd_arch_xstormy16' value='77'/>
      <enumerator name='bfd_arch_msp430' value='78'/>
      <enumerator name='bfd_arch_xc16x' value='79'/>
      <enumerator name='bfd_arch_xgate' value='80'/>
      <enumerator name='bfd_arch_xtensa' value='81'/>
      <enumerator name='bfd_arch_z80' value='82'/>
      <enumerator name='bfd_arch_lm32' value='83'/>
      <enumerator name='bfd_arch_microblaze' value='84'/>
      <enumerator name='bfd_arch_tilepro' value='85'/>
      <enumerator name='bfd_arch_tilegx' value='86'/>
      <enumerator name='bfd_arch_aarch64' value='87'/>
      <enumerator name='bfd_arch_nios2' value='88'/>
      <enumerator name='bfd_arch_last' value='89'/>
    </enum-decl>
    <typedef-decl name='bfd' type-id='type-id-18' filepath='./bfd.h' line='117' column='1' id='type-id-3'/>
    <typedef-decl name='bfd_boolean' type-id='type-id-19' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='128' column='1' id='type-id-9'/>
    <typedef-decl name='bfd_size_type' type-id='type-id-12' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='142' column='1' id='type-id-8'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-13'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-12'/>
    <type-decl name='void' id='type-id-16'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-10'/>
    <class-decl name='bfd' size-in-bits='2368' is-struct='yes' visibility='default' filepath='./bfd.h' line='5971' column='1' id='type-id-18'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-13' visibility='default' filepath='./bfd.h' line='5974' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='filename' type-id='type-id-15' visibility='default' filepath='./bfd.h' line='5977' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='xvec' type-id='type-id-26' visibility='default' filepath='./bfd.h' line='5980' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='iostream' type-id='type-id-10' visibility='default' filepath='./bfd.h' line='5984' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='iovec' type-id='type-id-27' visibility='default' filepath='./bfd.h' line='5985' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='lru_prev' type-id='type-id-14' visibility='default' filepath='./bfd.h' line='5989' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='lru_next' type-id='type-id-14' visibility='default' filepath='./bfd.h' line='5989' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='where' type-id='type-id-28' visibility='default' filepath='./bfd.h' line='5993' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='mtime' type-id='type-id-29' visibility='default' filepath='./bfd.h' line='5996' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ifd' type-id='type-id-19' visibility='default' filepath='./bfd.h' line='5999' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='format' type-id='type-id-30' visibility='default' filepath='./bfd.h' line='6002' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='direction' type-id='type-id-31' visibility='default' filepath='./bfd.h' line='6005' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='flags' type-id='type-id-32' visibility='default' filepath='./bfd.h' line='6008' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='origin' type-id='type-id-28' visibility='default' filepath='./bfd.h' line='6100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='proxy_origin' type-id='type-id-28' visibility='default' filepath='./bfd.h' line='6107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='section_htab' type-id='type-id-33' visibility='default' filepath='./bfd.h' line='6110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='sections' type-id='type-id-34' visibility='default' filepath='./bfd.h' line='6113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='section_last' type-id='type-id-34' visibility='default' filepath='./bfd.h' line='6116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='section_count' type-id='type-id-13' visibility='default' filepath='./bfd.h' line='6119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='start_address' type-id='type-id-35' visibility='default' filepath='./bfd.h' line='6123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='symcount' type-id='type-id-13' visibility='default' filepath='./bfd.h' line='6126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='outsymbols' type-id='type-id-36' visibility='default' filepath='./bfd.h' line='6130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='dynsymcount' type-id='type-id-13' visibility='default' filepath='./bfd.h' line='6133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='arch_info' type-id='type-id-23' visibility='default' filepath='./bfd.h' line='6136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='arelt_data' type-id='type-id-10' visibility='default' filepath='./bfd.h' line='6139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='my_archive' type-id='type-id-14' visibility='default' filepath='./bfd.h' line='6140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='archive_next' type-id='type-id-14' visibility='default' filepath='./bfd.h' line='6141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='archive_head' type-id='type-id-14' visibility='default' filepath='./bfd.h' line='6142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='nested_archives' type-id='type-id-14' visibility='default' filepath='./bfd.h' line='6143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='link_next' type-id='type-id-14' visibility='default' filepath='./bfd.h' line='6147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='archive_pass' type-id='type-id-19' visibility='default' filepath='./bfd.h' line='6151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='tdata' type-id='type-id-37' visibility='default' filepath='./bfd.h' line='6194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='usrdata' type-id='type-id-10' visibility='default' filepath='./bfd.h' line='6197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='memory' type-id='type-id-10' visibility='default' filepath='./bfd.h' line='6202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='cacheable' type-id='type-id-13' visibility='default' filepath='./bfd.h' line='6206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='target_defaulted' type-id='type-id-13' visibility='default' filepath='./bfd.h' line='6211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='opened_once' type-id='type-id-13' visibility='default' filepath='./bfd.h' line='6214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='mtime_set' type-id='type-id-13' visibility='default' filepath='./bfd.h' line='6218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='no_export' type-id='type-id-13' visibility='default' filepath='./bfd.h' line='6221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='output_has_begun' type-id='type-id-13' visibility='default' filepath='./bfd.h' line='6225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='has_armap' type-id='type-id-13' visibility='default' filepath='./bfd.h' line='6228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='is_thin_archive' type-id='type-id-13' visibility='default' filepath='./bfd.h' line='6231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23'>
        <var-decl name='selective_search' type-id='type-id-13' visibility='default' filepath='./bfd.h' line='6235' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-23'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-20'/>
    <qualified-type-def type-id='type-id-40' const='yes' id='type-id-24'/>
    <type-decl name='int' size-in-bits='32' id='type-id-19'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-21'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-22'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-34'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-36'/>
    <type-decl name='char' size-in-bits='8' id='type-id-40'/>
    <class-decl name='bfd_hash_table' size-in-bits='320' is-struct='yes' visibility='default' filepath='./bfd.h' line='359' column='1' id='type-id-33'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='table' type-id='type-id-45' visibility='default' filepath='./bfd.h' line='362' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='newfunc' type-id='type-id-46' visibility='default' filepath='./bfd.h' line='370' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='memory' type-id='type-id-10' visibility='default' filepath='./bfd.h' line='374' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='size' type-id='type-id-13' visibility='default' filepath='./bfd.h' line='376' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='count' type-id='type-id-13' visibility='default' filepath='./bfd.h' line='378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='entsize' type-id='type-id-13' visibility='default' filepath='./bfd.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='frozen' type-id='type-id-13' visibility='default' filepath='./bfd.h' line='382' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-38'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-27'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-26'/>
    <enum-decl name='bfd_direction' filepath='./bfd.h' line='5963' column='1' id='type-id-31'>
      <underlying-type type-id='type-id-25'/>
      <enumerator name='no_direction' value='0'/>
      <enumerator name='read_direction' value='1'/>
      <enumerator name='write_direction' value='2'/>
      <enumerator name='both_direction' value='3'/>
    </enum-decl>
    <type-decl name='long int' size-in-bits='64' id='type-id-29'/>
    <typedef-decl name='bfd_format' type-id='type-id-49' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='217' column='1' id='type-id-30'/>
    <typedef-decl name='bfd_vma' type-id='type-id-12' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='140' column='1' id='type-id-35'/>
    <typedef-decl name='flagword' type-id='type-id-13' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='204' column='1' id='type-id-32'/>
    <typedef-decl name='ufile_ptr' type-id='type-id-12' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='196' column='1' id='type-id-28'/>
    <union-decl name='__anonymous_union__3' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='./bfd.h' line='6154' column='1' id='type-id-37'>
      <data-member access='private'>
        <var-decl name='aout_data' type-id='type-id-50' visibility='default' filepath='./bfd.h' line='6156' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='aout_ar_data' type-id='type-id-51' visibility='default' filepath='./bfd.h' line='6157' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='oasys_obj_data' type-id='type-id-52' visibility='default' filepath='./bfd.h' line='6158' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='oasys_ar_data' type-id='type-id-53' visibility='default' filepath='./bfd.h' line='6159' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='coff_obj_data' type-id='type-id-54' visibility='default' filepath='./bfd.h' line='6160' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pe_obj_data' type-id='type-id-55' visibility='default' filepath='./bfd.h' line='6161' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='xcoff_obj_data' type-id='type-id-56' visibility='default' filepath='./bfd.h' line='6162' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ecoff_obj_data' type-id='type-id-57' visibility='default' filepath='./bfd.h' line='6163' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ieee_data' type-id='type-id-58' visibility='default' filepath='./bfd.h' line='6164' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ieee_ar_data' type-id='type-id-59' visibility='default' filepath='./bfd.h' line='6165' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='srec_data' type-id='type-id-60' visibility='default' filepath='./bfd.h' line='6166' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='verilog_data' type-id='type-id-61' visibility='default' filepath='./bfd.h' line='6167' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ihex_data' type-id='type-id-62' visibility='default' filepath='./bfd.h' line='6168' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='tekhex_data' type-id='type-id-63' visibility='default' filepath='./bfd.h' line='6169' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='elf_obj_data' type-id='type-id-64' visibility='default' filepath='./bfd.h' line='6170' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='nlm_obj_data' type-id='type-id-65' visibility='default' filepath='./bfd.h' line='6171' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='bout_data' type-id='type-id-66' visibility='default' filepath='./bfd.h' line='6172' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='mmo_data' type-id='type-id-67' visibility='default' filepath='./bfd.h' line='6173' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sun_core_data' type-id='type-id-68' visibility='default' filepath='./bfd.h' line='6174' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sco5_core_data' type-id='type-id-69' visibility='default' filepath='./bfd.h' line='6175' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='trad_core_data' type-id='type-id-70' visibility='default' filepath='./bfd.h' line='6176' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='som_data' type-id='type-id-71' visibility='default' filepath='./bfd.h' line='6177' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='hpux_core_data' type-id='type-id-72' visibility='default' filepath='./bfd.h' line='6178' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='hppabsd_core_data' type-id='type-id-73' visibility='default' filepath='./bfd.h' line='6179' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sgi_core_data' type-id='type-id-74' visibility='default' filepath='./bfd.h' line='6180' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='lynx_core_data' type-id='type-id-75' visibility='default' filepath='./bfd.h' line='6181' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='osf_core_data' type-id='type-id-76' visibility='default' filepath='./bfd.h' line='6182' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='cisco_core_data' type-id='type-id-77' visibility='default' filepath='./bfd.h' line='6183' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='versados_data' type-id='type-id-78' visibility='default' filepath='./bfd.h' line='6184' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='netbsd_core_data' type-id='type-id-79' visibility='default' filepath='./bfd.h' line='6185' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='mach_o_data' type-id='type-id-80' visibility='default' filepath='./bfd.h' line='6186' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='mach_o_fat_data' type-id='type-id-81' visibility='default' filepath='./bfd.h' line='6187' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='plugin_data' type-id='type-id-82' visibility='default' filepath='./bfd.h' line='6188' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pef_data' type-id='type-id-83' visibility='default' filepath='./bfd.h' line='6189' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pef_xlib_data' type-id='type-id-84' visibility='default' filepath='./bfd.h' line='6190' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sym_data' type-id='type-id-85' visibility='default' filepath='./bfd.h' line='6191' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='any' type-id='type-id-10' visibility='default' filepath='./bfd.h' line='6192' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-53'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-52'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-50'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-51'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-46'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-45'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-83'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-84'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-85'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-44'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-66'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-77'/>
    <class-decl name='bfd_section' size-in-bits='2240' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1206' column='1' id='type-id-43'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-15' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-19' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='index' type-id='type-id-19' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='next' type-id='type-id-34' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='prev' type-id='type-id-34' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='flags' type-id='type-id-32' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='user_set_vma' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='linker_mark' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='linker_has_input' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='gc_mark' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='compress_status' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1426' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='segment_mark' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1434' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22'>
        <var-decl name='sec_info_type' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21'>
        <var-decl name='use_rela_p' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='sec_flg0' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1450' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='sec_flg1' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18'>
        <var-decl name='sec_flg2' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='sec_flg3' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sec_flg4' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1454' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='sec_flg5' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1455' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='vma' type-id='type-id-35' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='lma' type-id='type-id-35' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1470' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='size' type-id='type-id-8' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1475' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='rawsize' type-id='type-id-8' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1485' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='compressed_size' type-id='type-id-8' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1488' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='relax' type-id='type-id-98' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='relax_count' type-id='type-id-19' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='output_offset' type-id='type-id-35' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1504' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='output_section' type-id='type-id-34' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1507' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='alignment_power' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='relocation' type-id='type-id-99' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='orelocation' type-id='type-id-100' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1519' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='reloc_count' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1522' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='filepos' type-id='type-id-101' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1528' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='rel_filepos' type-id='type-id-101' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1531' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='line_filepos' type-id='type-id-101' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='userdata' type-id='type-id-10' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1537' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='contents' type-id='type-id-102' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1541' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='lineno' type-id='type-id-103' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1544' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='lineno_count' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1547' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='entsize' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1550' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='kept_section' type-id='type-id-34' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1554' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='moving_line_filepos' type-id='type-id-101' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='target_index' type-id='type-id-19' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1561' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='used_by_bfd' type-id='type-id-10' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1563' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='constructor_chain' type-id='type-id-104' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1567' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='owner' type-id='type-id-14' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1570' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='symbol' type-id='type-id-44' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1573' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='symbol_ptr_ptr' type-id='type-id-36' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1574' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='map_head' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1583' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='map_tail' type-id='type-id-105' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1583' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-54'/>
    <qualified-type-def type-id='type-id-107' const='yes' id='type-id-47'/>
    <qualified-type-def type-id='type-id-108' const='yes' id='type-id-48'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-57'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-64'/>
    <enum-decl name='bfd_format' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='209' column='1' id='type-id-49'>
      <underlying-type type-id='type-id-25'/>
      <enumerator name='bfd_unknown' value='0'/>
      <enumerator name='bfd_object' value='1'/>
      <enumerator name='bfd_archive' value='2'/>
      <enumerator name='bfd_core' value='3'/>
      <enumerator name='bfd_type_end' value='4'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-73'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-72'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-59'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-58'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-62'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-75'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-80'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-81'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-67'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-65'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-76'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-55'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-82'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-69'/>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-74'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-71'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-60'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-68'/>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-63'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-70'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-61'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-78'/>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-56'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-103'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-91'/>
    <class-decl name='_oasys_ar_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-86'/>
    <class-decl name='_oasys_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-87'/>
    <class-decl name='aout_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-88'/>
    <class-decl name='artdata' size-in-bits='640' is-struct='yes' visibility='default' filepath='./libbfd.h' line='72' column='1' id='type-id-89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='first_file_filepos' type-id='type-id-101' visibility='default' filepath='./libbfd.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cache' type-id='type-id-137' visibility='default' filepath='./libbfd.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='archive_head' type-id='type-id-14' visibility='default' filepath='./libbfd.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='symdefs' type-id='type-id-138' visibility='default' filepath='./libbfd.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='symdef_count' type-id='type-id-139' visibility='default' filepath='./libbfd.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='extended_names' type-id='type-id-140' visibility='default' filepath='./libbfd.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='extended_names_size' type-id='type-id-8' visibility='default' filepath='./libbfd.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='armap_timestamp' type-id='type-id-29' visibility='default' filepath='./libbfd.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='armap_datepos' type-id='type-id-101' visibility='default' filepath='./libbfd.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tdata' type-id='type-id-10' visibility='default' filepath='./libbfd.h' line='91' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bfd_iovec' size-in-bits='512' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/libbfd.h' line='861' column='1' id='type-id-107'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bread' type-id='type-id-141' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/libbfd.h' line='869' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bwrite' type-id='type-id-141' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/libbfd.h' line='870' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='btell' type-id='type-id-142' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/libbfd.h' line='874' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bseek' type-id='type-id-143' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/libbfd.h' line='877' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bclose' type-id='type-id-144' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/libbfd.h' line='878' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='bflush' type-id='type-id-144' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/libbfd.h' line='879' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='bstat' type-id='type-id-145' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/libbfd.h' line='880' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='bmmap' type-id='type-id-146' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/libbfd.h' line='887' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bfd_pef_data_struct' size-in-bits='768' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='135' column='1' id='type-id-92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-147' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='sections' type-id='type-id-148' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ibfd' type-id='type-id-14' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='139' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bfd_pef_xlib_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-93'/>
    <class-decl name='bfd_sym_data_struct' size-in-bits='3264' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='541' column='1' id='type-id-94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name_table' type-id='type-id-102' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='543' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='header' type-id='type-id-149' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='544' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='version' type-id='type-id-150' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='545' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='sbfd' type-id='type-id-14' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='546' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bfd_symbol' size-in-bits='384' is-struct='yes' visibility='default' filepath='./bfd.h' line='5776' column='1' id='type-id-95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='the_bfd' type-id='type-id-14' visibility='default' filepath='./bfd.h' line='5787' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-15' visibility='default' filepath='./bfd.h' line='5791' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='value' type-id='type-id-151' visibility='default' filepath='./bfd.h' line='5796' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flags' type-id='type-id-32' visibility='default' filepath='./bfd.h' line='5901' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='section' type-id='type-id-34' visibility='default' filepath='./bfd.h' line='5906' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='udata' type-id='type-id-152' visibility='default' filepath='./bfd.h' line='5914' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bfd_target' size-in-bits='6848' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6519' column='1' id='type-id-108'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-140' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6522' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flavour' type-id='type-id-153' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6526' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='byteorder' type-id='type-id-154' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6529' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='header_byteorder' type-id='type-id-154' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6532' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='object_flags' type-id='type-id-32' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6536' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='section_flags' type-id='type-id-32' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6540' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='symbol_leading_char' type-id='type-id-40' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6544' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='ar_pad_char' type-id='type-id-40' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6547' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='ar_max_namelen' type-id='type-id-155' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6550' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='match_priority' type-id='type-id-155' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6554' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bfd_getx64' type-id='type-id-156' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6559' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='bfd_getx_signed_64' type-id='type-id-157' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6560' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='bfd_putx64' type-id='type-id-158' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6561' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='bfd_getx32' type-id='type-id-159' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='bfd_getx_signed_32' type-id='type-id-160' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6563' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='bfd_putx32' type-id='type-id-161' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6564' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='bfd_getx16' type-id='type-id-159' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6565' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='bfd_getx_signed_16' type-id='type-id-160' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6566' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bfd_putx16' type-id='type-id-161' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6567' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='bfd_h_getx64' type-id='type-id-156' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6570' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='bfd_h_getx_signed_64' type-id='type-id-157' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6571' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='bfd_h_putx64' type-id='type-id-158' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6572' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='bfd_h_getx32' type-id='type-id-159' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6573' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='bfd_h_getx_signed_32' type-id='type-id-160' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6574' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='bfd_h_putx32' type-id='type-id-161' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6575' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='bfd_h_getx16' type-id='type-id-159' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6576' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='bfd_h_getx_signed_16' type-id='type-id-160' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6577' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='bfd_h_putx16' type-id='type-id-161' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6578' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_bfd_check_format' type-id='type-id-162' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6584' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='_bfd_set_format' type-id='type-id-163' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6587' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='_bfd_write_contents' type-id='type-id-163' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6590' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='_close_and_cleanup' type-id='type-id-164' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6602' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='_bfd_free_cached_info' type-id='type-id-164' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6604' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='_new_section_hook' type-id='type-id-165' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6606' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='_bfd_get_section_contents' type-id='type-id-166' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6608' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='_bfd_get_section_contents_in_window' type-id='type-id-167' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6610' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='_bfd_copy_private_bfd_data' type-id='type-id-168' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6626' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='_bfd_merge_private_bfd_data' type-id='type-id-168' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6629' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='_bfd_init_private_section_data' type-id='type-id-169' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6634' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='_bfd_copy_private_section_data' type-id='type-id-170' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6638' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='_bfd_copy_private_symbol_data' type-id='type-id-171' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6642' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='_bfd_copy_private_header_data' type-id='type-id-168' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6646' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='_bfd_set_private_flags' type-id='type-id-172' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6649' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='_bfd_print_private_bfd_data' type-id='type-id-173' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='_core_file_failing_command' type-id='type-id-174' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6661' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='_core_file_failing_signal' type-id='type-id-144' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6662' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='_core_file_matches_executable_p' type-id='type-id-168' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6663' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='_core_file_pid' type-id='type-id-144' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6664' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='_bfd_slurp_armap' type-id='type-id-164' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6680' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='_bfd_slurp_extended_name_table' type-id='type-id-164' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6681' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='_bfd_construct_extended_name_table' type-id='type-id-175' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6682' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='_bfd_truncate_arname' type-id='type-id-176' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6684' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='write_armap' type-id='type-id-177' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6685' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='_bfd_read_ar_hdr_fn' type-id='type-id-178' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6687' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='_bfd_write_ar_hdr_fn' type-id='type-id-168' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6688' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='openr_next_archived_file' type-id='type-id-179' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6689' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='_bfd_get_elt_at_index' type-id='type-id-180' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='_bfd_stat_arch_elt' type-id='type-id-145' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6692' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='_bfd_update_armap_timestamp' type-id='type-id-164' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6693' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='_bfd_get_symtab_upper_bound' type-id='type-id-181' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6713' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='_bfd_canonicalize_symtab' type-id='type-id-182' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6714' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='_bfd_make_empty_symbol' type-id='type-id-183' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6717' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='_bfd_print_symbol' type-id='type-id-184' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6718' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='_bfd_get_symbol_info' type-id='type-id-185' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6721' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='_bfd_is_local_label_name' type-id='type-id-186' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6724' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='_bfd_is_target_special_symbol' type-id='type-id-187' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6725' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='_get_lineno' type-id='type-id-188' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6726' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='_bfd_find_nearest_line' type-id='type-id-189' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6727' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='_bfd_find_nearest_line_discriminator' type-id='type-id-190' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6730' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='_bfd_find_line' type-id='type-id-191' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6733' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='_bfd_find_inliner_info' type-id='type-id-192' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6736' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='_bfd_make_debug_symbol' type-id='type-id-193' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6741' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='_read_minisymbols' type-id='type-id-194' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6745' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='_minisymbol_to_symbol' type-id='type-id-195' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6749' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='_get_reloc_upper_bound' type-id='type-id-196' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6759' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='_bfd_canonicalize_reloc' type-id='type-id-197' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6760' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='reloc_type_lookup' type-id='type-id-198' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6764' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='reloc_name_lookup' type-id='type-id-199' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6766' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='_bfd_set_arch_mach' type-id='type-id-200' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6774' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='_bfd_set_section_contents' type-id='type-id-166' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6776' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='_bfd_sizeof_headers' type-id='type-id-201' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6799' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5376'>
        <var-decl name='_bfd_get_relocated_section_contents' type-id='type-id-202' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6800' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='_bfd_relax_section' type-id='type-id-203' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6804' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='_bfd_link_hash_table_create' type-id='type-id-204' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6810' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='_bfd_link_hash_table_free' type-id='type-id-205' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6813' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5632'>
        <var-decl name='_bfd_link_add_symbols' type-id='type-id-206' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6816' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='_bfd_link_just_syms' type-id='type-id-207' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6819' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5760'>
        <var-decl name='_bfd_copy_link_hash_symbol_type' type-id='type-id-208' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6824' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='_bfd_final_link' type-id='type-id-206' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6829' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5888'>
        <var-decl name='_bfd_link_split_section' type-id='type-id-209' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6832' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='_bfd_gc_sections' type-id='type-id-206' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6835' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6016'>
        <var-decl name='_bfd_lookup_section_flags' type-id='type-id-210' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6838' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6080'>
        <var-decl name='_bfd_merge_sections' type-id='type-id-206' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6843' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='_bfd_is_group_section' type-id='type-id-211' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6846' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6208'>
        <var-decl name='_bfd_discard_group' type-id='type-id-209' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6849' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6272'>
        <var-decl name='_section_already_linked' type-id='type-id-212' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6853' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='_bfd_define_common_symbol' type-id='type-id-213' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6857' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6400'>
        <var-decl name='_bfd_get_dynamic_symtab_upper_bound' type-id='type-id-181' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6869' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6464'>
        <var-decl name='_bfd_canonicalize_dynamic_symtab' type-id='type-id-182' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6871' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6528'>
        <var-decl name='_bfd_get_synthetic_symtab' type-id='type-id-214' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6874' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='_bfd_get_dynamic_reloc_upper_bound' type-id='type-id-181' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6878' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='_bfd_canonicalize_dynamic_reloc' type-id='type-id-215' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6880' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6720'>
        <var-decl name='alternative_target' type-id='type-id-26' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6884' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6784'>
        <var-decl name='backend_data' type-id='type-id-10' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6888' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bout_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-96'/>
    <class-decl name='cisco_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-97'/>
    <class-decl name='coff_tdata' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-106'/>
    <class-decl name='ecoff_tdata' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-109'/>
    <class-decl name='elf_obj_tdata' size-in-bits='26560' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1566' column='1' id='type-id-110'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='elf_header' type-id='type-id-216' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1568' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='elf_sect_ptr' type-id='type-id-217' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1569' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='phdr' type-id='type-id-218' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1570' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='symtab_hdr' type-id='type-id-219' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1571' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='shstrtab_hdr' type-id='type-id-219' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1572' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='strtab_hdr' type-id='type-id-219' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1573' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='dynsymtab_hdr' type-id='type-id-219' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1574' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='dynstrtab_hdr' type-id='type-id-219' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1575' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='dynversym_hdr' type-id='type-id-219' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1576' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='dynverref_hdr' type-id='type-id-219' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1577' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='dynverdef_hdr' type-id='type-id-219' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1578' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='symtab_shndx_hdr' type-id='type-id-219' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1579' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='gp' type-id='type-id-35' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1580' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='gp_size' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1581' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6688'>
        <var-decl name='num_elf_sections' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1582' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6720'>
        <var-decl name='sym_hashes' type-id='type-id-220' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1587' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6784'>
        <var-decl name='local_got' type-id='type-id-221' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1597' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6848'>
        <var-decl name='dt_name' type-id='type-id-15' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1607' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6912'>
        <var-decl name='dt_audit' type-id='type-id-15' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1611' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6976'>
        <var-decl name='line_info' type-id='type-id-10' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1614' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7040'>
        <var-decl name='dwarf1_find_line_info' type-id='type-id-222' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1617' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7104'>
        <var-decl name='dwarf2_find_line_info' type-id='type-id-10' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1620' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7168'>
        <var-decl name='elf_find_function_cache' type-id='type-id-10' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1623' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7232'>
        <var-decl name='cverdefs' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1626' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7264'>
        <var-decl name='cverrefs' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1629' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7296'>
        <var-decl name='verdef' type-id='type-id-223' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1632' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7360'>
        <var-decl name='verref' type-id='type-id-224' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1635' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7424'>
        <var-decl name='eh_frame_section' type-id='type-id-225' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1638' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7488'>
        <var-decl name='symbuf' type-id='type-id-10' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1641' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7552'>
        <var-decl name='known_obj_attributes' type-id='type-id-226' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1643' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25728'>
        <var-decl name='other_obj_attributes' type-id='type-id-227' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1644' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25856'>
        <var-decl name='build_id' type-id='type-id-228' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1647' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25920'>
        <var-decl name='sdt_note_head' type-id='type-id-229' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25984'>
        <var-decl name='group_sect_ptr' type-id='type-id-217' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1654' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26048'>
        <var-decl name='num_group' type-id='type-id-19' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1655' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26080'>
        <var-decl name='symtab_section' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1657' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26112'>
        <var-decl name='symtab_shndx_section' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1657' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26144'>
        <var-decl name='dynsymtab_section' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1657' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26176'>
        <var-decl name='dynversym_section' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1658' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26208'>
        <var-decl name='dynverdef_section' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1658' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26240'>
        <var-decl name='dynverref_section' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1658' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26272'>
        <var-decl name='object_id' type-id='type-id-230' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1662' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26304'>
        <var-decl name='dyn_lib_class' type-id='type-id-231' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1667' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26336'>
        <var-decl name='bad_symtab' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1674' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26368'>
        <var-decl name='has_gnu_symbols' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1679' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26432'>
        <var-decl name='core' type-id='type-id-232' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1682' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26496'>
        <var-decl name='o' type-id='type-id-233' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1685' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hppabsd_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-111'/>
    <class-decl name='hpux_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-112'/>
    <class-decl name='ieee_ar_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-113'/>
    <class-decl name='ieee_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-114'/>
    <class-decl name='ihex_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-115'/>
    <class-decl name='lynx_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-116'/>
    <class-decl name='mach_o_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-117'/>
    <class-decl name='mach_o_fat_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-118'/>
    <class-decl name='mmo_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-119'/>
    <class-decl name='netbsd_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-120'/>
    <class-decl name='nlm_obj_tdata' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-121'/>
    <class-decl name='osf_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-122'/>
    <class-decl name='pe_tdata' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-123'/>
    <class-decl name='plugin_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-124'/>
    <class-decl name='sco5_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-125'/>
    <class-decl name='sgi_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-126'/>
    <class-decl name='som_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-127'/>
    <class-decl name='srec_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-128'/>
    <class-decl name='sun_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-129'/>
    <class-decl name='tekhex_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-130'/>
    <class-decl name='trad_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-131'/>
    <class-decl name='verilog_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-132'/>
    <class-decl name='versados_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-133'/>
    <class-decl name='xcoff_tdata' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-134'/>
    <pointer-type-def type-id='type-id-234' size-in-bits='64' id='type-id-98'/>
    <pointer-type-def type-id='type-id-235' size-in-bits='64' id='type-id-104'/>
    <pointer-type-def type-id='type-id-236' size-in-bits='64' id='type-id-99'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-100'/>
    <typedef-decl name='file_ptr' type-id='type-id-29' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='195' column='1' id='type-id-101'/>
    <union-decl name='__anonymous_union__2' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1580' column='1' id='type-id-105'>
      <data-member access='private'>
        <var-decl name='link_order' type-id='type-id-237' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1581' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='s' type-id='type-id-34' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1582' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-102'/>
    <array-type-def dimensions='1' type-id='type-id-238' size-in-bits='704' id='type-id-216'>
      <subrange length='1' type-id='type-id-12' id='type-id-239'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-240' size-in-bits='64' id='type-id-218'/>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-217'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-223'/>
    <pointer-type-def type-id='type-id-243' size-in-bits='64' id='type-id-224'/>
    <pointer-type-def type-id='type-id-244' size-in-bits='64' id='type-id-188'/>
    <pointer-type-def type-id='type-id-245' size-in-bits='64' id='type-id-225'/>
    <pointer-type-def type-id='type-id-246' size-in-bits='64' id='type-id-195'/>
    <pointer-type-def type-id='type-id-247' size-in-bits='64' id='type-id-193'/>
    <pointer-type-def type-id='type-id-248' size-in-bits='64' id='type-id-179'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-180'/>
    <pointer-type-def type-id='type-id-250' size-in-bits='64' id='type-id-202'/>
    <pointer-type-def type-id='type-id-251' size-in-bits='64' id='type-id-204'/>
    <pointer-type-def type-id='type-id-252' size-in-bits='64' id='type-id-237'/>
    <pointer-type-def type-id='type-id-253' size-in-bits='64' id='type-id-148'/>
    <pointer-type-def type-id='type-id-254' size-in-bits='64' id='type-id-183'/>
    <pointer-type-def type-id='type-id-255' size-in-bits='64' id='type-id-138'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-140'/>
    <pointer-type-def type-id='type-id-256' size-in-bits='64' id='type-id-174'/>
    <class-decl name='bfd_hash_entry' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='346' column='1' id='type-id-136'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-91' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='string' type-id='type-id-15' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hash' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='354' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='relax_table' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1589' column='1' id='type-id-234'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-35' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1591' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-19' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1594' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='relent_chain' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2485' column='1' id='type-id-235'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='relent' type-id='type-id-257' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2487' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='next' type-id='type-id-104' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2488' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='reloc_cache_entry' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2337' column='1' id='type-id-236'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sym_ptr_ptr' type-id='type-id-36' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2340' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='address' type-id='type-id-8' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2343' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addend' type-id='type-id-35' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='howto' type-id='type-id-258' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2349' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-259' size-in-bits='256' id='type-id-162'>
      <subrange length='4' type-id='type-id-12' id='type-id-260'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-261' size-in-bits='64' id='type-id-232'/>
    <pointer-type-def type-id='type-id-262' size-in-bits='64' id='type-id-222'/>
    <pointer-type-def type-id='type-id-263' size-in-bits='64' id='type-id-228'/>
    <pointer-type-def type-id='type-id-264' size-in-bits='64' id='type-id-220'/>
    <enum-decl name='bfd_endian' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6511' column='1' id='type-id-154'>
      <underlying-type type-id='type-id-25'/>
      <enumerator name='BFD_ENDIAN_BIG' value='0'/>
      <enumerator name='BFD_ENDIAN_LITTLE' value='1'/>
      <enumerator name='BFD_ENDIAN_UNKNOWN' value='2'/>
    </enum-decl>
    <enum-decl name='bfd_flavour' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='6483' column='1' id='type-id-153'>
      <underlying-type type-id='type-id-25'/>
      <enumerator name='bfd_target_unknown_flavour' value='0'/>
      <enumerator name='bfd_target_aout_flavour' value='1'/>
      <enumerator name='bfd_target_coff_flavour' value='2'/>
      <enumerator name='bfd_target_ecoff_flavour' value='3'/>
      <enumerator name='bfd_target_xcoff_flavour' value='4'/>
      <enumerator name='bfd_target_elf_flavour' value='5'/>
      <enumerator name='bfd_target_ieee_flavour' value='6'/>
      <enumerator name='bfd_target_nlm_flavour' value='7'/>
      <enumerator name='bfd_target_oasys_flavour' value='8'/>
      <enumerator name='bfd_target_tekhex_flavour' value='9'/>
      <enumerator name='bfd_target_srec_flavour' value='10'/>
      <enumerator name='bfd_target_verilog_flavour' value='11'/>
      <enumerator name='bfd_target_ihex_flavour' value='12'/>
      <enumerator name='bfd_target_som_flavour' value='13'/>
      <enumerator name='bfd_target_os9k_flavour' value='14'/>
      <enumerator name='bfd_target_versados_flavour' value='15'/>
      <enumerator name='bfd_target_msdos_flavour' value='16'/>
      <enumerator name='bfd_target_ovax_flavour' value='17'/>
      <enumerator name='bfd_target_evax_flavour' value='18'/>
      <enumerator name='bfd_target_mmo_flavour' value='19'/>
      <enumerator name='bfd_target_mach_o_flavour' value='20'/>
      <enumerator name='bfd_target_pef_flavour' value='21'/>
      <enumerator name='bfd_target_pef_xlib_flavour' value='22'/>
      <enumerator name='bfd_target_sym_flavour' value='23'/>
    </enum-decl>
    <enum-decl name='dynamic_lib_link_class' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='635' column='1' id='type-id-231'>
      <underlying-type type-id='type-id-25'/>
      <enumerator name='DYN_NORMAL' value='0'/>
      <enumerator name='DYN_AS_NEEDED' value='1'/>
      <enumerator name='DYN_DT_NEEDED' value='2'/>
      <enumerator name='DYN_NO_ADD_NEEDED' value='4'/>
      <enumerator name='DYN_NO_NEEDED' value='8'/>
    </enum-decl>
    <enum-decl name='elf_target_id' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='401' column='1' id='type-id-230'>
      <underlying-type type-id='type-id-25'/>
      <enumerator name='AARCH64_ELF_DATA' value='1'/>
      <enumerator name='ALPHA_ELF_DATA' value='2'/>
      <enumerator name='ARM_ELF_DATA' value='3'/>
      <enumerator name='AVR_ELF_DATA' value='4'/>
      <enumerator name='BFIN_ELF_DATA' value='5'/>
      <enumerator name='CRIS_ELF_DATA' value='6'/>
      <enumerator name='FRV_ELF_DATA' value='7'/>
      <enumerator name='HPPA32_ELF_DATA' value='8'/>
      <enumerator name='HPPA64_ELF_DATA' value='9'/>
      <enumerator name='I386_ELF_DATA' value='10'/>
      <enumerator name='IA64_ELF_DATA' value='11'/>
      <enumerator name='LM32_ELF_DATA' value='12'/>
      <enumerator name='M32R_ELF_DATA' value='13'/>
      <enumerator name='M68HC11_ELF_DATA' value='14'/>
      <enumerator name='M68K_ELF_DATA' value='15'/>
      <enumerator name='METAG_ELF_DATA' value='16'/>
      <enumerator name='MICROBLAZE_ELF_DATA' value='17'/>
      <enumerator name='MIPS_ELF_DATA' value='18'/>
      <enumerator name='MN10300_ELF_DATA' value='19'/>
      <enumerator name='NIOS2_ELF_DATA' value='20'/>
      <enumerator name='PPC32_ELF_DATA' value='21'/>
      <enumerator name='PPC64_ELF_DATA' value='22'/>
      <enumerator name='S390_ELF_DATA' value='23'/>
      <enumerator name='SH_ELF_DATA' value='24'/>
      <enumerator name='SPARC_ELF_DATA' value='25'/>
      <enumerator name='SPU_ELF_DATA' value='26'/>
      <enumerator name='TIC6X_ELF_DATA' value='27'/>
      <enumerator name='X86_64_ELF_DATA' value='28'/>
      <enumerator name='XTENSA_ELF_DATA' value='29'/>
      <enumerator name='XGATE_ELF_DATA' value='30'/>
      <enumerator name='TILEGX_ELF_DATA' value='31'/>
      <enumerator name='TILEPRO_ELF_DATA' value='32'/>
      <enumerator name='GENERIC_ELF_DATA' value='33'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-265' size-in-bits='64' id='type-id-144'/>
    <pointer-type-def type-id='type-id-266' size-in-bits='64' id='type-id-201'/>
    <pointer-type-def type-id='type-id-267' size-in-bits='64' id='type-id-145'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-143'/>
    <pointer-type-def type-id='type-id-269' size-in-bits='64' id='type-id-181'/>
    <pointer-type-def type-id='type-id-270' size-in-bits='64' id='type-id-215'/>
    <pointer-type-def type-id='type-id-271' size-in-bits='64' id='type-id-182'/>
    <pointer-type-def type-id='type-id-272' size-in-bits='64' id='type-id-214'/>
    <pointer-type-def type-id='type-id-273' size-in-bits='64' id='type-id-194'/>
    <pointer-type-def type-id='type-id-274' size-in-bits='64' id='type-id-196'/>
    <pointer-type-def type-id='type-id-275' size-in-bits='64' id='type-id-197'/>
    <array-type-def dimensions='2' type-id='type-id-276' size-in-bits='18176' id='type-id-226'>
      <subrange length='2' type-id='type-id-12' id='type-id-277'/>
      <subrange length='71' type-id='type-id-12' id='type-id-278'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-279' size-in-bits='128' id='type-id-227'>
      <subrange length='2' type-id='type-id-12' id='type-id-277'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-280' size-in-bits='64' id='type-id-233'/>
    <pointer-type-def type-id='type-id-281' size-in-bits='64' id='type-id-199'/>
    <pointer-type-def type-id='type-id-282' size-in-bits='64' id='type-id-198'/>
    <pointer-type-def type-id='type-id-283' size-in-bits='64' id='type-id-229'/>
    <typedef-decl name='Elf_Internal_Shdr' type-id='type-id-284' filepath='./../include/elf/internal.h' line='117' column='1' id='type-id-219'/>
    <typedef-decl name='alent' type-id='type-id-285' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='277' column='1' id='type-id-135'/>
    <pointer-type-def type-id='type-id-286' size-in-bits='64' id='type-id-164'/>
    <array-type-def dimensions='1' type-id='type-id-164' size-in-bits='256' id='type-id-163'>
      <subrange length='4' type-id='type-id-12' id='type-id-260'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-287' size-in-bits='64' id='type-id-212'/>
    <pointer-type-def type-id='type-id-288' size-in-bits='64' id='type-id-187'/>
    <pointer-type-def type-id='type-id-289' size-in-bits='64' id='type-id-171'/>
    <pointer-type-def type-id='type-id-290' size-in-bits='64' id='type-id-168'/>
    <pointer-type-def type-id='type-id-291' size-in-bits='64' id='type-id-206'/>
    <pointer-type-def type-id='type-id-292' size-in-bits='64' id='type-id-213'/>
    <pointer-type-def type-id='type-id-293' size-in-bits='64' id='type-id-209'/>
    <pointer-type-def type-id='type-id-294' size-in-bits='64' id='type-id-203'/>
    <pointer-type-def type-id='type-id-295' size-in-bits='64' id='type-id-189'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' id='type-id-190'/>
    <pointer-type-def type-id='type-id-297' size-in-bits='64' id='type-id-191'/>
    <pointer-type-def type-id='type-id-298' size-in-bits='64' id='type-id-175'/>
    <pointer-type-def type-id='type-id-299' size-in-bits='64' id='type-id-211'/>
    <pointer-type-def type-id='type-id-300' size-in-bits='64' id='type-id-186'/>
    <pointer-type-def type-id='type-id-301' size-in-bits='64' id='type-id-192'/>
    <pointer-type-def type-id='type-id-302' size-in-bits='64' id='type-id-200'/>
    <pointer-type-def type-id='type-id-303' size-in-bits='64' id='type-id-172'/>
    <pointer-type-def type-id='type-id-304' size-in-bits='64' id='type-id-165'/>
    <pointer-type-def type-id='type-id-305' size-in-bits='64' id='type-id-170'/>
    <pointer-type-def type-id='type-id-306' size-in-bits='64' id='type-id-169'/>
    <pointer-type-def type-id='type-id-307' size-in-bits='64' id='type-id-167'/>
    <pointer-type-def type-id='type-id-308' size-in-bits='64' id='type-id-166'/>
    <pointer-type-def type-id='type-id-309' size-in-bits='64' id='type-id-177'/>
    <pointer-type-def type-id='type-id-310' size-in-bits='64' id='type-id-173'/>
    <pointer-type-def type-id='type-id-311' size-in-bits='64' id='type-id-210'/>
    <pointer-type-def type-id='type-id-312' size-in-bits='64' id='type-id-157'/>
    <typedef-decl name='bfd_pef_header' type-id='type-id-313' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='41' column='1' id='type-id-147'/>
    <pointer-type-def type-id='type-id-314' size-in-bits='64' id='type-id-160'/>
    <typedef-decl name='bfd_sym_header_block' type-id='type-id-315' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='539' column='1' id='type-id-149'/>
    <typedef-decl name='bfd_sym_version' type-id='type-id-316' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='77' column='1' id='type-id-150'/>
    <pointer-type-def type-id='type-id-317' size-in-bits='64' id='type-id-156'/>
    <pointer-type-def type-id='type-id-318' size-in-bits='64' id='type-id-159'/>
    <pointer-type-def type-id='type-id-319' size-in-bits='64' id='type-id-142'/>
    <pointer-type-def type-id='type-id-320' size-in-bits='64' id='type-id-141'/>
    <typedef-decl name='htab_t' type-id='type-id-321' filepath='./../include/hashtab.h' line='144' column='1' id='type-id-137'/>
    <typedef-decl name='symindex' type-id='type-id-12' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='222' column='1' id='type-id-139'/>
    <typedef-decl name='symvalue' type-id='type-id-12' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='143' column='1' id='type-id-151'/>
    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1592' column='1' id='type-id-221'>
      <data-member access='private'>
        <var-decl name='refcounts' type-id='type-id-322' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1594' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='offsets' type-id='type-id-323' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1595' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ents' type-id='type-id-324' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1596' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='./bfd.h' line='5909' column='1' id='type-id-152'>
      <data-member access='private'>
        <var-decl name='p' type-id='type-id-10' visibility='default' filepath='./bfd.h' line='5911' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='i' type-id='type-id-35' visibility='default' filepath='./bfd.h' line='5912' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-155'/>
    <pointer-type-def type-id='type-id-325' size-in-bits='64' id='type-id-207'/>
    <pointer-type-def type-id='type-id-326' size-in-bits='64' id='type-id-208'/>
    <pointer-type-def type-id='type-id-327' size-in-bits='64' id='type-id-185'/>
    <pointer-type-def type-id='type-id-328' size-in-bits='64' id='type-id-176'/>
    <pointer-type-def type-id='type-id-329' size-in-bits='64' id='type-id-184'/>
    <pointer-type-def type-id='type-id-330' size-in-bits='64' id='type-id-205'/>
    <pointer-type-def type-id='type-id-331' size-in-bits='64' id='type-id-158'/>
    <pointer-type-def type-id='type-id-332' size-in-bits='64' id='type-id-161'/>
    <pointer-type-def type-id='type-id-333' size-in-bits='64' id='type-id-178'/>
    <pointer-type-def type-id='type-id-334' size-in-bits='64' id='type-id-146'/>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-241'/>
    <pointer-type-def type-id='type-id-335' size-in-bits='64' id='type-id-322'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-323'/>
    <class-decl name='bfd_link_order' size-in-bits='384' is-struct='yes' visibility='default' filepath='./../include/bfdlink.h' line='678' column='1' id='type-id-252'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-237' visibility='default' filepath='./../include/bfdlink.h' line='681' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-336' visibility='default' filepath='./../include/bfdlink.h' line='683' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offset' type-id='type-id-35' visibility='default' filepath='./../include/bfdlink.h' line='685' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='size' type-id='type-id-8' visibility='default' filepath='./../include/bfdlink.h' line='687' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='u' type-id='type-id-337' visibility='default' filepath='./../include/bfdlink.h' line='718' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bfd_pef_header' size-in-bits='640' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='27' column='1' id='type-id-313'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tag1' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tag2' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='architecture' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='format_version' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='timestamp' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='old_definition_version' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='old_implementation_version' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='current_version' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='section_count' type-id='type-id-338' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='528'>
        <var-decl name='instantiated_section_count' type-id='type-id-338' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='reserved' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bfd_sym_header_block' size-in-bits='3072' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='515' column='1' id='type-id-315'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dshb_id' type-id='type-id-339' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='517' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dshb_page_size' type-id='type-id-338' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='518' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dshb_hash_page' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='519' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dshb_root_mte' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='dshb_mod_date' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='521' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='dshb_frte' type-id='type-id-340' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='522' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='dshb_rte' type-id='type-id-340' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='523' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='dshb_mte' type-id='type-id-340' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='524' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='dshb_cmte' type-id='type-id-340' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='525' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='dshb_cvte' type-id='type-id-340' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='526' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='dshb_csnte' type-id='type-id-340' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='527' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='dshb_clte' type-id='type-id-340' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='528' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='dshb_ctte' type-id='type-id-340' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='529' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='dshb_tte' type-id='type-id-340' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='530' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='dshb_nte' type-id='type-id-340' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='531' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='dshb_tinfo' type-id='type-id-340' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='532' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='dshb_fite' type-id='type-id-340' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='533' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='dshb_const' type-id='type-id-340' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='dshb_file_creator' type-id='type-id-341' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='536' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3040'>
        <var-decl name='dshb_file_type' type-id='type-id-341' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='537' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='core_elf_obj_tdata' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1513' column='1' id='type-id-261'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='signal' type-id='type-id-19' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pid' type-id='type-id-19' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1516' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lwpid' type-id='type-id-19' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1517' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='program' type-id='type-id-140' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1518' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='command' type-id='type-id-140' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1519' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dwarf1_debug' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-262'/>
    <class-decl name='elf_build_id' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1506' column='1' id='type-id-263'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-342' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-343' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1509' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='elf_internal_shdr' size-in-bits='640' is-struct='yes' visibility='default' filepath='./../include/elf/internal.h' line='102' column='1' id='type-id-284'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sh_name' type-id='type-id-13' visibility='default' filepath='./../include/elf/internal.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sh_type' type-id='type-id-13' visibility='default' filepath='./../include/elf/internal.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sh_flags' type-id='type-id-35' visibility='default' filepath='./../include/elf/internal.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sh_addr' type-id='type-id-35' visibility='default' filepath='./../include/elf/internal.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sh_offset' type-id='type-id-101' visibility='default' filepath='./../include/elf/internal.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='sh_size' type-id='type-id-8' visibility='default' filepath='./../include/elf/internal.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='sh_link' type-id='type-id-13' visibility='default' filepath='./../include/elf/internal.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='sh_info' type-id='type-id-13' visibility='default' filepath='./../include/elf/internal.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='sh_addralign' type-id='type-id-35' visibility='default' filepath='./../include/elf/internal.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='sh_entsize' type-id='type-id-8' visibility='default' filepath='./../include/elf/internal.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='bfd_section' type-id='type-id-225' visibility='default' filepath='./../include/elf/internal.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='contents' type-id='type-id-102' visibility='default' filepath='./../include/elf/internal.h' line='116' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='lineno_cache_entry' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='268' column='1' id='type-id-285'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='line_number' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='u' type-id='type-id-344' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='275' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='output_elf_obj_tdata' size-in-bits='768' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1523' column='1' id='type-id-280'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='seg_map' type-id='type-id-345' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1525' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='strtab_ptr' type-id='type-id-346' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1526' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='section_syms' type-id='type-id-347' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1529' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='eh_frame_hdr' type-id='type-id-225' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1533' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='build_id' type-id='type-id-348' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1541' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='program_header_size' type-id='type-id-8' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1544' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='next_file_pos' type-id='type-id-101' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1547' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='num_section_syms' type-id='type-id-19' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1549' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='shstrtab_section' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1550' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='strtab_section' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1550' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='stack_flags' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1553' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='linker' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1557' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='flags_init' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1560' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sdt_note' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1498' column='1' id='type-id-283'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-229' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1500' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-8' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1501' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data' type-id='type-id-343' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1502' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-349' size-in-bits='64' id='type-id-259'/>
    <pointer-type-def type-id='type-id-350' size-in-bits='64' id='type-id-264'/>
    <enum-decl name='bfd_sym_version' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='69' column='1' id='type-id-316'>
      <underlying-type type-id='type-id-25'/>
      <enumerator name='BFD_SYM_VERSION_3_1' value='0'/>
      <enumerator name='BFD_SYM_VERSION_3_2' value='1'/>
      <enumerator name='BFD_SYM_VERSION_3_3' value='2'/>
      <enumerator name='BFD_SYM_VERSION_3_4' value='3'/>
      <enumerator name='BFD_SYM_VERSION_3_5' value='4'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-351' size-in-bits='64' id='type-id-324'/>
    <pointer-type-def type-id='type-id-352' size-in-bits='64' id='type-id-321'/>
    <pointer-type-def type-id='type-id-353' size-in-bits='64' id='type-id-279'/>
    <pointer-type-def type-id='type-id-354' size-in-bits='64' id='type-id-258'/>
    <typedef-decl name='Elf_Internal_Ehdr' type-id='type-id-355' filepath='./../include/elf/internal.h' line='83' column='1' id='type-id-238'/>
    <typedef-decl name='Elf_Internal_Phdr' type-id='type-id-356' filepath='./../include/elf/internal.h' line='98' column='1' id='type-id-240'/>
    <typedef-decl name='Elf_Internal_Verdef' type-id='type-id-357' filepath='./../include/elf/internal.h' line='182' column='1' id='type-id-242'/>
    <typedef-decl name='Elf_Internal_Verneed' type-id='type-id-358' filepath='./../include/elf/internal.h' line='211' column='1' id='type-id-243'/>
    <typedef-decl name='arelent' type-id='type-id-236' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2352' column='1' id='type-id-257'/>
    <typedef-decl name='asection' type-id='type-id-43' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='1584' column='1' id='type-id-245'/>
    <typedef-decl name='bfd_pef_section' type-id='type-id-359' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='119' column='1' id='type-id-253'/>
    <typedef-decl name='carsym' type-id='type-id-360' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='252' column='1' id='type-id-255'/>
    <typedef-decl name='obj_attribute' type-id='type-id-361' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1468' column='1' id='type-id-276'/>
    <pointer-type-def type-id='type-id-362' size-in-bits='64' id='type-id-347'/>
    <array-type-def dimensions='1' type-id='type-id-363' size-in-bits='8' id='type-id-343'>
      <subrange length='1' type-id='type-id-12' id='type-id-239'/>
    </array-type-def>
    <class-decl name='bfd_pef_section' size-in-bits='576' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='104' column='1' id='type-id-359'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name_offset' type-id='type-id-29' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='header_offset' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='default_address' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='total_length' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='unpacked_length' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='container_length' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='container_offset' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='section_kind' type-id='type-id-155' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='456'>
        <var-decl name='share_kind' type-id='type-id-155' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='alignment' type-id='type-id-155' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='472'>
        <var-decl name='reserved' type-id='type-id-155' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='bfd_section' type-id='type-id-225' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/pef.h' line='117' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='carsym' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='247' column='1' id='type-id-360'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-140' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='file_offset' type-id='type-id-101' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='250' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='elf_internal_ehdr' size-in-bits='704' is-struct='yes' visibility='default' filepath='./../include/elf/internal.h' line='68' column='1' id='type-id-355'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='e_ident' type-id='type-id-364' visibility='default' filepath='./../include/elf/internal.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='e_entry' type-id='type-id-35' visibility='default' filepath='./../include/elf/internal.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='e_phoff' type-id='type-id-8' visibility='default' filepath='./../include/elf/internal.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='e_shoff' type-id='type-id-8' visibility='default' filepath='./../include/elf/internal.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='e_version' type-id='type-id-12' visibility='default' filepath='./../include/elf/internal.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='e_flags' type-id='type-id-12' visibility='default' filepath='./../include/elf/internal.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='e_type' type-id='type-id-338' visibility='default' filepath='./../include/elf/internal.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='e_machine' type-id='type-id-338' visibility='default' filepath='./../include/elf/internal.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='e_ehsize' type-id='type-id-13' visibility='default' filepath='./../include/elf/internal.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='e_phentsize' type-id='type-id-13' visibility='default' filepath='./../include/elf/internal.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='e_phnum' type-id='type-id-13' visibility='default' filepath='./../include/elf/internal.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='e_shentsize' type-id='type-id-13' visibility='default' filepath='./../include/elf/internal.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='e_shnum' type-id='type-id-13' visibility='default' filepath='./../include/elf/internal.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='e_shstrndx' type-id='type-id-13' visibility='default' filepath='./../include/elf/internal.h' line='82' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='elf_internal_phdr' size-in-bits='512' is-struct='yes' visibility='default' filepath='./../include/elf/internal.h' line='87' column='1' id='type-id-356'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p_type' type-id='type-id-12' visibility='default' filepath='./../include/elf/internal.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='p_flags' type-id='type-id-12' visibility='default' filepath='./../include/elf/internal.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='p_offset' type-id='type-id-35' visibility='default' filepath='./../include/elf/internal.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='p_vaddr' type-id='type-id-35' visibility='default' filepath='./../include/elf/internal.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='p_paddr' type-id='type-id-35' visibility='default' filepath='./../include/elf/internal.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='p_filesz' type-id='type-id-35' visibility='default' filepath='./../include/elf/internal.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='p_memsz' type-id='type-id-35' visibility='default' filepath='./../include/elf/internal.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='p_align' type-id='type-id-35' visibility='default' filepath='./../include/elf/internal.h' line='95' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='elf_internal_verdef' size-in-bits='576' is-struct='yes' visibility='default' filepath='./../include/elf/internal.h' line='166' column='1' id='type-id-357'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vd_version' type-id='type-id-338' visibility='default' filepath='./../include/elf/internal.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='vd_flags' type-id='type-id-338' visibility='default' filepath='./../include/elf/internal.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vd_ndx' type-id='type-id-338' visibility='default' filepath='./../include/elf/internal.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='vd_cnt' type-id='type-id-338' visibility='default' filepath='./../include/elf/internal.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vd_hash' type-id='type-id-12' visibility='default' filepath='./../include/elf/internal.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='vd_aux' type-id='type-id-12' visibility='default' filepath='./../include/elf/internal.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='vd_next' type-id='type-id-12' visibility='default' filepath='./../include/elf/internal.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='vd_bfd' type-id='type-id-14' visibility='default' filepath='./../include/elf/internal.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='vd_nodename' type-id='type-id-15' visibility='default' filepath='./../include/elf/internal.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='vd_nextdef' type-id='type-id-365' visibility='default' filepath='./../include/elf/internal.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='vd_auxptr' type-id='type-id-366' visibility='default' filepath='./../include/elf/internal.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='vd_exp_refno' type-id='type-id-13' visibility='default' filepath='./../include/elf/internal.h' line='181' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='elf_internal_verneed' size-in-bits='512' is-struct='yes' visibility='default' filepath='./../include/elf/internal.h' line='198' column='1' id='type-id-358'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vn_version' type-id='type-id-338' visibility='default' filepath='./../include/elf/internal.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='vn_cnt' type-id='type-id-338' visibility='default' filepath='./../include/elf/internal.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vn_file' type-id='type-id-12' visibility='default' filepath='./../include/elf/internal.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='vn_aux' type-id='type-id-12' visibility='default' filepath='./../include/elf/internal.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='vn_next' type-id='type-id-12' visibility='default' filepath='./../include/elf/internal.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='vn_bfd' type-id='type-id-14' visibility='default' filepath='./../include/elf/internal.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='vn_filename' type-id='type-id-15' visibility='default' filepath='./../include/elf/internal.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='vn_auxptr' type-id='type-id-367' visibility='default' filepath='./../include/elf/internal.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='vn_nextref' type-id='type-id-368' visibility='default' filepath='./../include/elf/internal.h' line='210' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='elf_link_hash_entry' size-in-bits='1088' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='109' column='1' id='type-id-350'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='root' type-id='type-id-369' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='indx' type-id='type-id-29' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='dynindx' type-id='type-id-29' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='got' type-id='type-id-370' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='plt' type-id='type-id-370' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='size' type-id='type-id-8' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='type' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='other' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='target_internal' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='ref_regular' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='def_regular' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='ref_dynamic' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='def_dynamic' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='ref_regular_nonweak' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='dynamic_adjusted' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='needs_copy' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='needs_plt' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='non_elf' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='hidden' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='forced_local' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='dynamic' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='mark' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='non_got_ref' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='dynamic_def' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='ref_dynamic_nonweak' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23'>
        <var-decl name='pointer_equality_needed' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22'>
        <var-decl name='unique_global' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='dynstr_index' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='u' type-id='type-id-371' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='verinfo' type-id='type-id-372' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='vtable' type-id='type-id-373' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='229' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='htab' size-in-bits='896' is-struct='yes' visibility='default' filepath='./../include/hashtab.h' line='100' column='1' id='type-id-352'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hash_f' type-id='type-id-374' visibility='default' filepath='./../include/hashtab.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='eq_f' type-id='type-id-375' visibility='default' filepath='./../include/hashtab.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='del_f' type-id='type-id-376' visibility='default' filepath='./../include/hashtab.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='entries' type-id='type-id-377' visibility='default' filepath='./../include/hashtab.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='size' type-id='type-id-342' visibility='default' filepath='./../include/hashtab.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='n_elements' type-id='type-id-342' visibility='default' filepath='./../include/hashtab.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='n_deleted' type-id='type-id-342' visibility='default' filepath='./../include/hashtab.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='searches' type-id='type-id-13' visibility='default' filepath='./../include/hashtab.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='collisions' type-id='type-id-13' visibility='default' filepath='./../include/hashtab.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='alloc_f' type-id='type-id-378' visibility='default' filepath='./../include/hashtab.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='free_f' type-id='type-id-379' visibility='default' filepath='./../include/hashtab.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='alloc_arg' type-id='type-id-10' visibility='default' filepath='./../include/hashtab.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='alloc_with_arg_f' type-id='type-id-380' visibility='default' filepath='./../include/hashtab.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='free_with_arg_f' type-id='type-id-381' visibility='default' filepath='./../include/hashtab.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='size_prime_index' type-id='type-id-13' visibility='default' filepath='./../include/hashtab.h' line='141' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='obj_attribute' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1455' column='1' id='type-id-361'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-19' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='i' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1466' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='s' type-id='type-id-140' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1467' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='obj_attribute_list' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1470' column='1' id='type-id-353'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-279' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tag' type-id='type-id-19' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1473' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='attr' type-id='type-id-276' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1474' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1536' column='1' id='type-id-348'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='after_write_object_contents' type-id='type-id-164' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='style' type-id='type-id-15' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1539' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sec' type-id='type-id-225' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='1540' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-382' size-in-bits='64' id='type-id-345'/>
    <pointer-type-def type-id='type-id-383' size-in-bits='64' id='type-id-346'/>
    <enum-decl name='bfd_link_order_type' filepath='./../include/bfdlink.h' line='666' column='1' id='type-id-336'>
      <underlying-type type-id='type-id-25'/>
      <enumerator name='bfd_undefined_link_order' value='0'/>
      <enumerator name='bfd_indirect_link_order' value='1'/>
      <enumerator name='bfd_data_link_order' value='2'/>
      <enumerator name='bfd_section_reloc_link_order' value='3'/>
      <enumerator name='bfd_symbol_reloc_link_order' value='4'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-384' size-in-bits='64' id='type-id-351'/>
    <typedef-decl name='bfd_signed_vma' type-id='type-id-29' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='141' column='1' id='type-id-335'/>
    <typedef-decl name='bfd_sym_table_info' type-id='type-id-385' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='513' column='1' id='type-id-340'/>
    <typedef-decl name='reloc_howto_type' type-id='type-id-386' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='225' column='1' id='type-id-354'/>
    <typedef-decl name='size_t' type-id='type-id-12' filepath='/usr/lib/gcc/x86_64-linux-gnu/7/include/stddef.h' line='216' column='1' id='type-id-342'/>
    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='271' column='1' id='type-id-344'>
      <data-member access='private'>
        <var-decl name='sym' type-id='type-id-44' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='273' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='offset' type-id='type-id-35' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='274' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='./../include/bfdlink.h' line='689' column='1' id='type-id-337'>
      <data-member access='private'>
        <var-decl name='indirect' type-id='type-id-387' visibility='default' filepath='./../include/bfdlink.h' line='700' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='data' type-id='type-id-388' visibility='default' filepath='./../include/bfdlink.h' line='710' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='reloc' type-id='type-id-389' visibility='default' filepath='./../include/bfdlink.h' line='717' column='1'/>
      </data-member>
    </union-decl>
    <array-type-def dimensions='1' type-id='type-id-155' size-in-bits='256' id='type-id-339'>
      <subrange length='32' type-id='type-id-12' id='type-id-390'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-155' size-in-bits='32' id='type-id-341'>
      <subrange length='4' type-id='type-id-12' id='type-id-260'/>
    </array-type-def>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-338'/>
    <pointer-type-def type-id='type-id-391' size-in-bits='64' id='type-id-362'/>
    <class-decl name='bfd_link_hash_entry' size-in-bits='448' is-struct='yes' visibility='default' filepath='./../include/bfdlink.h' line='88' column='1' id='type-id-369'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='root' type-id='type-id-136' visibility='default' filepath='./../include/bfdlink.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='type' type-id='type-id-392' visibility='default' filepath='./../include/bfdlink.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23'>
        <var-decl name='non_ir_ref' type-id='type-id-13' visibility='default' filepath='./../include/bfdlink.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='u' type-id='type-id-393' visibility='default' filepath='./../include/bfdlink.h' line='157' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bfd_sym_table_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='507' column='1' id='type-id-385'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dti_first_page' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dti_page_count' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='510' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dti_object_count' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/xsym.h' line='511' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='elf_segment_map' size-in-bits='640' is-struct='yes' visibility='default' filepath='./../include/elf/internal.h' line='253' column='1' id='type-id-382'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-345' visibility='default' filepath='./../include/elf/internal.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='p_type' type-id='type-id-12' visibility='default' filepath='./../include/elf/internal.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='p_flags' type-id='type-id-12' visibility='default' filepath='./../include/elf/internal.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='p_paddr' type-id='type-id-35' visibility='default' filepath='./../include/elf/internal.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='p_vaddr_offset' type-id='type-id-35' visibility='default' filepath='./../include/elf/internal.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='p_align' type-id='type-id-35' visibility='default' filepath='./../include/elf/internal.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='p_size' type-id='type-id-35' visibility='default' filepath='./../include/elf/internal.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='header_size' type-id='type-id-35' visibility='default' filepath='./../include/elf/internal.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='p_flags_valid' type-id='type-id-13' visibility='default' filepath='./../include/elf/internal.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='p_paddr_valid' type-id='type-id-13' visibility='default' filepath='./../include/elf/internal.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='p_align_valid' type-id='type-id-13' visibility='default' filepath='./../include/elf/internal.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='p_size_valid' type-id='type-id-13' visibility='default' filepath='./../include/elf/internal.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='includes_filehdr' type-id='type-id-13' visibility='default' filepath='./../include/elf/internal.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='includes_phdrs' type-id='type-id-13' visibility='default' filepath='./../include/elf/internal.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='count' type-id='type-id-13' visibility='default' filepath='./../include/elf/internal.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='sections' type-id='type-id-394' visibility='default' filepath='./../include/elf/internal.h' line='290' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='elf_strtab_hash' size-in-bits='576' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-strtab.c' line='48' column='1' id='type-id-383'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='table' type-id='type-id-33' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-strtab.c' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='size' type-id='type-id-8' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-strtab.c' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='alloced' type-id='type-id-8' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-strtab.c' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='sec_size' type-id='type-id-8' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-strtab.c' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='array' type-id='type-id-395' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-strtab.c' line='58' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='got_entry' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-384'/>
    <class-decl name='__anonymous_struct__4' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./../include/bfdlink.h' line='691' column='1' id='type-id-387'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='section' type-id='type-id-225' visibility='default' filepath='./../include/bfdlink.h' line='699' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./../include/bfdlink.h' line='711' column='1' id='type-id-389'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p' type-id='type-id-396' visibility='default' filepath='./../include/bfdlink.h' line='716' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./../include/bfdlink.h' line='701' column='1' id='type-id-388'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-13' visibility='default' filepath='./../include/bfdlink.h' line='707' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='contents' type-id='type-id-397' visibility='default' filepath='./../include/bfdlink.h' line='709' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-398' const='yes' id='type-id-386'/>
    <pointer-type-def type-id='type-id-399' size-in-bits='64' id='type-id-366'/>
    <pointer-type-def type-id='type-id-357' size-in-bits='64' id='type-id-365'/>
    <pointer-type-def type-id='type-id-400' size-in-bits='64' id='type-id-367'/>
    <pointer-type-def type-id='type-id-358' size-in-bits='64' id='type-id-368'/>
    <pointer-type-def type-id='type-id-401' size-in-bits='64' id='type-id-373'/>
    <typedef-decl name='bfd_byte' type-id='type-id-155' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='205' column='1' id='type-id-363'/>
    <typedef-decl name='htab_alloc' type-id='type-id-402' filepath='./../include/hashtab.h' line='75' column='1' id='type-id-378'/>
    <typedef-decl name='htab_alloc_with_arg' type-id='type-id-403' filepath='./../include/hashtab.h' line='82' column='1' id='type-id-380'/>
    <typedef-decl name='htab_del' type-id='type-id-404' filepath='./../include/hashtab.h' line='63' column='1' id='type-id-376'/>
    <typedef-decl name='htab_eq' type-id='type-id-405' filepath='./../include/hashtab.h' line='59' column='1' id='type-id-375'/>
    <typedef-decl name='htab_free' type-id='type-id-404' filepath='./../include/hashtab.h' line='78' column='1' id='type-id-379'/>
    <typedef-decl name='htab_free_with_arg' type-id='type-id-406' filepath='./../include/hashtab.h' line='83' column='1' id='type-id-381'/>
    <typedef-decl name='htab_hash' type-id='type-id-407' filepath='./../include/hashtab.h' line='52' column='1' id='type-id-374'/>
    <union-decl name='gotplt_union' size-in-bits='64' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='86' column='1' id='type-id-370'>
      <data-member access='private'>
        <var-decl name='refcount' type-id='type-id-335' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='88' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='offset' type-id='type-id-35' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='89' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='glist' type-id='type-id-351' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='90' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='plist' type-id='type-id-408' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='91' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='217' column='1' id='type-id-372'>
      <data-member access='private'>
        <var-decl name='verdef' type-id='type-id-223' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='222' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='vertree' type-id='type-id-409' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='226' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='203' column='1' id='type-id-371'>
      <data-member access='private'>
        <var-decl name='weakdef' type-id='type-id-264' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='208' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='elf_hash_value' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='213' column='1'/>
      </data-member>
    </union-decl>
    <array-type-def dimensions='1' type-id='type-id-155' size-in-bits='128' id='type-id-364'>
      <subrange length='16' type-id='type-id-12' id='type-id-410'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-377'/>
    <array-type-def dimensions='1' type-id='type-id-225' size-in-bits='64' id='type-id-394'>
      <subrange length='1' type-id='type-id-12' id='type-id-239'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-363' size-in-bits='64' id='type-id-397'/>
    <pointer-type-def type-id='type-id-411' size-in-bits='64' id='type-id-409'/>
    <pointer-type-def type-id='type-id-412' size-in-bits='64' id='type-id-396'/>
    <class-decl name='elf_internal_verdaux' size-in-bits='256' is-struct='yes' visibility='default' filepath='./../include/elf/internal.h' line='186' column='1' id='type-id-399'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vda_name' type-id='type-id-12' visibility='default' filepath='./../include/elf/internal.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vda_next' type-id='type-id-12' visibility='default' filepath='./../include/elf/internal.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='vda_nodename' type-id='type-id-15' visibility='default' filepath='./../include/elf/internal.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='vda_nextptr' type-id='type-id-366' visibility='default' filepath='./../include/elf/internal.h' line='193' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='elf_internal_vernaux' size-in-bits='384' is-struct='yes' visibility='default' filepath='./../include/elf/internal.h' line='215' column='1' id='type-id-400'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vna_hash' type-id='type-id-12' visibility='default' filepath='./../include/elf/internal.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vna_flags' type-id='type-id-338' visibility='default' filepath='./../include/elf/internal.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='vna_other' type-id='type-id-338' visibility='default' filepath='./../include/elf/internal.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='vna_name' type-id='type-id-12' visibility='default' filepath='./../include/elf/internal.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='vna_next' type-id='type-id-12' visibility='default' filepath='./../include/elf/internal.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='vna_nodename' type-id='type-id-15' visibility='default' filepath='./../include/elf/internal.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='vna_nextptr' type-id='type-id-367' visibility='default' filepath='./../include/elf/internal.h' line='225' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='elf_link_virtual_table_entry' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='94' column='1' id='type-id-401'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-342' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='used' type-id='type-id-413' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='parent' type-id='type-id-264' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-bfd.h' line='104' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='reloc_howto_struct' size-in-bits='640' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2373' column='1' id='type-id-398'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2381' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rightshift' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2385' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-19' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='bitsize' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pc_relative' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2397' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='bitpos' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='complain_on_overflow' type-id='type-id-414' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='special_function' type-id='type-id-415' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='name' type-id='type-id-140' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='partial_inplace' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2433' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='src_mask' type-id='type-id-35' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='dst_mask' type-id='type-id-35' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='pcrel_offset' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2455' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-416' size-in-bits='64' id='type-id-395'/>
    <enum-decl name='bfd_link_hash_type' filepath='./../include/bfdlink.h' line='59' column='1' id='type-id-392'>
      <underlying-type type-id='type-id-25'/>
      <enumerator name='bfd_link_hash_new' value='0'/>
      <enumerator name='bfd_link_hash_undefined' value='1'/>
      <enumerator name='bfd_link_hash_undefweak' value='2'/>
      <enumerator name='bfd_link_hash_defined' value='3'/>
      <enumerator name='bfd_link_hash_defweak' value='4'/>
      <enumerator name='bfd_link_hash_common' value='5'/>
      <enumerator name='bfd_link_hash_indirect' value='6'/>
      <enumerator name='bfd_link_hash_warning' value='7'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-417' size-in-bits='64' id='type-id-405'/>
    <pointer-type-def type-id='type-id-418' size-in-bits='64' id='type-id-408'/>
    <typedef-decl name='asymbol' type-id='type-id-95' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='5916' column='1' id='type-id-391'/>
    <pointer-type-def type-id='type-id-419' size-in-bits='64' id='type-id-407'/>
    <union-decl name='__anonymous_union__' size-in-bits='192' is-anonymous='yes' visibility='default' filepath='./../include/bfdlink.h' line='99' column='1' id='type-id-393'>
      <data-member access='private'>
        <var-decl name='undef' type-id='type-id-420' visibility='default' filepath='./../include/bfdlink.h' line='126' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='def' type-id='type-id-421' visibility='default' filepath='./../include/bfdlink.h' line='133' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='i' type-id='type-id-422' visibility='default' filepath='./../include/bfdlink.h' line='140' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='c' type-id='type-id-423' visibility='default' filepath='./../include/bfdlink.h' line='156' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-424' size-in-bits='64' id='type-id-404'/>
    <pointer-type-def type-id='type-id-425' size-in-bits='64' id='type-id-406'/>
    <pointer-type-def type-id='type-id-426' size-in-bits='64' id='type-id-402'/>
    <pointer-type-def type-id='type-id-427' size-in-bits='64' id='type-id-403'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-413'/>
    <class-decl name='bfd_elf_version_tree' size-in-bits='896' is-struct='yes' visibility='default' filepath='./../include/bfdlink.h' line='810' column='1' id='type-id-411'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-409' visibility='default' filepath='./../include/bfdlink.h' line='813' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-15' visibility='default' filepath='./../include/bfdlink.h' line='815' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='vernum' type-id='type-id-13' visibility='default' filepath='./../include/bfdlink.h' line='817' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='globals' type-id='type-id-428' visibility='default' filepath='./../include/bfdlink.h' line='819' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='locals' type-id='type-id-428' visibility='default' filepath='./../include/bfdlink.h' line='821' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='deps' type-id='type-id-429' visibility='default' filepath='./../include/bfdlink.h' line='823' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='name_indx' type-id='type-id-13' visibility='default' filepath='./../include/bfdlink.h' line='825' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='used' type-id='type-id-19' visibility='default' filepath='./../include/bfdlink.h' line='827' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='match' type-id='type-id-430' visibility='default' filepath='./../include/bfdlink.h' line='829' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bfd_link_order_reloc' size-in-bits='192' is-struct='yes' visibility='default' filepath='./../include/bfdlink.h' line='733' column='1' id='type-id-412'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reloc' type-id='type-id-431' visibility='default' filepath='./../include/bfdlink.h' line='736' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='u' type-id='type-id-432' visibility='default' filepath='./../include/bfdlink.h' line='747' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addend' type-id='type-id-35' visibility='default' filepath='./../include/bfdlink.h' line='754' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='plt_entry' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elfxx-mips.c' line='325' column='1' id='type-id-418'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stub_offset' type-id='type-id-35' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elfxx-mips.c' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mips_offset' type-id='type-id-35' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elfxx-mips.c' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='comp_offset' type-id='type-id-35' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elfxx-mips.c' line='334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='gotplt_index' type-id='type-id-35' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elfxx-mips.c' line='337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='need_mips' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elfxx-mips.c' line='340' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='need_comp' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elfxx-mips.c' line='343' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./../include/bfdlink.h' line='128' column='1' id='type-id-421'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-433' visibility='default' filepath='./../include/bfdlink.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='section' type-id='type-id-225' visibility='default' filepath='./../include/bfdlink.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='value' type-id='type-id-35' visibility='default' filepath='./../include/bfdlink.h' line='132' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./../include/bfdlink.h' line='103' column='1' id='type-id-420'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-433' visibility='default' filepath='./../include/bfdlink.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='abfd' type-id='type-id-14' visibility='default' filepath='./../include/bfdlink.h' line='125' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./../include/bfdlink.h' line='142' column='1' id='type-id-423'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-433' visibility='default' filepath='./../include/bfdlink.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='p' type-id='type-id-434' visibility='default' filepath='./../include/bfdlink.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-8' visibility='default' filepath='./../include/bfdlink.h' line='155' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./../include/bfdlink.h' line='135' column='1' id='type-id-422'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-433' visibility='default' filepath='./../include/bfdlink.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='link' type-id='type-id-433' visibility='default' filepath='./../include/bfdlink.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='warning' type-id='type-id-15' visibility='default' filepath='./../include/bfdlink.h' line='139' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-435' size-in-bits='64' id='type-id-416'/>
    <enum-decl name='complain_overflow' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2354' column='1' id='type-id-414'>
      <underlying-type type-id='type-id-25'/>
      <enumerator name='complain_overflow_dont' value='0'/>
      <enumerator name='complain_overflow_bitfield' value='1'/>
      <enumerator name='complain_overflow_signed' value='2'/>
      <enumerator name='complain_overflow_unsigned' value='3'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-436' size-in-bits='64' id='type-id-415'/>
    <pointer-type-def type-id='type-id-437' size-in-bits='64' id='type-id-429'/>
    <pointer-type-def type-id='type-id-438' size-in-bits='64' id='type-id-430'/>
    <pointer-type-def type-id='type-id-439' size-in-bits='64' id='type-id-434'/>
    <pointer-type-def type-id='type-id-369' size-in-bits='64' id='type-id-433'/>
    <class-decl name='bfd_elf_version_expr_head' size-in-bits='256' is-struct='yes' visibility='default' filepath='./../include/bfdlink.h' line='786' column='1' id='type-id-428'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='list' type-id='type-id-440' visibility='default' filepath='./../include/bfdlink.h' line='789' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='htab' type-id='type-id-10' visibility='default' filepath='./../include/bfdlink.h' line='791' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='remaining' type-id='type-id-440' visibility='default' filepath='./../include/bfdlink.h' line='793' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mask' type-id='type-id-13' visibility='default' filepath='./../include/bfdlink.h' line='795' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='elf_strtab_hash_entry' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-strtab.c' line='32' column='1' id='type-id-435'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='root' type-id='type-id-136' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-strtab.c' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='len' type-id='type-id-19' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-strtab.c' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='refcount' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-strtab.c' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='u' type-id='type-id-441' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/elf-strtab.c' line='43' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='bfd_reloc_code_real_type' type-id='type-id-442' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='5766' column='1' id='type-id-431'/>
    <union-decl name='__anonymous_union__2' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='./../include/bfdlink.h' line='738' column='1' id='type-id-432'>
      <data-member access='private'>
        <var-decl name='section' type-id='type-id-225' visibility='default' filepath='./../include/bfdlink.h' line='743' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='name' type-id='type-id-15' visibility='default' filepath='./../include/bfdlink.h' line='746' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-443' size-in-bits='64' id='type-id-440'/>
    <class-decl name='bfd_elf_version_deps' size-in-bits='128' is-struct='yes' visibility='default' filepath='./../include/bfdlink.h' line='800' column='1' id='type-id-437'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-429' visibility='default' filepath='./../include/bfdlink.h' line='803' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='version_needed' type-id='type-id-409' visibility='default' filepath='./../include/bfdlink.h' line='805' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bfd_link_hash_common_entry' size-in-bits='128' is-struct='yes' visibility='default' filepath='./../include/bfdlink.h' line='79' column='1' id='type-id-439'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='alignment_power' type-id='type-id-13' visibility='default' filepath='./../include/bfdlink.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='section' type-id='type-id-225' visibility='default' filepath='./../include/bfdlink.h' line='82' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='bfd_reloc_code_real' filepath='/tmp/root/spack-stage/spack-stage-binutils-2.24-hr37ntaezaikhjdj2roqdzetjcwdkiuj/spack-src/bfd/bfd.h' line='2514' column='1' id='type-id-442'>
      <underlying-type type-id='type-id-25'/>
      <enumerator name='_dummy_first_bfd_reloc_code_real' value='0'/>
      <enumerator name='BFD_RELOC_64' value='1'/>
      <enumerator name='BFD_RELOC_32' value='2'/>
      <enumerator name='BFD_RELOC_26' value='3'/>
      <enumerator name='BFD_RELOC_24' value='4'/>
      <enumerator name='BFD_RELOC_16' value='5'/>
      <enumerator name='BFD_RELOC_14' value='6'/>
      <enumerator name='BFD_RELOC_8' value='7'/>
      <enumerator name='BFD_RELOC_64_PCREL' value='8'/>
      <enumerator name='BFD_RELOC_32_PCREL' value='9'/>
      <enumerator name='BFD_RELOC_24_PCREL' value='10'/>
      <enumerator name='BFD_RELOC_16_PCREL' value='11'/>
      <enumerator name='BFD_RELOC_12_PCREL' value='12'/>
      <enumerator name='BFD_RELOC_8_PCREL' value='13'/>
      <enumerator name='BFD_RELOC_32_SECREL' value='14'/>
      <enumerator name='BFD_RELOC_32_GOT_PCREL' value='15'/>
      <enumerator name='BFD_RELOC_16_GOT_PCREL' value='16'/>
      <enumerator name='BFD_RELOC_8_GOT_PCREL' value='17'/>
      <enumerator name='BFD_RELOC_32_GOTOFF' value='18'/>
      <enumerator name='BFD_RELOC_16_GOTOFF' value='19'/>
      <enumerator name='BFD_RELOC_LO16_GOTOFF' value='20'/>
      <enumerator name='BFD_RELOC_HI16_GOTOFF' value='21'/>
      <enumerator name='BFD_RELOC_HI16_S_GOTOFF' value='22'/>
      <enumerator name='BFD_RELOC_8_GOTOFF' value='23'/>
      <enumerator name='BFD_RELOC_64_PLT_PCREL' value='24'/>
      <enumerator name='BFD_RELOC_32_PLT_PCREL' value='25'/>
      <enumerator name='BFD_RELOC_24_PLT_PCREL' value='26'/>
      <enumerator name='BFD_RELOC_16_PLT_PCREL' value='27'/>
      <enumerator name='BFD_RELOC_8_PLT_PCREL' value='28'/>
      <enumerator name='BFD_RELOC_64_PLTOFF' value='29'/>
      <enumerator name='BFD_RELOC_32_PLTOFF' value='30'/>
      <enumerator name='BFD_RELOC_16_PLTOFF' value='31'/>
      <enumerator name='BFD_RELOC_LO16_PLTOFF' value='32'/>
      <enumerator name='BFD_RELOC_HI16_PLTOFF' value='33'/>
      <enumerator name='BFD_RELOC_HI16_S_PLTOFF' value='34'/>
      <enumerator name='BFD_RELOC_8_PLTOFF' value='35'/>
      <enumerator name='BFD_RELOC_SIZE32' value='36'/>
      <enumerator name='BFD_RELOC_SIZE64' value='37'/>
      <enumerator name='BFD_RELOC_68K_GLOB_DAT' value='38'/>
      <enumerator name='BFD_RELOC_68K_JMP_SLOT' value='39'/>
      <enumerator name='BFD_RELOC_68K_RELATIVE' value='40'/>
      <enumerator name='BFD_RELOC_68K_TLS_GD32' value='41'/>
      <enumerator name='BFD_RELOC_68K_TLS_GD16' value='42'/>
      <enumerator name='BFD_RELOC_68K_TLS_GD8' value='43'/>
      <enumerator name='BFD_RELOC_68K_TLS_LDM32' value='44'/>
      <enumerator name='BFD_RELOC_68K_TLS_LDM16' value='45'/>
      <enumerator name='BFD_RELOC_68K_TLS_LDM8' value='46'/>
      <enumerator name='BFD_RELOC_68K_TLS_LDO32' value='47'/>
      <enumerator name='BFD_RELOC_68K_TLS_LDO16' value='48'/>
      <enumerator name='BFD_RELOC_68K_TLS_LDO8' value='49'/>
      <enumerator name='BFD_RELOC_68K_TLS_IE32' value='50'/>
      <enumerator name='BFD_RELOC_68K_TLS_IE16' value='51'/>
      <enumerator name='BFD_RELOC_68K_TLS_IE8' value='52'/>
      <enumerator name='BFD_RELOC_68K_TLS_LE32' value='53'/>
      <enumerator name='BFD_RELOC_68K_TLS_LE16' value='54'/>
      <enumerator name='BFD_RELOC_68K_TLS_LE8' value='55'/>
      <enumerator name='BFD_RELOC_32_BASEREL' value='56'/>
      <enumerator name='BFD_RELOC_16_BASEREL' value='57'/>
      <enumerator name='BFD_RELOC_LO16_BASEREL' value='58'/>
      <enumerator name='BFD_RELOC_HI16_BASEREL' value='59'/>
      <enumerator name='BFD_RELOC_HI16_S_BASEREL' value='60'/>
      <enumerator name='BFD_RELOC_8_BASEREL' value='61'/>
      <enumerator name='BFD_RELOC_RVA' value='62'/>
      <enumerator name='BFD_RELOC_8_FFnn' value='63'/>
      <enumerator name='BFD_RELOC_32_PCREL_S2' value='64'/>
      <enumerator name='BFD_RELOC_16_PCREL_S2' value='65'/>
      <enumerator name='BFD_RELOC_23_PCREL_S2' value='66'/>
      <enumerator name='BFD_RELOC_HI22' value='67'/>
      <enumerator name='BFD_RELOC_LO10' value='68'/>
      <enumerator name='BFD_RELOC_GPREL16' value='69'/>
      <enumerator name='BFD_RELOC_GPREL32' value='70'/>
      <enumerator name='BFD_RELOC_I960_CALLJ' value='71'/>
      <enumerator name='BFD_RELOC_NONE' value='72'/>
      <enumerator name='BFD_RELOC_SPARC_WDISP22' value='73'/>
      <enumerator name='BFD_RELOC_SPARC22' value='74'/>
      <enumerator name='BFD_RELOC_SPARC13' value='75'/>
      <enumerator name='BFD_RELOC_SPARC_GOT10' value='76'/>
      <enumerator name='BFD_RELOC_SPARC_GOT13' value='77'/>
      <enumerator name='BFD_RELOC_SPARC_GOT22' value='78'/>
      <enumerator name='BFD_RELOC_SPARC_PC10' value='79'/>
      <enumerator name='BFD_RELOC_SPARC_PC22' value='80'/>
      <enumerator name='BFD_RELOC_SPARC_WPLT30' value='81'/>
      <enumerator name='BFD_RELOC_SPARC_COPY' value='82'/>
      <enumerator name='BFD_RELOC_SPARC_GLOB_DAT' value='83'/>
      <enumerator name='BFD_RELOC_SPARC_JMP_SLOT' value='84'/>
      <enumerator name='BFD_RELOC_SPARC_RELATIVE' value='85'/>
      <enumerator name='BFD_RELOC_SPARC_UA16' value='86'/>
      <enumerator name='BFD_RELOC_SPARC_UA32' value='87'/>
      <enumerator name='BFD_RELOC_SPARC_UA64' value='88'/>
      <enumerator name='BFD_RELOC_SPARC_GOTDATA_HIX22' value='89'/>
      <enumerator name='BFD_RELOC_SPARC_GOTDATA_LOX10' value='90'/>
      <enumerator name='BFD_RELOC_SPARC_GOTDATA_OP_HIX22' value='91'/>
      <enumerator name='BFD_RELOC_SPARC_GOTDATA_OP_LOX10' value='92'/>
      <enumerator name='BFD_RELOC_SPARC_GOTDATA_OP' value='93'/>
      <enumerator name='BFD_RELOC_SPARC_JMP_IREL' value='94'/>
      <enumerator name='BFD_RELOC_SPARC_IRELATIVE' value='95'/>
      <enumerator name='BFD_RELOC_SPARC_BASE13' value='96'/>
      <enumerator name='BFD_RELOC_SPARC_BASE22' value='97'/>
      <enumerator name='BFD_RELOC_SPARC_10' value='98'/>
      <enumerator name='BFD_RELOC_SPARC_11' value='99'/>
      <enumerator name='BFD_RELOC_SPARC_OLO10' value='100'/>
      <enumerator name='BFD_RELOC_SPARC_HH22' value='101'/>
      <enumerator name='BFD_RELOC_SPARC_HM10' value='102'/>
      <enumerator name='BFD_RELOC_SPARC_LM22' value='103'/>
      <enumerator name='BFD_RELOC_SPARC_PC_HH22' value='104'/>
      <enumerator name='BFD_RELOC_SPARC_PC_HM10' value='105'/>
      <enumerator name='BFD_RELOC_SPARC_PC_LM22' value='106'/>
      <enumerator name='BFD_RELOC_SPARC_WDISP16' value='107'/>
      <enumerator name='BFD_RELOC_SPARC_WDISP19' value='108'/>
      <enumerator name='BFD_RELOC_SPARC_7' value='109'/>
      <enumerator name='BFD_RELOC_SPARC_6' value='110'/>
      <enumerator name='BFD_RELOC_SPARC_5' value='111'/>
      <enumerator name='BFD_RELOC_SPARC_PLT32' value='112'/>
      <enumerator name='BFD_RELOC_SPARC_PLT64' value='113'/>
      <enumerator name='BFD_RELOC_SPARC_HIX22' value='114'/>
      <enumerator name='BFD_RELOC_SPARC_LOX10' value='115'/>
      <enumerator name='BFD_RELOC_SPARC_H44' value='116'/>
      <enumerator name='BFD_RELOC_SPARC_M44' value='117'/>
      <enumerator name='BFD_RELOC_SPARC_L44' value='118'/>
      <enumerator name='BFD_RELOC_SPARC_REGISTER' value='119'/>
      <enumerator name='BFD_RELOC_SPARC_H34' value='120'/>
      <enumerator name='BFD_RELOC_SPARC_SIZE32' value='121'/>
      <enumerator name='BFD_RELOC_SPARC_SIZE64' value='122'/>
      <enumerator name='BFD_RELOC_SPARC_WDISP10' value='123'/>
      <enumerator name='BFD_RELOC_SPARC_REV32' value='124'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_GD_HI22' value='125'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_GD_LO10' value='126'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_GD_ADD' value='127'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_GD_CALL' value='128'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_LDM_HI22' value='129'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_LDM_LO10' value='130'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_LDM_ADD' value='131'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_LDM_CALL' value='132'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_LDO_HIX22' value='133'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_LDO_LOX10' value='134'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_LDO_ADD' value='135'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_IE_HI22' value='136'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_IE_LO10' value='137'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_IE_LD' value='138'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_IE_LDX' value='139'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_IE_ADD' value='140'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_LE_HIX22' value='141'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_LE_LOX10' value='142'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_DTPMOD32' value='143'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_DTPMOD64' value='144'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_DTPOFF32' value='145'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_DTPOFF64' value='146'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_TPOFF32' value='147'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_TPOFF64' value='148'/>
      <enumerator name='BFD_RELOC_SPU_IMM7' value='149'/>
      <enumerator name='BFD_RELOC_SPU_IMM8' value='150'/>
      <enumerator name='BFD_RELOC_SPU_IMM10' value='151'/>
      <enumerator name='BFD_RELOC_SPU_IMM10W' value='152'/>
      <enumerator name='BFD_RELOC_SPU_IMM16' value='153'/>
      <enumerator name='BFD_RELOC_SPU_IMM16W' value='154'/>
      <enumerator name='BFD_RELOC_SPU_IMM18' value='155'/>
      <enumerator name='BFD_RELOC_SPU_PCREL9a' value='156'/>
      <enumerator name='BFD_RELOC_SPU_PCREL9b' value='157'/>
      <enumerator name='BFD_RELOC_SPU_PCREL16' value='158'/>
      <enumerator name='BFD_RELOC_SPU_LO16' value='159'/>
      <enumerator name='BFD_RELOC_SPU_HI16' value='160'/>
      <enumerator name='BFD_RELOC_SPU_PPU32' value='161'/>
      <enumerator name='BFD_RELOC_SPU_PPU64' value='162'/>
      <enumerator name='BFD_RELOC_SPU_ADD_PIC' value='163'/>
      <enumerator name='BFD_RELOC_ALPHA_GPDISP_HI16' value='164'/>
      <enumerator name='BFD_RELOC_ALPHA_GPDISP_LO16' value='165'/>
      <enumerator name='BFD_RELOC_ALPHA_GPDISP' value='166'/>
      <enumerator name='BFD_RELOC_ALPHA_LITERAL' value='167'/>
      <enumerator name='BFD_RELOC_ALPHA_ELF_LITERAL' value='168'/>
      <enumerator name='BFD_RELOC_ALPHA_LITUSE' value='169'/>
      <enumerator name='BFD_RELOC_ALPHA_HINT' value='170'/>
      <enumerator name='BFD_RELOC_ALPHA_LINKAGE' value='171'/>
      <enumerator name='BFD_RELOC_ALPHA_CODEADDR' value='172'/>
      <enumerator name='BFD_RELOC_ALPHA_GPREL_HI16' value='173'/>
      <enumerator name='BFD_RELOC_ALPHA_GPREL_LO16' value='174'/>
      <enumerator name='BFD_RELOC_ALPHA_BRSGP' value='175'/>
      <enumerator name='BFD_RELOC_ALPHA_NOP' value='176'/>
      <enumerator name='BFD_RELOC_ALPHA_BSR' value='177'/>
      <enumerator name='BFD_RELOC_ALPHA_LDA' value='178'/>
      <enumerator name='BFD_RELOC_ALPHA_BOH' value='179'/>
      <enumerator name='BFD_RELOC_ALPHA_TLSGD' value='180'/>
      <enumerator name='BFD_RELOC_ALPHA_TLSLDM' value='181'/>
      <enumerator name='BFD_RELOC_ALPHA_DTPMOD64' value='182'/>
      <enumerator name='BFD_RELOC_ALPHA_GOTDTPREL16' value='183'/>
      <enumerator name='BFD_RELOC_ALPHA_DTPREL64' value='184'/>
      <enumerator name='BFD_RELOC_ALPHA_DTPREL_HI16' value='185'/>
      <enumerator name='BFD_RELOC_ALPHA_DTPREL_LO16' value='186'/>
      <enumerator name='BFD_RELOC_ALPHA_DTPREL16' value='187'/>
      <enumerator name='BFD_RELOC_ALPHA_GOTTPREL16' value='188'/>
      <enumerator name='BFD_RELOC_ALPHA_TPREL64' value='189'/>
      <enumerator name='BFD_RELOC_ALPHA_TPREL_HI16' value='190'/>
      <enumerator name='BFD_RELOC_ALPHA_TPREL_LO16' value='191'/>
      <enumerator name='BFD_RELOC_ALPHA_TPREL16' value='192'/>
      <enumerator name='BFD_RELOC_MIPS_JMP' value='193'/>
      <enumerator name='BFD_RELOC_MICROMIPS_JMP' value='194'/>
      <enumerator name='BFD_RELOC_MIPS16_JMP' value='195'/>
      <enumerator name='BFD_RELOC_MIPS16_GPREL' value='196'/>
      <enumerator name='BFD_RELOC_HI16' value='197'/>
      <enumerator name='BFD_RELOC_HI16_S' value='198'/>
      <enumerator name='BFD_RELOC_LO16' value='199'/>
      <enumerator name='BFD_RELOC_HI16_PCREL' value='200'/>
      <enumerator name='BFD_RELOC_HI16_S_PCREL' value='201'/>
      <enumerator name='BFD_RELOC_LO16_PCREL' value='202'/>
      <enumerator name='BFD_RELOC_MIPS16_GOT16' value='203'/>
      <enumerator name='BFD_RELOC_MIPS16_CALL16' value='204'/>
      <enumerator name='BFD_RELOC_MIPS16_HI16' value='205'/>
      <enumerator name='BFD_RELOC_MIPS16_HI16_S' value='206'/>
      <enumerator name='BFD_RELOC_MIPS16_LO16' value='207'/>
      <enumerator name='BFD_RELOC_MIPS16_TLS_GD' value='208'/>
      <enumerator name='BFD_RELOC_MIPS16_TLS_LDM' value='209'/>
      <enumerator name='BFD_RELOC_MIPS16_TLS_DTPREL_HI16' value='210'/>
      <enumerator name='BFD_RELOC_MIPS16_TLS_DTPREL_LO16' value='211'/>
      <enumerator name='BFD_RELOC_MIPS16_TLS_GOTTPREL' value='212'/>
      <enumerator name='BFD_RELOC_MIPS16_TLS_TPREL_HI16' value='213'/>
      <enumerator name='BFD_RELOC_MIPS16_TLS_TPREL_LO16' value='214'/>
      <enumerator name='BFD_RELOC_MIPS_LITERAL' value='215'/>
      <enumerator name='BFD_RELOC_MICROMIPS_LITERAL' value='216'/>
      <enumerator name='BFD_RELOC_MICROMIPS_7_PCREL_S1' value='217'/>
      <enumerator name='BFD_RELOC_MICROMIPS_10_PCREL_S1' value='218'/>
      <enumerator name='BFD_RELOC_MICROMIPS_16_PCREL_S1' value='219'/>
      <enumerator name='BFD_RELOC_MICROMIPS_GPREL16' value='220'/>
      <enumerator name='BFD_RELOC_MICROMIPS_HI16' value='221'/>
      <enumerator name='BFD_RELOC_MICROMIPS_HI16_S' value='222'/>
      <enumerator name='BFD_RELOC_MICROMIPS_LO16' value='223'/>
      <enumerator name='BFD_RELOC_MIPS_GOT16' value='224'/>
      <enumerator name='BFD_RELOC_MICROMIPS_GOT16' value='225'/>
      <enumerator name='BFD_RELOC_MIPS_CALL16' value='226'/>
      <enumerator name='BFD_RELOC_MICROMIPS_CALL16' value='227'/>
      <enumerator name='BFD_RELOC_MIPS_GOT_HI16' value='228'/>
      <enumerator name='BFD_RELOC_MICROMIPS_GOT_HI16' value='229'/>
      <enumerator name='BFD_RELOC_MIPS_GOT_LO16' value='230'/>
      <enumerator name='BFD_RELOC_MICROMIPS_GOT_LO16' value='231'/>
      <enumerator name='BFD_RELOC_MIPS_CALL_HI16' value='232'/>
      <enumerator name='BFD_RELOC_MICROMIPS_CALL_HI16' value='233'/>
      <enumerator name='BFD_RELOC_MIPS_CALL_LO16' value='234'/>
      <enumerator name='BFD_RELOC_MICROMIPS_CALL_LO16' value='235'/>
      <enumerator name='BFD_RELOC_MIPS_SUB' value='236'/>
      <enumerator name='BFD_RELOC_MICROMIPS_SUB' value='237'/>
      <enumerator name='BFD_RELOC_MIPS_GOT_PAGE' value='238'/>
      <enumerator name='BFD_RELOC_MICROMIPS_GOT_PAGE' value='239'/>
      <enumerator name='BFD_RELOC_MIPS_GOT_OFST' value='240'/>
      <enumerator name='BFD_RELOC_MICROMIPS_GOT_OFST' value='241'/>
      <enumerator name='BFD_RELOC_MIPS_GOT_DISP' value='242'/>
      <enumerator name='BFD_RELOC_MICROMIPS_GOT_DISP' value='243'/>
      <enumerator name='BFD_RELOC_MIPS_SHIFT5' value='244'/>
      <enumerator name='BFD_RELOC_MIPS_SHIFT6' value='245'/>
      <enumerator name='BFD_RELOC_MIPS_INSERT_A' value='246'/>
      <enumerator name='BFD_RELOC_MIPS_INSERT_B' value='247'/>
      <enumerator name='BFD_RELOC_MIPS_DELETE' value='248'/>
      <enumerator name='BFD_RELOC_MIPS_HIGHEST' value='249'/>
      <enumerator name='BFD_RELOC_MICROMIPS_HIGHEST' value='250'/>
      <enumerator name='BFD_RELOC_MIPS_HIGHER' value='251'/>
      <enumerator name='BFD_RELOC_MICROMIPS_HIGHER' value='252'/>
      <enumerator name='BFD_RELOC_MIPS_SCN_DISP' value='253'/>
      <enumerator name='BFD_RELOC_MICROMIPS_SCN_DISP' value='254'/>
      <enumerator name='BFD_RELOC_MIPS_REL16' value='255'/>
      <enumerator name='BFD_RELOC_MIPS_RELGOT' value='256'/>
      <enumerator name='BFD_RELOC_MIPS_JALR' value='257'/>
      <enumerator name='BFD_RELOC_MICROMIPS_JALR' value='258'/>
      <enumerator name='BFD_RELOC_MIPS_TLS_DTPMOD32' value='259'/>
      <enumerator name='BFD_RELOC_MIPS_TLS_DTPREL32' value='260'/>
      <enumerator name='BFD_RELOC_MIPS_TLS_DTPMOD64' value='261'/>
      <enumerator name='BFD_RELOC_MIPS_TLS_DTPREL64' value='262'/>
      <enumerator name='BFD_RELOC_MIPS_TLS_GD' value='263'/>
      <enumerator name='BFD_RELOC_MICROMIPS_TLS_GD' value='264'/>
      <enumerator name='BFD_RELOC_MIPS_TLS_LDM' value='265'/>
      <enumerator name='BFD_RELOC_MICROMIPS_TLS_LDM' value='266'/>
      <enumerator name='BFD_RELOC_MIPS_TLS_DTPREL_HI16' value='267'/>
      <enumerator name='BFD_RELOC_MICROMIPS_TLS_DTPREL_HI16' value='268'/>
      <enumerator name='BFD_RELOC_MIPS_TLS_DTPREL_LO16' value='269'/>
      <enumerator name='BFD_RELOC_MICROMIPS_TLS_DTPREL_LO16' value='270'/>
      <enumerator name='BFD_RELOC_MIPS_TLS_GOTTPREL' value='271'/>
      <enumerator name='BFD_RELOC_MICROMIPS_TLS_GOTTPREL' value='272'/>
      <enumerator name='BFD_RELOC_MIPS_TLS_TPREL32' value='273'/>
      <enumerator name='BFD_RELOC_MIPS_TLS_TPREL64' value='274'/>
      <enumerator name='BFD_RELOC_MIPS_TLS_TPREL_HI16' value='275'/>
      <enumerator name='BFD_RELOC_MICROMIPS_TLS_TPREL_HI16' value='276'/>
      <enumerator name='BFD_RELOC_MIPS_TLS_TPREL_LO16' value='277'/>
      <enumerator name='BFD_RELOC_MICROMIPS_TLS_TPREL_LO16' value='278'/>
      <enumerator name='BFD_RELOC_MIPS_EH' value='279'/>
      <enumerator name='BFD_RELOC_MIPS_COPY' value='280'/>
      <enumerator name='BFD_RELOC_MIPS_JUMP_SLOT' value='281'/>
      <enumerator name='BFD_RELOC_MOXIE_10_PCREL' value='282'/>
      <enumerator name='BFD_RELOC_FRV_LABEL16' value='283'/>
      <enumerator name='BFD_RELOC_FRV_LABEL24' value='284'/>
      <enumerator name='BFD_RELOC_FRV_LO16' value='285'/>
      <enumerator name='BFD_RELOC_FRV_HI16' value='286'/>
      <enumerator name='BFD_RELOC_FRV_GPREL12' value='287'/>
      <enumerator name='BFD_RELOC_FRV_GPRELU12' value='288'/>
      <enumerator name='BFD_RELOC_FRV_GPREL32' value='289'/>
      <enumerator name='BFD_RELOC_FRV_GPRELHI' value='290'/>
      <enumerator name='BFD_RELOC_FRV_GPRELLO' value='291'/>
      <enumerator name='BFD_RELOC_FRV_GOT12' value='292'/>
      <enumerator name='BFD_RELOC_FRV_GOTHI' value='293'/>
      <enumerator name='BFD_RELOC_FRV_GOTLO' value='294'/>
      <enumerator name='BFD_RELOC_FRV_FUNCDESC' value='295'/>
      <enumerator name='BFD_RELOC_FRV_FUNCDESC_GOT12' value='296'/>
      <enumerator name='BFD_RELOC_FRV_FUNCDESC_GOTHI' value='297'/>
      <enumerator name='BFD_RELOC_FRV_FUNCDESC_GOTLO' value='298'/>
      <enumerator name='BFD_RELOC_FRV_FUNCDESC_VALUE' value='299'/>
      <enumerator name='BFD_RELOC_FRV_FUNCDESC_GOTOFF12' value='300'/>
      <enumerator name='BFD_RELOC_FRV_FUNCDESC_GOTOFFHI' value='301'/>
      <enumerator name='BFD_RELOC_FRV_FUNCDESC_GOTOFFLO' value='302'/>
      <enumerator name='BFD_RELOC_FRV_GOTOFF12' value='303'/>
      <enumerator name='BFD_RELOC_FRV_GOTOFFHI' value='304'/>
      <enumerator name='BFD_RELOC_FRV_GOTOFFLO' value='305'/>
      <enumerator name='BFD_RELOC_FRV_GETTLSOFF' value='306'/>
      <enumerator name='BFD_RELOC_FRV_TLSDESC_VALUE' value='307'/>
      <enumerator name='BFD_RELOC_FRV_GOTTLSDESC12' value='308'/>
      <enumerator name='BFD_RELOC_FRV_GOTTLSDESCHI' value='309'/>
      <enumerator name='BFD_RELOC_FRV_GOTTLSDESCLO' value='310'/>
      <enumerator name='BFD_RELOC_FRV_TLSMOFF12' value='311'/>
      <enumerator name='BFD_RELOC_FRV_TLSMOFFHI' value='312'/>
      <enumerator name='BFD_RELOC_FRV_TLSMOFFLO' value='313'/>
      <enumerator name='BFD_RELOC_FRV_GOTTLSOFF12' value='314'/>
      <enumerator name='BFD_RELOC_FRV_GOTTLSOFFHI' value='315'/>
      <enumerator name='BFD_RELOC_FRV_GOTTLSOFFLO' value='316'/>
      <enumerator name='BFD_RELOC_FRV_TLSOFF' value='317'/>
      <enumerator name='BFD_RELOC_FRV_TLSDESC_RELAX' value='318'/>
      <enumerator name='BFD_RELOC_FRV_GETTLSOFF_RELAX' value='319'/>
      <enumerator name='BFD_RELOC_FRV_TLSOFF_RELAX' value='320'/>
      <enumerator name='BFD_RELOC_FRV_TLSMOFF' value='321'/>
      <enumerator name='BFD_RELOC_MN10300_GOTOFF24' value='322'/>
      <enumerator name='BFD_RELOC_MN10300_GOT32' value='323'/>
      <enumerator name='BFD_RELOC_MN10300_GOT24' value='324'/>
      <enumerator name='BFD_RELOC_MN10300_GOT16' value='325'/>
      <enumerator name='BFD_RELOC_MN10300_COPY' value='326'/>
      <enumerator name='BFD_RELOC_MN10300_GLOB_DAT' value='327'/>
      <enumerator name='BFD_RELOC_MN10300_JMP_SLOT' value='328'/>
      <enumerator name='BFD_RELOC_MN10300_RELATIVE' value='329'/>
      <enumerator name='BFD_RELOC_MN10300_SYM_DIFF' value='330'/>
      <enumerator name='BFD_RELOC_MN10300_ALIGN' value='331'/>
      <enumerator name='BFD_RELOC_MN10300_TLS_GD' value='332'/>
      <enumerator name='BFD_RELOC_MN10300_TLS_LD' value='333'/>
      <enumerator name='BFD_RELOC_MN10300_TLS_LDO' value='334'/>
      <enumerator name='BFD_RELOC_MN10300_TLS_GOTIE' value='335'/>
      <enumerator name='BFD_RELOC_MN10300_TLS_IE' value='336'/>
      <enumerator name='BFD_RELOC_MN10300_TLS_LE' value='337'/>
      <enumerator name='BFD_RELOC_MN10300_TLS_DTPMOD' value='338'/>
      <enumerator name='BFD_RELOC_MN10300_TLS_DTPOFF' value='339'/>
      <enumerator name='BFD_RELOC_MN10300_TLS_TPOFF' value='340'/>
      <enumerator name='BFD_RELOC_MN10300_32_PCREL' value='341'/>
      <enumerator name='BFD_RELOC_MN10300_16_PCREL' value='342'/>
      <enumerator name='BFD_RELOC_386_GOT32' value='343'/>
      <enumerator name='BFD_RELOC_386_PLT32' value='344'/>
      <enumerator name='BFD_RELOC_386_COPY' value='345'/>
      <enumerator name='BFD_RELOC_386_GLOB_DAT' value='346'/>
      <enumerator name='BFD_RELOC_386_JUMP_SLOT' value='347'/>
      <enumerator name='BFD_RELOC_386_RELATIVE' value='348'/>
      <enumerator name='BFD_RELOC_386_GOTOFF' value='349'/>
      <enumerator name='BFD_RELOC_386_GOTPC' value='350'/>
      <enumerator name='BFD_RELOC_386_TLS_TPOFF' value='351'/>
      <enumerator name='BFD_RELOC_386_TLS_IE' value='352'/>
      <enumerator name='BFD_RELOC_386_TLS_GOTIE' value='353'/>
      <enumerator name='BFD_RELOC_386_TLS_LE' value='354'/>
      <enumerator name='BFD_RELOC_386_TLS_GD' value='355'/>
      <enumerator name='BFD_RELOC_386_TLS_LDM' value='356'/>
      <enumerator name='BFD_RELOC_386_TLS_LDO_32' value='357'/>
      <enumerator name='BFD_RELOC_386_TLS_IE_32' value='358'/>
      <enumerator name='BFD_RELOC_386_TLS_LE_32' value='359'/>
      <enumerator name='BFD_RELOC_386_TLS_DTPMOD32' value='360'/>
      <enumerator name='BFD_RELOC_386_TLS_DTPOFF32' value='361'/>
      <enumerator name='BFD_RELOC_386_TLS_TPOFF32' value='362'/>
      <enumerator name='BFD_RELOC_386_TLS_GOTDESC' value='363'/>
      <enumerator name='BFD_RELOC_386_TLS_DESC_CALL' value='364'/>
      <enumerator name='BFD_RELOC_386_TLS_DESC' value='365'/>
      <enumerator name='BFD_RELOC_386_IRELATIVE' value='366'/>
      <enumerator name='BFD_RELOC_X86_64_GOT32' value='367'/>
      <enumerator name='BFD_RELOC_X86_64_PLT32' value='368'/>
      <enumerator name='BFD_RELOC_X86_64_COPY' value='369'/>
      <enumerator name='BFD_RELOC_X86_64_GLOB_DAT' value='370'/>
      <enumerator name='BFD_RELOC_X86_64_JUMP_SLOT' value='371'/>
      <enumerator name='BFD_RELOC_X86_64_RELATIVE' value='372'/>
      <enumerator name='BFD_RELOC_X86_64_GOTPCREL' value='373'/>
      <enumerator name='BFD_RELOC_X86_64_32S' value='374'/>
      <enumerator name='BFD_RELOC_X86_64_DTPMOD64' value='375'/>
      <enumerator name='BFD_RELOC_X86_64_DTPOFF64' value='376'/>
      <enumerator name='BFD_RELOC_X86_64_TPOFF64' value='377'/>
      <enumerator name='BFD_RELOC_X86_64_TLSGD' value='378'/>
      <enumerator name='BFD_RELOC_X86_64_TLSLD' value='379'/>
      <enumerator name='BFD_RELOC_X86_64_DTPOFF32' value='380'/>
      <enumerator name='BFD_RELOC_X86_64_GOTTPOFF' value='381'/>
      <enumerator name='BFD_RELOC_X86_64_TPOFF32' value='382'/>
      <enumerator name='BFD_RELOC_X86_64_GOTOFF64' value='383'/>
      <enumerator name='BFD_RELOC_X86_64_GOTPC32' value='384'/>
      <enumerator name='BFD_RELOC_X86_64_GOT64' value='385'/>
      <enumerator name='BFD_RELOC_X86_64_GOTPCREL64' value='386'/>
      <enumerator name='BFD_RELOC_X86_64_GOTPC64' value='387'/>
      <enumerator name='BFD_RELOC_X86_64_GOTPLT64' value='388'/>
      <enumerator name='BFD_RELOC_X86_64_PLTOFF64' value='389'/>
      <enumerator name='BFD_RELOC_X86_64_GOTPC32_TLSDESC' value='390'/>
      <enumerator name='BFD_RELOC_X86_64_TLSDESC_CALL' value='391'/>
      <enumerator name='BFD_RELOC_X86_64_TLSDESC' value='392'/>
      <enumerator name='BFD_RELOC_X86_64_IRELATIVE' value='393'/>
      <enumerator name='BFD_RELOC_X86_64_PC32_BND' value='394'/>
      <enumerator name='BFD_RELOC_X86_64_PLT32_BND' value='395'/>
      <enumerator name='BFD_RELOC_NS32K_IMM_8' value='396'/>
      <enumerator name='BFD_RELOC_NS32K_IMM_16' value='397'/>
      <enumerator name='BFD_RELOC_NS32K_IMM_32' value='398'/>
      <enumerator name='BFD_RELOC_NS32K_IMM_8_PCREL' value='399'/>
      <enumerator name='BFD_RELOC_NS32K_IMM_16_PCREL' value='400'/>
      <enumerator name='BFD_RELOC_NS32K_IMM_32_PCREL' value='401'/>
      <enumerator name='BFD_RELOC_NS32K_DISP_8' value='402'/>
      <enumerator name='BFD_RELOC_NS32K_DISP_16' value='403'/>
      <enumerator name='BFD_RELOC_NS32K_DISP_32' value='404'/>
      <enumerator name='BFD_RELOC_NS32K_DISP_8_PCREL' value='405'/>
      <enumerator name='BFD_RELOC_NS32K_DISP_16_PCREL' value='406'/>
      <enumerator name='BFD_RELOC_NS32K_DISP_32_PCREL' value='407'/>
      <enumerator name='BFD_RELOC_PDP11_DISP_8_PCREL' value='408'/>
      <enumerator name='BFD_RELOC_PDP11_DISP_6_PCREL' value='409'/>
      <enumerator name='BFD_RELOC_PJ_CODE_HI16' value='410'/>
      <enumerator name='BFD_RELOC_PJ_CODE_LO16' value='411'/>
      <enumerator name='BFD_RELOC_PJ_CODE_DIR16' value='412'/>
      <enumerator name='BFD_RELOC_PJ_CODE_DIR32' value='413'/>
      <enumerator name='BFD_RELOC_PJ_CODE_REL16' value='414'/>
      <enumerator name='BFD_RELOC_PJ_CODE_REL32' value='415'/>
      <enumerator name='BFD_RELOC_PPC_B26' value='416'/>
      <enumerator name='BFD_RELOC_PPC_BA26' value='417'/>
      <enumerator name='BFD_RELOC_PPC_TOC16' value='418'/>
      <enumerator name='BFD_RELOC_PPC_B16' value='419'/>
      <enumerator name='BFD_RELOC_PPC_B16_BRTAKEN' value='420'/>
      <enumerator name='BFD_RELOC_PPC_B16_BRNTAKEN' value='421'/>
      <enumerator name='BFD_RELOC_PPC_BA16' value='422'/>
      <enumerator name='BFD_RELOC_PPC_BA16_BRTAKEN' value='423'/>
      <enumerator name='BFD_RELOC_PPC_BA16_BRNTAKEN' value='424'/>
      <enumerator name='BFD_RELOC_PPC_COPY' value='425'/>
      <enumerator name='BFD_RELOC_PPC_GLOB_DAT' value='426'/>
      <enumerator name='BFD_RELOC_PPC_JMP_SLOT' value='427'/>
      <enumerator name='BFD_RELOC_PPC_RELATIVE' value='428'/>
      <enumerator name='BFD_RELOC_PPC_LOCAL24PC' value='429'/>
      <enumerator name='BFD_RELOC_PPC_EMB_NADDR32' value='430'/>
      <enumerator name='BFD_RELOC_PPC_EMB_NADDR16' value='431'/>
      <enumerator name='BFD_RELOC_PPC_EMB_NADDR16_LO' value='432'/>
      <enumerator name='BFD_RELOC_PPC_EMB_NADDR16_HI' value='433'/>
      <enumerator name='BFD_RELOC_PPC_EMB_NADDR16_HA' value='434'/>
      <enumerator name='BFD_RELOC_PPC_EMB_SDAI16' value='435'/>
      <enumerator name='BFD_RELOC_PPC_EMB_SDA2I16' value='436'/>
      <enumerator name='BFD_RELOC_PPC_EMB_SDA2REL' value='437'/>
      <enumerator name='BFD_RELOC_PPC_EMB_SDA21' value='438'/>
      <enumerator name='BFD_RELOC_PPC_EMB_MRKREF' value='439'/>
      <enumerator name='BFD_RELOC_PPC_EMB_RELSEC16' value='440'/>
      <enumerator name='BFD_RELOC_PPC_EMB_RELST_LO' value='441'/>
      <enumerator name='BFD_RELOC_PPC_EMB_RELST_HI' value='442'/>
      <enumerator name='BFD_RELOC_PPC_EMB_RELST_HA' value='443'/>
      <enumerator name='BFD_RELOC_PPC_EMB_BIT_FLD' value='444'/>
      <enumerator name='BFD_RELOC_PPC_EMB_RELSDA' value='445'/>
      <enumerator name='BFD_RELOC_PPC_VLE_REL8' value='446'/>
      <enumerator name='BFD_RELOC_PPC_VLE_REL15' value='447'/>
      <enumerator name='BFD_RELOC_PPC_VLE_REL24' value='448'/>
      <enumerator name='BFD_RELOC_PPC_VLE_LO16A' value='449'/>
      <enumerator name='BFD_RELOC_PPC_VLE_LO16D' value='450'/>
      <enumerator name='BFD_RELOC_PPC_VLE_HI16A' value='451'/>
      <enumerator name='BFD_RELOC_PPC_VLE_HI16D' value='452'/>
      <enumerator name='BFD_RELOC_PPC_VLE_HA16A' value='453'/>
      <enumerator name='BFD_RELOC_PPC_VLE_HA16D' value='454'/>
      <enumerator name='BFD_RELOC_PPC_VLE_SDA21' value='455'/>
      <enumerator name='BFD_RELOC_PPC_VLE_SDA21_LO' value='456'/>
      <enumerator name='BFD_RELOC_PPC_VLE_SDAREL_LO16A' value='457'/>
      <enumerator name='BFD_RELOC_PPC_VLE_SDAREL_LO16D' value='458'/>
      <enumerator name='BFD_RELOC_PPC_VLE_SDAREL_HI16A' value='459'/>
      <enumerator name='BFD_RELOC_PPC_VLE_SDAREL_HI16D' value='460'/>
      <enumerator name='BFD_RELOC_PPC_VLE_SDAREL_HA16A' value='461'/>
      <enumerator name='BFD_RELOC_PPC_VLE_SDAREL_HA16D' value='462'/>
      <enumerator name='BFD_RELOC_PPC64_HIGHER' value='463'/>
      <enumerator name='BFD_RELOC_PPC64_HIGHER_S' value='464'/>
      <enumerator name='BFD_RELOC_PPC64_HIGHEST' value='465'/>
      <enumerator name='BFD_RELOC_PPC64_HIGHEST_S' value='466'/>
      <enumerator name='BFD_RELOC_PPC64_TOC16_LO' value='467'/>
      <enumerator name='BFD_RELOC_PPC64_TOC16_HI' value='468'/>
      <enumerator name='BFD_RELOC_PPC64_TOC16_HA' value='469'/>
      <enumerator name='BFD_RELOC_PPC64_TOC' value='470'/>
      <enumerator name='BFD_RELOC_PPC64_PLTGOT16' value='471'/>
      <enumerator name='BFD_RELOC_PPC64_PLTGOT16_LO' value='472'/>
      <enumerator name='BFD_RELOC_PPC64_PLTGOT16_HI' value='473'/>
      <enumerator name='BFD_RELOC_PPC64_PLTGOT16_HA' value='474'/>
      <enumerator name='BFD_RELOC_PPC64_ADDR16_DS' value='475'/>
      <enumerator name='BFD_RELOC_PPC64_ADDR16_LO_DS' value='476'/>
      <enumerator name='BFD_RELOC_PPC64_GOT16_DS' value='477'/>
      <enumerator name='BFD_RELOC_PPC64_GOT16_LO_DS' value='478'/>
      <enumerator name='BFD_RELOC_PPC64_PLT16_LO_DS' value='479'/>
      <enumerator name='BFD_RELOC_PPC64_SECTOFF_DS' value='480'/>
      <enumerator name='BFD_RELOC_PPC64_SECTOFF_LO_DS' value='481'/>
      <enumerator name='BFD_RELOC_PPC64_TOC16_DS' value='482'/>
      <enumerator name='BFD_RELOC_PPC64_TOC16_LO_DS' value='483'/>
      <enumerator name='BFD_RELOC_PPC64_PLTGOT16_DS' value='484'/>
      <enumerator name='BFD_RELOC_PPC64_PLTGOT16_LO_DS' value='485'/>
      <enumerator name='BFD_RELOC_PPC64_ADDR16_HIGH' value='486'/>
      <enumerator name='BFD_RELOC_PPC64_ADDR16_HIGHA' value='487'/>
      <enumerator name='BFD_RELOC_PPC_TLS' value='488'/>
      <enumerator name='BFD_RELOC_PPC_TLSGD' value='489'/>
      <enumerator name='BFD_RELOC_PPC_TLSLD' value='490'/>
      <enumerator name='BFD_RELOC_PPC_DTPMOD' value='491'/>
      <enumerator name='BFD_RELOC_PPC_TPREL16' value='492'/>
      <enumerator name='BFD_RELOC_PPC_TPREL16_LO' value='493'/>
      <enumerator name='BFD_RELOC_PPC_TPREL16_HI' value='494'/>
      <enumerator name='BFD_RELOC_PPC_TPREL16_HA' value='495'/>
      <enumerator name='BFD_RELOC_PPC_TPREL' value='496'/>
      <enumerator name='BFD_RELOC_PPC_DTPREL16' value='497'/>
      <enumerator name='BFD_RELOC_PPC_DTPREL16_LO' value='498'/>
      <enumerator name='BFD_RELOC_PPC_DTPREL16_HI' value='499'/>
      <enumerator name='BFD_RELOC_PPC_DTPREL16_HA' value='500'/>
      <enumerator name='BFD_RELOC_PPC_DTPREL' value='501'/>
      <enumerator name='BFD_RELOC_PPC_GOT_TLSGD16' value='502'/>
      <enumerator name='BFD_RELOC_PPC_GOT_TLSGD16_LO' value='503'/>
      <enumerator name='BFD_RELOC_PPC_GOT_TLSGD16_HI' value='504'/>
      <enumerator name='BFD_RELOC_PPC_GOT_TLSGD16_HA' value='505'/>
      <enumerator name='BFD_RELOC_PPC_GOT_TLSLD16' value='506'/>
      <enumerator name='BFD_RELOC_PPC_GOT_TLSLD16_LO' value='507'/>
      <enumerator name='BFD_RELOC_PPC_GOT_TLSLD16_HI' value='508'/>
      <enumerator name='BFD_RELOC_PPC_GOT_TLSLD16_HA' value='509'/>
      <enumerator name='BFD_RELOC_PPC_GOT_TPREL16' value='510'/>
      <enumerator name='BFD_RELOC_PPC_GOT_TPREL16_LO' value='511'/>
      <enumerator name='BFD_RELOC_PPC_GOT_TPREL16_HI' value='512'/>
      <enumerator name='BFD_RELOC_PPC_GOT_TPREL16_HA' value='513'/>
      <enumerator name='BFD_RELOC_PPC_GOT_DTPREL16' value='514'/>
      <enumerator name='BFD_RELOC_PPC_GOT_DTPREL16_LO' value='515'/>
      <enumerator name='BFD_RELOC_PPC_GOT_DTPREL16_HI' value='516'/>
      <enumerator name='BFD_RELOC_PPC_GOT_DTPREL16_HA' value='517'/>
      <enumerator name='BFD_RELOC_PPC64_TPREL16_DS' value='518'/>
      <enumerator name='BFD_RELOC_PPC64_TPREL16_LO_DS' value='519'/>
      <enumerator name='BFD_RELOC_PPC64_TPREL16_HIGHER' value='520'/>
      <enumerator name='BFD_RELOC_PPC64_TPREL16_HIGHERA' value='521'/>
      <enumerator name='BFD_RELOC_PPC64_TPREL16_HIGHEST' value='522'/>
      <enumerator name='BFD_RELOC_PPC64_TPREL16_HIGHESTA' value='523'/>
      <enumerator name='BFD_RELOC_PPC64_DTPREL16_DS' value='524'/>
      <enumerator name='BFD_RELOC_PPC64_DTPREL16_LO_DS' value='525'/>
      <enumerator name='BFD_RELOC_PPC64_DTPREL16_HIGHER' value='526'/>
      <enumerator name='BFD_RELOC_PPC64_DTPREL16_HIGHERA' value='527'/>
      <enumerator name='BFD_RELOC_PPC64_DTPREL16_HIGHEST' value='528'/>
      <enumerator name='BFD_RELOC_PPC64_DTPREL16_HIGHESTA' value='529'/>
      <enumerator name='BFD_RELOC_PPC64_TPREL16_HIGH' value='530'/>
      <enumerator name='BFD_RELOC_PPC64_TPREL16_HIGHA' value='531'/>
      <enumerator name='BFD_RELOC_PPC64_DTPREL16_HIGH' value='532'/>
      <enumerator name='BFD_RELOC_PPC64_DTPREL16_HIGHA' value='533'/>
      <enumerator name='BFD_RELOC_I370_D12' value='534'/>
      <enumerator name='BFD_RELOC_CTOR' value='535'/>
      <enumerator name='BFD_RELOC_ARM_PCREL_BRANCH' value='536'/>
      <enumerator name='BFD_RELOC_ARM_PCREL_BLX' value='537'/>
      <enumerator name='BFD_RELOC_THUMB_PCREL_BLX' value='538'/>
      <enumerator name='BFD_RELOC_ARM_PCREL_CALL' value='539'/>
      <enumerator name='BFD_RELOC_ARM_PCREL_JUMP' value='540'/>
      <enumerator name='BFD_RELOC_THUMB_PCREL_BRANCH7' value='541'/>
      <enumerator name='BFD_RELOC_THUMB_PCREL_BRANCH9' value='542'/>
      <enumerator name='BFD_RELOC_THUMB_PCREL_BRANCH12' value='543'/>
      <enumerator name='BFD_RELOC_THUMB_PCREL_BRANCH20' value='544'/>
      <enumerator name='BFD_RELOC_THUMB_PCREL_BRANCH23' value='545'/>
      <enumerator name='BFD_RELOC_THUMB_PCREL_BRANCH25' value='546'/>
      <enumerator name='BFD_RELOC_ARM_OFFSET_IMM' value='547'/>
      <enumerator name='BFD_RELOC_ARM_THUMB_OFFSET' value='548'/>
      <enumerator name='BFD_RELOC_ARM_TARGET1' value='549'/>
      <enumerator name='BFD_RELOC_ARM_ROSEGREL32' value='550'/>
      <enumerator name='BFD_RELOC_ARM_SBREL32' value='551'/>
      <enumerator name='BFD_RELOC_ARM_TARGET2' value='552'/>
      <enumerator name='BFD_RELOC_ARM_PREL31' value='553'/>
      <enumerator name='BFD_RELOC_ARM_MOVW' value='554'/>
      <enumerator name='BFD_RELOC_ARM_MOVT' value='555'/>
      <enumerator name='BFD_RELOC_ARM_MOVW_PCREL' value='556'/>
      <enumerator name='BFD_RELOC_ARM_MOVT_PCREL' value='557'/>
      <enumerator name='BFD_RELOC_ARM_THUMB_MOVW' value='558'/>
      <enumerator name='BFD_RELOC_ARM_THUMB_MOVT' value='559'/>
      <enumerator name='BFD_RELOC_ARM_THUMB_MOVW_PCREL' value='560'/>
      <enumerator name='BFD_RELOC_ARM_THUMB_MOVT_PCREL' value='561'/>
      <enumerator name='BFD_RELOC_ARM_JUMP_SLOT' value='562'/>
      <enumerator name='BFD_RELOC_ARM_GLOB_DAT' value='563'/>
      <enumerator name='BFD_RELOC_ARM_GOT32' value='564'/>
      <enumerator name='BFD_RELOC_ARM_PLT32' value='565'/>
      <enumerator name='BFD_RELOC_ARM_RELATIVE' value='566'/>
      <enumerator name='BFD_RELOC_ARM_GOTOFF' value='567'/>
      <enumerator name='BFD_RELOC_ARM_GOTPC' value='568'/>
      <enumerator name='BFD_RELOC_ARM_GOT_PREL' value='569'/>
      <enumerator name='BFD_RELOC_ARM_TLS_GD32' value='570'/>
      <enumerator name='BFD_RELOC_ARM_TLS_LDO32' value='571'/>
      <enumerator name='BFD_RELOC_ARM_TLS_LDM32' value='572'/>
      <enumerator name='BFD_RELOC_ARM_TLS_DTPOFF32' value='573'/>
      <enumerator name='BFD_RELOC_ARM_TLS_DTPMOD32' value='574'/>
      <enumerator name='BFD_RELOC_ARM_TLS_TPOFF32' value='575'/>
      <enumerator name='BFD_RELOC_ARM_TLS_IE32' value='576'/>
      <enumerator name='BFD_RELOC_ARM_TLS_LE32' value='577'/>
      <enumerator name='BFD_RELOC_ARM_TLS_GOTDESC' value='578'/>
      <enumerator name='BFD_RELOC_ARM_TLS_CALL' value='579'/>
      <enumerator name='BFD_RELOC_ARM_THM_TLS_CALL' value='580'/>
      <enumerator name='BFD_RELOC_ARM_TLS_DESCSEQ' value='581'/>
      <enumerator name='BFD_RELOC_ARM_THM_TLS_DESCSEQ' value='582'/>
      <enumerator name='BFD_RELOC_ARM_TLS_DESC' value='583'/>
      <enumerator name='BFD_RELOC_ARM_ALU_PC_G0_NC' value='584'/>
      <enumerator name='BFD_RELOC_ARM_ALU_PC_G0' value='585'/>
      <enumerator name='BFD_RELOC_ARM_ALU_PC_G1_NC' value='586'/>
      <enumerator name='BFD_RELOC_ARM_ALU_PC_G1' value='587'/>
      <enumerator name='BFD_RELOC_ARM_ALU_PC_G2' value='588'/>
      <enumerator name='BFD_RELOC_ARM_LDR_PC_G0' value='589'/>
      <enumerator name='BFD_RELOC_ARM_LDR_PC_G1' value='590'/>
      <enumerator name='BFD_RELOC_ARM_LDR_PC_G2' value='591'/>
      <enumerator name='BFD_RELOC_ARM_LDRS_PC_G0' value='592'/>
      <enumerator name='BFD_RELOC_ARM_LDRS_PC_G1' value='593'/>
      <enumerator name='BFD_RELOC_ARM_LDRS_PC_G2' value='594'/>
      <enumerator name='BFD_RELOC_ARM_LDC_PC_G0' value='595'/>
      <enumerator name='BFD_RELOC_ARM_LDC_PC_G1' value='596'/>
      <enumerator name='BFD_RELOC_ARM_LDC_PC_G2' value='597'/>
      <enumerator name='BFD_RELOC_ARM_ALU_SB_G0_NC' value='598'/>
      <enumerator name='BFD_RELOC_ARM_ALU_SB_G0' value='599'/>
      <enumerator name='BFD_RELOC_ARM_ALU_SB_G1_NC' value='600'/>
      <enumerator name='BFD_RELOC_ARM_ALU_SB_G1' value='601'/>
      <enumerator name='BFD_RELOC_ARM_ALU_SB_G2' value='602'/>
      <enumerator name='BFD_RELOC_ARM_LDR_SB_G0' value='603'/>
      <enumerator name='BFD_RELOC_ARM_LDR_SB_G1' value='604'/>
      <enumerator name='BFD_RELOC_ARM_LDR_SB_G2' value='605'/>
      <enumerator name='BFD_RELOC_ARM_LDRS_SB_G0' value='606'/>
      <enumerator name='BFD_RELOC_ARM_LDRS_SB_G1' value='607'/>
      <enumerator name='BFD_RELOC_ARM_LDRS_SB_G2' value='608'/>
      <enumerator name='BFD_RELOC_ARM_LDC_SB_G0' value='609'/>
      <enumerator name='BFD_RELOC_ARM_LDC_SB_G1' value='610'/>
      <enumerator name='BFD_RELOC_ARM_LDC_SB_G2' value='611'/>
      <enumerator name='BFD_RELOC_ARM_V4BX' value='612'/>
      <enumerator name='BFD_RELOC_ARM_IRELATIVE' value='613'/>
      <enumerator name='BFD_RELOC_ARM_IMMEDIATE' value='614'/>
      <enumerator name='BFD_RELOC_ARM_ADRL_IMMEDIATE' value='615'/>
      <enumerator name='BFD_RELOC_ARM_T32_IMMEDIATE' value='616'/>
      <enumerator name='BFD_RELOC_ARM_T32_ADD_IMM' value='617'/>
      <enumerator name='BFD_RELOC_ARM_T32_IMM12' value='618'/>
      <enumerator name='BFD_RELOC_ARM_T32_ADD_PC12' value='619'/>
      <enumerator name='BFD_RELOC_ARM_SHIFT_IMM' value='620'/>
      <enumerator name='BFD_RELOC_ARM_SMC' value='621'/>
      <enumerator name='BFD_RELOC_ARM_HVC' value='622'/>
      <enumerator name='BFD_RELOC_ARM_SWI' value='623'/>
      <enumerator name='BFD_RELOC_ARM_MULTI' value='624'/>
      <enumerator name='BFD_RELOC_ARM_CP_OFF_IMM' value='625'/>
      <enumerator name='BFD_RELOC_ARM_CP_OFF_IMM_S2' value='626'/>
      <enumerator name='BFD_RELOC_ARM_T32_CP_OFF_IMM' value='627'/>
      <enumerator name='BFD_RELOC_ARM_T32_CP_OFF_IMM_S2' value='628'/>
      <enumerator name='BFD_RELOC_ARM_ADR_IMM' value='629'/>
      <enumerator name='BFD_RELOC_ARM_LDR_IMM' value='630'/>
      <enumerator name='BFD_RELOC_ARM_LITERAL' value='631'/>
      <enumerator name='BFD_RELOC_ARM_IN_POOL' value='632'/>
      <enumerator name='BFD_RELOC_ARM_OFFSET_IMM8' value='633'/>
      <enumerator name='BFD_RELOC_ARM_T32_OFFSET_U8' value='634'/>
      <enumerator name='BFD_RELOC_ARM_T32_OFFSET_IMM' value='635'/>
      <enumerator name='BFD_RELOC_ARM_HWLITERAL' value='636'/>
      <enumerator name='BFD_RELOC_ARM_THUMB_ADD' value='637'/>
      <enumerator name='BFD_RELOC_ARM_THUMB_IMM' value='638'/>
      <enumerator name='BFD_RELOC_ARM_THUMB_SHIFT' value='639'/>
      <enumerator name='BFD_RELOC_SH_PCDISP8BY2' value='640'/>
      <enumerator name='BFD_RELOC_SH_PCDISP12BY2' value='641'/>
      <enumerator name='BFD_RELOC_SH_IMM3' value='642'/>
      <enumerator name='BFD_RELOC_SH_IMM3U' value='643'/>
      <enumerator name='BFD_RELOC_SH_DISP12' value='644'/>
      <enumerator name='BFD_RELOC_SH_DISP12BY2' value='645'/>
      <enumerator name='BFD_RELOC_SH_DISP12BY4' value='646'/>
      <enumerator name='BFD_RELOC_SH_DISP12BY8' value='647'/>
      <enumerator name='BFD_RELOC_SH_DISP20' value='648'/>
      <enumerator name='BFD_RELOC_SH_DISP20BY8' value='649'/>
      <enumerator name='BFD_RELOC_SH_IMM4' value='650'/>
      <enumerator name='BFD_RELOC_SH_IMM4BY2' value='651'/>
      <enumerator name='BFD_RELOC_SH_IMM4BY4' value='652'/>
      <enumerator name='BFD_RELOC_SH_IMM8' value='653'/>
      <enumerator name='BFD_RELOC_SH_IMM8BY2' value='654'/>
      <enumerator name='BFD_RELOC_SH_IMM8BY4' value='655'/>
      <enumerator name='BFD_RELOC_SH_PCRELIMM8BY2' value='656'/>
      <enumerator name='BFD_RELOC_SH_PCRELIMM8BY4' value='657'/>
      <enumerator name='BFD_RELOC_SH_SWITCH16' value='658'/>
      <enumerator name='BFD_RELOC_SH_SWITCH32' value='659'/>
      <enumerator name='BFD_RELOC_SH_USES' value='660'/>
      <enumerator name='BFD_RELOC_SH_COUNT' value='661'/>
      <enumerator name='BFD_RELOC_SH_ALIGN' value='662'/>
      <enumerator name='BFD_RELOC_SH_CODE' value='663'/>
      <enumerator name='BFD_RELOC_SH_DATA' value='664'/>
      <enumerator name='BFD_RELOC_SH_LABEL' value='665'/>
      <enumerator name='BFD_RELOC_SH_LOOP_START' value='666'/>
      <enumerator name='BFD_RELOC_SH_LOOP_END' value='667'/>
      <enumerator name='BFD_RELOC_SH_COPY' value='668'/>
      <enumerator name='BFD_RELOC_SH_GLOB_DAT' value='669'/>
      <enumerator name='BFD_RELOC_SH_JMP_SLOT' value='670'/>
      <enumerator name='BFD_RELOC_SH_RELATIVE' value='671'/>
      <enumerator name='BFD_RELOC_SH_GOTPC' value='672'/>
      <enumerator name='BFD_RELOC_SH_GOT_LOW16' value='673'/>
      <enumerator name='BFD_RELOC_SH_GOT_MEDLOW16' value='674'/>
      <enumerator name='BFD_RELOC_SH_GOT_MEDHI16' value='675'/>
      <enumerator name='BFD_RELOC_SH_GOT_HI16' value='676'/>
      <enumerator name='BFD_RELOC_SH_GOTPLT_LOW16' value='677'/>
      <enumerator name='BFD_RELOC_SH_GOTPLT_MEDLOW16' value='678'/>
      <enumerator name='BFD_RELOC_SH_GOTPLT_MEDHI16' value='679'/>
      <enumerator name='BFD_RELOC_SH_GOTPLT_HI16' value='680'/>
      <enumerator name='BFD_RELOC_SH_PLT_LOW16' value='681'/>
      <enumerator name='BFD_RELOC_SH_PLT_MEDLOW16' value='682'/>
      <enumerator name='BFD_RELOC_SH_PLT_MEDHI16' value='683'/>
      <enumerator name='BFD_RELOC_SH_PLT_HI16' value='684'/>
      <enumerator name='BFD_RELOC_SH_GOTOFF_LOW16' value='685'/>
      <enumerator name='BFD_RELOC_SH_GOTOFF_MEDLOW16' value='686'/>
      <enumerator name='BFD_RELOC_SH_GOTOFF_MEDHI16' value='687'/>
      <enumerator name='BFD_RELOC_SH_GOTOFF_HI16' value='688'/>
      <enumerator name='BFD_RELOC_SH_GOTPC_LOW16' value='689'/>
      <enumerator name='BFD_RELOC_SH_GOTPC_MEDLOW16' value='690'/>
      <enumerator name='BFD_RELOC_SH_GOTPC_MEDHI16' value='691'/>
      <enumerator name='BFD_RELOC_SH_GOTPC_HI16' value='692'/>
      <enumerator name='BFD_RELOC_SH_COPY64' value='693'/>
      <enumerator name='BFD_RELOC_SH_GLOB_DAT64' value='694'/>
      <enumerator name='BFD_RELOC_SH_JMP_SLOT64' value='695'/>
      <enumerator name='BFD_RELOC_SH_RELATIVE64' value='696'/>
      <enumerator name='BFD_RELOC_SH_GOT10BY4' value='697'/>
      <enumerator name='BFD_RELOC_SH_GOT10BY8' value='698'/>
      <enumerator name='BFD_RELOC_SH_GOTPLT10BY4' value='699'/>
      <enumerator name='BFD_RELOC_SH_GOTPLT10BY8' value='700'/>
      <enumerator name='BFD_RELOC_SH_GOTPLT32' value='701'/>
      <enumerator name='BFD_RELOC_SH_SHMEDIA_CODE' value='702'/>
      <enumerator name='BFD_RELOC_SH_IMMU5' value='703'/>
      <enumerator name='BFD_RELOC_SH_IMMS6' value='704'/>
      <enumerator name='BFD_RELOC_SH_IMMS6BY32' value='705'/>
      <enumerator name='BFD_RELOC_SH_IMMU6' value='706'/>
      <enumerator name='BFD_RELOC_SH_IMMS10' value='707'/>
      <enumerator name='BFD_RELOC_SH_IMMS10BY2' value='708'/>
      <enumerator name='BFD_RELOC_SH_IMMS10BY4' value='709'/>
      <enumerator name='BFD_RELOC_SH_IMMS10BY8' value='710'/>
      <enumerator name='BFD_RELOC_SH_IMMS16' value='711'/>
      <enumerator name='BFD_RELOC_SH_IMMU16' value='712'/>
      <enumerator name='BFD_RELOC_SH_IMM_LOW16' value='713'/>
      <enumerator name='BFD_RELOC_SH_IMM_LOW16_PCREL' value='714'/>
      <enumerator name='BFD_RELOC_SH_IMM_MEDLOW16' value='715'/>
      <enumerator name='BFD_RELOC_SH_IMM_MEDLOW16_PCREL' value='716'/>
      <enumerator name='BFD_RELOC_SH_IMM_MEDHI16' value='717'/>
      <enumerator name='BFD_RELOC_SH_IMM_MEDHI16_PCREL' value='718'/>
      <enumerator name='BFD_RELOC_SH_IMM_HI16' value='719'/>
      <enumerator name='BFD_RELOC_SH_IMM_HI16_PCREL' value='720'/>
      <enumerator name='BFD_RELOC_SH_PT_16' value='721'/>
      <enumerator name='BFD_RELOC_SH_TLS_GD_32' value='722'/>
      <enumerator name='BFD_RELOC_SH_TLS_LD_32' value='723'/>
      <enumerator name='BFD_RELOC_SH_TLS_LDO_32' value='724'/>
      <enumerator name='BFD_RELOC_SH_TLS_IE_32' value='725'/>
      <enumerator name='BFD_RELOC_SH_TLS_LE_32' value='726'/>
      <enumerator name='BFD_RELOC_SH_TLS_DTPMOD32' value='727'/>
      <enumerator name='BFD_RELOC_SH_TLS_DTPOFF32' value='728'/>
      <enumerator name='BFD_RELOC_SH_TLS_TPOFF32' value='729'/>
      <enumerator name='BFD_RELOC_SH_GOT20' value='730'/>
      <enumerator name='BFD_RELOC_SH_GOTOFF20' value='731'/>
      <enumerator name='BFD_RELOC_SH_GOTFUNCDESC' value='732'/>
      <enumerator name='BFD_RELOC_SH_GOTFUNCDESC20' value='733'/>
      <enumerator name='BFD_RELOC_SH_GOTOFFFUNCDESC' value='734'/>
      <enumerator name='BFD_RELOC_SH_GOTOFFFUNCDESC20' value='735'/>
      <enumerator name='BFD_RELOC_SH_FUNCDESC' value='736'/>
      <enumerator name='BFD_RELOC_ARC_B22_PCREL' value='737'/>
      <enumerator name='BFD_RELOC_ARC_B26' value='738'/>
      <enumerator name='BFD_RELOC_BFIN_16_IMM' value='739'/>
      <enumerator name='BFD_RELOC_BFIN_16_HIGH' value='740'/>
      <enumerator name='BFD_RELOC_BFIN_4_PCREL' value='741'/>
      <enumerator name='BFD_RELOC_BFIN_5_PCREL' value='742'/>
      <enumerator name='BFD_RELOC_BFIN_16_LOW' value='743'/>
      <enumerator name='BFD_RELOC_BFIN_10_PCREL' value='744'/>
      <enumerator name='BFD_RELOC_BFIN_11_PCREL' value='745'/>
      <enumerator name='BFD_RELOC_BFIN_12_PCREL_JUMP' value='746'/>
      <enumerator name='BFD_RELOC_BFIN_12_PCREL_JUMP_S' value='747'/>
      <enumerator name='BFD_RELOC_BFIN_24_PCREL_CALL_X' value='748'/>
      <enumerator name='BFD_RELOC_BFIN_24_PCREL_JUMP_L' value='749'/>
      <enumerator name='BFD_RELOC_BFIN_GOT17M4' value='750'/>
      <enumerator name='BFD_RELOC_BFIN_GOTHI' value='751'/>
      <enumerator name='BFD_RELOC_BFIN_GOTLO' value='752'/>
      <enumerator name='BFD_RELOC_BFIN_FUNCDESC' value='753'/>
      <enumerator name='BFD_RELOC_BFIN_FUNCDESC_GOT17M4' value='754'/>
      <enumerator name='BFD_RELOC_BFIN_FUNCDESC_GOTHI' value='755'/>
      <enumerator name='BFD_RELOC_BFIN_FUNCDESC_GOTLO' value='756'/>
      <enumerator name='BFD_RELOC_BFIN_FUNCDESC_VALUE' value='757'/>
      <enumerator name='BFD_RELOC_BFIN_FUNCDESC_GOTOFF17M4' value='758'/>
      <enumerator name='BFD_RELOC_BFIN_FUNCDESC_GOTOFFHI' value='759'/>
      <enumerator name='BFD_RELOC_BFIN_FUNCDESC_GOTOFFLO' value='760'/>
      <enumerator name='BFD_RELOC_BFIN_GOTOFF17M4' value='761'/>
      <enumerator name='BFD_RELOC_BFIN_GOTOFFHI' value='762'/>
      <enumerator name='BFD_RELOC_BFIN_GOTOFFLO' value='763'/>
      <enumerator name='BFD_RELOC_BFIN_GOT' value='764'/>
      <enumerator name='BFD_RELOC_BFIN_PLTPC' value='765'/>
      <enumerator name='BFD_ARELOC_BFIN_PUSH' value='766'/>
      <enumerator name='BFD_ARELOC_BFIN_CONST' value='767'/>
      <enumerator name='BFD_ARELOC_BFIN_ADD' value='768'/>
      <enumerator name='BFD_ARELOC_BFIN_SUB' value='769'/>
      <enumerator name='BFD_ARELOC_BFIN_MULT' value='770'/>
      <enumerator name='BFD_ARELOC_BFIN_DIV' value='771'/>
      <enumerator name='BFD_ARELOC_BFIN_MOD' value='772'/>
      <enumerator name='BFD_ARELOC_BFIN_LSHIFT' value='773'/>
      <enumerator name='BFD_ARELOC_BFIN_RSHIFT' value='774'/>
      <enumerator name='BFD_ARELOC_BFIN_AND' value='775'/>
      <enumerator name='BFD_ARELOC_BFIN_OR' value='776'/>
      <enumerator name='BFD_ARELOC_BFIN_XOR' value='777'/>
      <enumerator name='BFD_ARELOC_BFIN_LAND' value='778'/>
      <enumerator name='BFD_ARELOC_BFIN_LOR' value='779'/>
      <enumerator name='BFD_ARELOC_BFIN_LEN' value='780'/>
      <enumerator name='BFD_ARELOC_BFIN_NEG' value='781'/>
      <enumerator name='BFD_ARELOC_BFIN_COMP' value='782'/>
      <enumerator name='BFD_ARELOC_BFIN_PAGE' value='783'/>
      <enumerator name='BFD_ARELOC_BFIN_HWPAGE' value='784'/>
      <enumerator name='BFD_ARELOC_BFIN_ADDR' value='785'/>
      <enumerator name='BFD_RELOC_D10V_10_PCREL_R' value='786'/>
      <enumerator name='BFD_RELOC_D10V_10_PCREL_L' value='787'/>
      <enumerator name='BFD_RELOC_D10V_18' value='788'/>
      <enumerator name='BFD_RELOC_D10V_18_PCREL' value='789'/>
      <enumerator name='BFD_RELOC_D30V_6' value='790'/>
      <enumerator name='BFD_RELOC_D30V_9_PCREL' value='791'/>
      <enumerator name='BFD_RELOC_D30V_9_PCREL_R' value='792'/>
      <enumerator name='BFD_RELOC_D30V_15' value='793'/>
      <enumerator name='BFD_RELOC_D30V_15_PCREL' value='794'/>
      <enumerator name='BFD_RELOC_D30V_15_PCREL_R' value='795'/>
      <enumerator name='BFD_RELOC_D30V_21' value='796'/>
      <enumerator name='BFD_RELOC_D30V_21_PCREL' value='797'/>
      <enumerator name='BFD_RELOC_D30V_21_PCREL_R' value='798'/>
      <enumerator name='BFD_RELOC_D30V_32' value='799'/>
      <enumerator name='BFD_RELOC_D30V_32_PCREL' value='800'/>
      <enumerator name='BFD_RELOC_DLX_HI16_S' value='801'/>
      <enumerator name='BFD_RELOC_DLX_LO16' value='802'/>
      <enumerator name='BFD_RELOC_DLX_JMP26' value='803'/>
      <enumerator name='BFD_RELOC_M32C_HI8' value='804'/>
      <enumerator name='BFD_RELOC_M32C_RL_JUMP' value='805'/>
      <enumerator name='BFD_RELOC_M32C_RL_1ADDR' value='806'/>
      <enumerator name='BFD_RELOC_M32C_RL_2ADDR' value='807'/>
      <enumerator name='BFD_RELOC_M32R_24' value='808'/>
      <enumerator name='BFD_RELOC_M32R_10_PCREL' value='809'/>
      <enumerator name='BFD_RELOC_M32R_18_PCREL' value='810'/>
      <enumerator name='BFD_RELOC_M32R_26_PCREL' value='811'/>
      <enumerator name='BFD_RELOC_M32R_HI16_ULO' value='812'/>
      <enumerator name='BFD_RELOC_M32R_HI16_SLO' value='813'/>
      <enumerator name='BFD_RELOC_M32R_LO16' value='814'/>
      <enumerator name='BFD_RELOC_M32R_SDA16' value='815'/>
      <enumerator name='BFD_RELOC_M32R_GOT24' value='816'/>
      <enumerator name='BFD_RELOC_M32R_26_PLTREL' value='817'/>
      <enumerator name='BFD_RELOC_M32R_COPY' value='818'/>
      <enumerator name='BFD_RELOC_M32R_GLOB_DAT' value='819'/>
      <enumerator name='BFD_RELOC_M32R_JMP_SLOT' value='820'/>
      <enumerator name='BFD_RELOC_M32R_RELATIVE' value='821'/>
      <enumerator name='BFD_RELOC_M32R_GOTOFF' value='822'/>
      <enumerator name='BFD_RELOC_M32R_GOTOFF_HI_ULO' value='823'/>
      <enumerator name='BFD_RELOC_M32R_GOTOFF_HI_SLO' value='824'/>
      <enumerator name='BFD_RELOC_M32R_GOTOFF_LO' value='825'/>
      <enumerator name='BFD_RELOC_M32R_GOTPC24' value='826'/>
      <enumerator name='BFD_RELOC_M32R_GOT16_HI_ULO' value='827'/>
      <enumerator name='BFD_RELOC_M32R_GOT16_HI_SLO' value='828'/>
      <enumerator name='BFD_RELOC_M32R_GOT16_LO' value='829'/>
      <enumerator name='BFD_RELOC_M32R_GOTPC_HI_ULO' value='830'/>
      <enumerator name='BFD_RELOC_M32R_GOTPC_HI_SLO' value='831'/>
      <enumerator name='BFD_RELOC_M32R_GOTPC_LO' value='832'/>
      <enumerator name='BFD_RELOC_V850_9_PCREL' value='833'/>
      <enumerator name='BFD_RELOC_V850_22_PCREL' value='834'/>
      <enumerator name='BFD_RELOC_V850_SDA_16_16_OFFSET' value='835'/>
      <enumerator name='BFD_RELOC_V850_SDA_15_16_OFFSET' value='836'/>
      <enumerator name='BFD_RELOC_V850_ZDA_16_16_OFFSET' value='837'/>
      <enumerator name='BFD_RELOC_V850_ZDA_15_16_OFFSET' value='838'/>
      <enumerator name='BFD_RELOC_V850_TDA_6_8_OFFSET' value='839'/>
      <enumerator name='BFD_RELOC_V850_TDA_7_8_OFFSET' value='840'/>
      <enumerator name='BFD_RELOC_V850_TDA_7_7_OFFSET' value='841'/>
      <enumerator name='BFD_RELOC_V850_TDA_16_16_OFFSET' value='842'/>
      <enumerator name='BFD_RELOC_V850_TDA_4_5_OFFSET' value='843'/>
      <enumerator name='BFD_RELOC_V850_TDA_4_4_OFFSET' value='844'/>
      <enumerator name='BFD_RELOC_V850_SDA_16_16_SPLIT_OFFSET' value='845'/>
      <enumerator name='BFD_RELOC_V850_ZDA_16_16_SPLIT_OFFSET' value='846'/>
      <enumerator name='BFD_RELOC_V850_CALLT_6_7_OFFSET' value='847'/>
      <enumerator name='BFD_RELOC_V850_CALLT_16_16_OFFSET' value='848'/>
      <enumerator name='BFD_RELOC_V850_LONGCALL' value='849'/>
      <enumerator name='BFD_RELOC_V850_LONGJUMP' value='850'/>
      <enumerator name='BFD_RELOC_V850_ALIGN' value='851'/>
      <enumerator name='BFD_RELOC_V850_LO16_SPLIT_OFFSET' value='852'/>
      <enumerator name='BFD_RELOC_V850_16_PCREL' value='853'/>
      <enumerator name='BFD_RELOC_V850_17_PCREL' value='854'/>
      <enumerator name='BFD_RELOC_V850_23' value='855'/>
      <enumerator name='BFD_RELOC_V850_32_PCREL' value='856'/>
      <enumerator name='BFD_RELOC_V850_32_ABS' value='857'/>
      <enumerator name='BFD_RELOC_V850_16_SPLIT_OFFSET' value='858'/>
      <enumerator name='BFD_RELOC_V850_16_S1' value='859'/>
      <enumerator name='BFD_RELOC_V850_LO16_S1' value='860'/>
      <enumerator name='BFD_RELOC_V850_CALLT_15_16_OFFSET' value='861'/>
      <enumerator name='BFD_RELOC_V850_32_GOTPCREL' value='862'/>
      <enumerator name='BFD_RELOC_V850_16_GOT' value='863'/>
      <enumerator name='BFD_RELOC_V850_32_GOT' value='864'/>
      <enumerator name='BFD_RELOC_V850_22_PLT_PCREL' value='865'/>
      <enumerator name='BFD_RELOC_V850_32_PLT_PCREL' value='866'/>
      <enumerator name='BFD_RELOC_V850_COPY' value='867'/>
      <enumerator name='BFD_RELOC_V850_GLOB_DAT' value='868'/>
      <enumerator name='BFD_RELOC_V850_JMP_SLOT' value='869'/>
