<abi-corpus path='/opt/spack/opt/spack/linux-ubuntu18.04-x86_64/gcc-7.5.0/binutils-2.35-jxtfkaxpl4rimng7s6jd6qv57psfmjb7/lib/libctf.so' architecture='elf-amd-x86_64' soname='libctf.so.0'>
  <elf-needed>
    <dependency name='libz.so.1'/>
    <dependency name='libbfd-2.35.so'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='ctf_add_array' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_add_const' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_add_enum' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_add_enum_encoded' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_add_enumerator' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_add_float' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='ctf_setmodel' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_setspecific' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_simple_open' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_snapshot' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_type_align' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_type_aname' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_type_aname_raw' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_type_cmp' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_type_compat' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_type_encoding' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_type_ischild' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_type_isparent' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_type_iter' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_type_iter_all' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_type_kind' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_type_lname' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_type_name' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_type_pointer' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_type_reference' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_type_resolve' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_type_size' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_type_visit' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_update' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_variable_iter' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_version' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_write' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ctf_write_mem' version='LIBCTF_1.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='ctf-archive.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-binutils-2.35-jxtfkaxpl4rimng7s6jd6qv57psfmjb7/spack-src/libctf' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='192' id='type-id-2'>
      <subrange length='3' type-id='type-id-3' id='type-id-4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='8' id='type-id-6'>
      <subrange length='1' type-id='type-id-3' id='type-id-7'/>
    </array-type-def>
    <type-decl name='char' size-in-bits='8' id='type-id-8'/>
    <class-decl name='_bfd_window_internal' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-9'/>
    <class-decl name='aout_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-10'/>
    <class-decl name='artdata' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-11'/>
    <class-decl name='bfd_iovec' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-12'/>
    <class-decl name='bfd_link_hash_entry' size-in-bits='448' is-struct='yes' visibility='default' filepath='./../include/bfdlink.h' line='101' column='1' id='type-id-13'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='root' type-id='type-id-14' visibility='default' filepath='./../include/bfdlink.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='type' type-id='type-id-15' visibility='default' filepath='./../include/bfdlink.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23'>
        <var-decl name='non_ir_ref_regular' type-id='type-id-16' visibility='default' filepath='./../include/bfdlink.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22'>
        <var-decl name='non_ir_ref_dynamic' type-id='type-id-16' visibility='default' filepath='./../include/bfdlink.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21'>
        <var-decl name='linker_def' type-id='type-id-16' visibility='default' filepath='./../include/bfdlink.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='ldscript_def' type-id='type-id-16' visibility='default' filepath='./../include/bfdlink.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='rel_from_abs' type-id='type-id-16' visibility='default' filepath='./../include/bfdlink.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='u' type-id='type-id-17' visibility='default' filepath='./../include/bfdlink.h' line='194' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bfd_link_hash_table' size-in-bits='576' is-struct='yes' visibility='default' filepath='./../include/bfdlink.h' line='200' column='1' id='type-id-18'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='table' type-id='type-id-19' visibility='default' filepath='./../include/bfdlink.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='undefs' type-id='type-id-20' visibility='default' filepath='./../include/bfdlink.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='undefs_tail' type-id='type-id-20' visibility='default' filepath='./../include/bfdlink.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='hash_table_free' type-id='type-id-21' visibility='default' filepath='./../include/bfdlink.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='type' type-id='type-id-22' visibility='default' filepath='./../include/bfdlink.h' line='212' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bfd_link_info' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-23'/>
    <class-decl name='bfd_link_order' size-in-bits='384' is-struct='yes' visibility='default' filepath='./../include/bfdlink.h' line='823' column='1' id='type-id-24'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-25' visibility='default' filepath='./../include/bfdlink.h' line='826' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-26' visibility='default' filepath='./../include/bfdlink.h' line='828' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offset' type-id='type-id-27' visibility='default' filepath='./../include/bfdlink.h' line='830' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='size' type-id='type-id-28' visibility='default' filepath='./../include/bfdlink.h' line='832' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='u' type-id='type-id-29' visibility='default' filepath='./../include/bfdlink.h' line='863' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bfd_pef_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-30'/>
    <class-decl name='bfd_pef_xlib_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-31'/>
    <class-decl name='bfd_sym_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-32'/>
    <class-decl name='cisco_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-33'/>
    <class-decl name='coff_tdata' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-34'/>
    <class-decl name='ctf_dynhash' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-35'/>
    <class-decl name='ctf_fixed_hash' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-36'/>
    <class-decl name='ecoff_tdata' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-37'/>
    <class-decl name='elf_obj_tdata' size-in-bits='25856' is-struct='yes' visibility='default' filepath='./../bfd/elf-bfd.h' line='1911' column='1' id='type-id-38'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='elf_header' type-id='type-id-39' visibility='default' filepath='./../bfd/elf-bfd.h' line='1913' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='elf_sect_ptr' type-id='type-id-40' visibility='default' filepath='./../bfd/elf-bfd.h' line='1914' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='phdr' type-id='type-id-41' visibility='default' filepath='./../bfd/elf-bfd.h' line='1915' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='symtab_hdr' type-id='type-id-42' visibility='default' filepath='./../bfd/elf-bfd.h' line='1916' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='shstrtab_hdr' type-id='type-id-42' visibility='default' filepath='./../bfd/elf-bfd.h' line='1917' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='strtab_hdr' type-id='type-id-42' visibility='default' filepath='./../bfd/elf-bfd.h' line='1918' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='dynsymtab_hdr' type-id='type-id-42' visibility='default' filepath='./../bfd/elf-bfd.h' line='1919' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='dynstrtab_hdr' type-id='type-id-42' visibility='default' filepath='./../bfd/elf-bfd.h' line='1920' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='dynversym_hdr' type-id='type-id-42' visibility='default' filepath='./../bfd/elf-bfd.h' line='1921' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='dynverref_hdr' type-id='type-id-42' visibility='default' filepath='./../bfd/elf-bfd.h' line='1922' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='dynverdef_hdr' type-id='type-id-42' visibility='default' filepath='./../bfd/elf-bfd.h' line='1923' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='symtab_shndx_list' type-id='type-id-43' visibility='default' filepath='./../bfd/elf-bfd.h' line='1924' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6016'>
        <var-decl name='gp' type-id='type-id-27' visibility='default' filepath='./../bfd/elf-bfd.h' line='1925' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6080'>
        <var-decl name='gp_size' type-id='type-id-16' visibility='default' filepath='./../bfd/elf-bfd.h' line='1926' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6112'>
        <var-decl name='num_elf_sections' type-id='type-id-16' visibility='default' filepath='./../bfd/elf-bfd.h' line='1927' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='sym_hashes' type-id='type-id-44' visibility='default' filepath='./../bfd/elf-bfd.h' line='1932' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6208'>
        <var-decl name='local_got' type-id='type-id-45' visibility='default' filepath='./../bfd/elf-bfd.h' line='1942' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6272'>
        <var-decl name='dt_name' type-id='type-id-46' visibility='default' filepath='./../bfd/elf-bfd.h' line='1952' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='dt_audit' type-id='type-id-46' visibility='default' filepath='./../bfd/elf-bfd.h' line='1956' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6400'>
        <var-decl name='line_info' type-id='type-id-47' visibility='default' filepath='./../bfd/elf-bfd.h' line='1959' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6464'>
        <var-decl name='dwarf1_find_line_info' type-id='type-id-48' visibility='default' filepath='./../bfd/elf-bfd.h' line='1962' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6528'>
        <var-decl name='dwarf2_find_line_info' type-id='type-id-47' visibility='default' filepath='./../bfd/elf-bfd.h' line='1965' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='elf_find_function_cache' type-id='type-id-47' visibility='default' filepath='./../bfd/elf-bfd.h' line='1968' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='cverdefs' type-id='type-id-16' visibility='default' filepath='./../bfd/elf-bfd.h' line='1971' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6688'>
        <var-decl name='cverrefs' type-id='type-id-16' visibility='default' filepath='./../bfd/elf-bfd.h' line='1974' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6720'>
        <var-decl name='verdef' type-id='type-id-49' visibility='default' filepath='./../bfd/elf-bfd.h' line='1977' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6784'>
        <var-decl name='verref' type-id='type-id-50' visibility='default' filepath='./../bfd/elf-bfd.h' line='1980' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6848'>
        <var-decl name='eh_frame_section' type-id='type-id-51' visibility='default' filepath='./../bfd/elf-bfd.h' line='1983' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6912'>
        <var-decl name='symbuf' type-id='type-id-47' visibility='default' filepath='./../bfd/elf-bfd.h' line='1986' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6976'>
        <var-decl name='properties' type-id='type-id-52' visibility='default' filepath='./../bfd/elf-bfd.h' line='1990' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7040'>
        <var-decl name='known_obj_attributes' type-id='type-id-53' visibility='default' filepath='./../bfd/elf-bfd.h' line='1992' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25216'>
        <var-decl name='other_obj_attributes' type-id='type-id-54' visibility='default' filepath='./../bfd/elf-bfd.h' line='1993' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25344'>
        <var-decl name='sdt_note_head' type-id='type-id-55' visibility='default' filepath='./../bfd/elf-bfd.h' line='1998' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25408'>
        <var-decl name='group_sect_ptr' type-id='type-id-40' visibility='default' filepath='./../bfd/elf-bfd.h' line='2000' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25472'>
        <var-decl name='num_group' type-id='type-id-16' visibility='default' filepath='./../bfd/elf-bfd.h' line='2001' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25504'>
        <var-decl name='group_search_offset' type-id='type-id-16' visibility='default' filepath='./../bfd/elf-bfd.h' line='2005' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25536'>
        <var-decl name='symtab_section' type-id='type-id-16' visibility='default' filepath='./../bfd/elf-bfd.h' line='2007' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25568'>
        <var-decl name='dynsymtab_section' type-id='type-id-16' visibility='default' filepath='./../bfd/elf-bfd.h' line='2007' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25600'>
        <var-decl name='dynversym_section' type-id='type-id-16' visibility='default' filepath='./../bfd/elf-bfd.h' line='2008' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25632'>
        <var-decl name='dynverdef_section' type-id='type-id-16' visibility='default' filepath='./../bfd/elf-bfd.h' line='2008' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25664'>
        <var-decl name='dynverref_section' type-id='type-id-16' visibility='default' filepath='./../bfd/elf-bfd.h' line='2008' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='object_id' type-id='type-id-56' visibility='default' filepath='./../bfd/elf-bfd.h' line='2012' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22'>
        <var-decl name='dyn_lib_class' type-id='type-id-57' visibility='default' filepath='./../bfd/elf-bfd.h' line='2017' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='has_gnu_osabi' type-id='type-id-58' visibility='default' filepath='./../bfd/elf-bfd.h' line='2020' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18'>
        <var-decl name='has_no_copy_on_protected' type-id='type-id-16' visibility='default' filepath='./../bfd/elf-bfd.h' line='2024' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='bad_symtab' type-id='type-id-16' visibility='default' filepath='./../bfd/elf-bfd.h' line='2031' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25728'>
        <var-decl name='core' type-id='type-id-59' visibility='default' filepath='./../bfd/elf-bfd.h' line='2034' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25792'>
        <var-decl name='o' type-id='type-id-60' visibility='default' filepath='./../bfd/elf-bfd.h' line='2037' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='flag_info' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-61'/>
    <class-decl name='hppabsd_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-62'/>
    <class-decl name='hpux_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-63'/>
    <class-decl name='ihex_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-64'/>
    <class-decl name='lynx_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-65'/>
    <class-decl name='mach_o_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-66'/>
    <class-decl name='mach_o_fat_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-67'/>
    <class-decl name='mmo_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-68'/>
    <class-decl name='netbsd_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-69'/>
    <class-decl name='osf_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-70'/>
    <class-decl name='pe_tdata' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-71'/>
    <class-decl name='plugin_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-72'/>
    <class-decl name='sco5_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-73'/>
    <class-decl name='sgi_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-74'/>
    <class-decl name='som_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-75'/>
    <class-decl name='srec_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-76'/>
    <class-decl name='sun_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-77'/>
    <class-decl name='tekhex_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-78'/>
    <class-decl name='trad_core_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-79'/>
    <class-decl name='verilog_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-80'/>
    <class-decl name='versados_data_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-81'/>
    <class-decl name='xcoff_tdata' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-82'/>
    <array-type-def dimensions='1' type-id='type-id-83' size-in-bits='960' id='type-id-84'>
      <subrange length='5' type-id='type-id-3' id='type-id-85'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-86' size-in-bits='256' id='type-id-87'>
      <subrange length='2' type-id='type-id-3' id='type-id-88'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' id='type-id-89'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-90'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-91'/>
    <array-type-def dimensions='1' type-id='type-id-92' size-in-bits='256' id='type-id-93'>
      <subrange length='4' type-id='type-id-3' id='type-id-94'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-95' size-in-bits='256' id='type-id-96'>
      <subrange length='4' type-id='type-id-3' id='type-id-94'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-97'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-98'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-16'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-3'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-99'/>
    <type-decl name='void' id='type-id-100'/>
    <class-decl name='ctf_archive_internal' size-in-bits='960' is-struct='yes' visibility='default' filepath='./ctf-impl.h' line='312' column='1' id='type-id-101'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctfi_is_archive' type-id='type-id-89' visibility='default' filepath='./ctf-impl.h' line='314' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ctfi_file' type-id='type-id-102' visibility='default' filepath='./ctf-impl.h' line='315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ctfi_archive' type-id='type-id-103' visibility='default' filepath='./ctf-impl.h' line='316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ctfi_symsect' type-id='type-id-104' visibility='default' filepath='./ctf-impl.h' line='317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ctfi_strsect' type-id='type-id-104' visibility='default' filepath='./ctf-impl.h' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ctfi_free_symsect' type-id='type-id-89' visibility='default' filepath='./ctf-impl.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ctfi_data' type-id='type-id-47' visibility='default' filepath='./ctf-impl.h' line='320' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='ctfi_abfd' type-id='type-id-105' visibility='default' filepath='./ctf-impl.h' line='321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='ctfi_bfd_close' type-id='type-id-106' visibility='default' filepath='./ctf-impl.h' line='322' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ctf_file' size-in-bits='5824' is-struct='yes' visibility='default' filepath='./ctf-impl.h' line='243' column='1' id='type-id-107'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctf_fileops' type-id='type-id-108' visibility='default' filepath='./ctf-impl.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ctf_header' type-id='type-id-109' visibility='default' filepath='./ctf-impl.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ctf_openflags' type-id='type-id-98' visibility='default' filepath='./ctf-impl.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ctf_data' type-id='type-id-104' visibility='default' filepath='./ctf-impl.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ctf_symtab' type-id='type-id-104' visibility='default' filepath='./ctf-impl.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ctf_strtab' type-id='type-id-104' visibility='default' filepath='./ctf-impl.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='ctf_prov_strtab' type-id='type-id-110' visibility='default' filepath='./ctf-impl.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='ctf_syn_ext_strtab' type-id='type-id-110' visibility='default' filepath='./ctf-impl.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='ctf_data_mmapped' type-id='type-id-47' visibility='default' filepath='./ctf-impl.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='ctf_data_mmapped_len' type-id='type-id-111' visibility='default' filepath='./ctf-impl.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='ctf_structs' type-id='type-id-112' visibility='default' filepath='./ctf-impl.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='ctf_unions' type-id='type-id-112' visibility='default' filepath='./ctf-impl.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='ctf_enums' type-id='type-id-112' visibility='default' filepath='./ctf-impl.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='ctf_names' type-id='type-id-112' visibility='default' filepath='./ctf-impl.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='ctf_lookups' type-id='type-id-84' visibility='default' filepath='./ctf-impl.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='ctf_str' type-id='type-id-87' visibility='default' filepath='./ctf-impl.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='ctf_str_atoms' type-id='type-id-110' visibility='default' filepath='./ctf-impl.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='ctf_str_num_refs' type-id='type-id-113' visibility='default' filepath='./ctf-impl.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='ctf_str_prov_offset' type-id='type-id-114' visibility='default' filepath='./ctf-impl.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='ctf_base' type-id='type-id-115' visibility='default' filepath='./ctf-impl.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='ctf_dynbase' type-id='type-id-115' visibility='default' filepath='./ctf-impl.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='ctf_buf' type-id='type-id-115' visibility='default' filepath='./ctf-impl.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='ctf_size' type-id='type-id-111' visibility='default' filepath='./ctf-impl.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='ctf_sxlate' type-id='type-id-116' visibility='default' filepath='./ctf-impl.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='ctf_nsyms' type-id='type-id-3' visibility='default' filepath='./ctf-impl.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='ctf_txlate' type-id='type-id-116' visibility='default' filepath='./ctf-impl.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='ctf_ptrtab' type-id='type-id-116' visibility='default' filepath='./ctf-impl.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='ctf_ptrtab_len' type-id='type-id-111' visibility='default' filepath='./ctf-impl.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='ctf_vars' type-id='type-id-117' visibility='default' filepath='./ctf-impl.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='ctf_nvars' type-id='type-id-3' visibility='default' filepath='./ctf-impl.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='ctf_typemax' type-id='type-id-3' visibility='default' filepath='./ctf-impl.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='ctf_dmodel' type-id='type-id-118' visibility='default' filepath='./ctf-impl.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='ctf_cuname' type-id='type-id-46' visibility='default' filepath='./ctf-impl.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='ctf_dyncuname' type-id='type-id-119' visibility='default' filepath='./ctf-impl.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='ctf_parent' type-id='type-id-120' visibility='default' filepath='./ctf-impl.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='ctf_parlabel' type-id='type-id-46' visibility='default' filepath='./ctf-impl.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='ctf_parname' type-id='type-id-46' visibility='default' filepath='./ctf-impl.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='ctf_dynparname' type-id='type-id-119' visibility='default' filepath='./ctf-impl.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='ctf_parmax' type-id='type-id-114' visibility='default' filepath='./ctf-impl.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4384'>
        <var-decl name='ctf_refcnt' type-id='type-id-114' visibility='default' filepath='./ctf-impl.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='ctf_flags' type-id='type-id-114' visibility='default' filepath='./ctf-impl.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4448'>
        <var-decl name='ctf_errno' type-id='type-id-89' visibility='default' filepath='./ctf-impl.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='ctf_version' type-id='type-id-89' visibility='default' filepath='./ctf-impl.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='ctf_dthash' type-id='type-id-110' visibility='default' filepath='./ctf-impl.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='ctf_dtdefs' type-id='type-id-121' visibility='default' filepath='./ctf-impl.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='ctf_dvhash' type-id='type-id-110' visibility='default' filepath='./ctf-impl.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='ctf_dvdefs' type-id='type-id-121' visibility='default' filepath='./ctf-impl.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='ctf_dtoldid' type-id='type-id-3' visibility='default' filepath='./ctf-impl.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='ctf_snapshots' type-id='type-id-3' visibility='default' filepath='./ctf-impl.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='ctf_snapshot_lu' type-id='type-id-3' visibility='default' filepath='./ctf-impl.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='ctf_archive' type-id='type-id-122' visibility='default' filepath='./ctf-impl.h' line='296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='ctf_link_inputs' type-id='type-id-110' visibility='default' filepath='./ctf-impl.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='ctf_link_outputs' type-id='type-id-110' visibility='default' filepath='./ctf-impl.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='ctf_link_type_mapping' type-id='type-id-110' visibility='default' filepath='./ctf-impl.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5376'>
        <var-decl name='ctf_link_cu_mapping' type-id='type-id-110' visibility='default' filepath='./ctf-impl.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='ctf_link_memb_name_changer' type-id='type-id-123' visibility='default' filepath='./ctf-impl.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='ctf_link_memb_name_changer_arg' type-id='type-id-47' visibility='default' filepath='./ctf-impl.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='ctf_add_processing' type-id='type-id-110' visibility='default' filepath='./ctf-impl.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5632'>
        <var-decl name='ctf_tmp_typeslice' type-id='type-id-119' visibility='default' filepath='./ctf-impl.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='ctf_tmp_typeslicelen' type-id='type-id-111' visibility='default' filepath='./ctf-impl.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5760'>
        <var-decl name='ctf_specific' type-id='type-id-47' visibility='default' filepath='./ctf-impl.h' line='307' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ctf_fileops_t' type-id='type-id-124' filepath='./ctf-impl.h' line='120' column='1' id='type-id-125'/>
    <class-decl name='ctf_fileops' size-in-bits='320' is-struct='yes' visibility='default' filepath='./ctf-impl.h' line='112' column='1' id='type-id-124'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctfo_get_kind' type-id='type-id-126' visibility='default' filepath='./ctf-impl.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ctfo_get_root' type-id='type-id-126' visibility='default' filepath='./ctf-impl.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ctfo_get_vlen' type-id='type-id-126' visibility='default' filepath='./ctf-impl.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ctfo_get_ctt_size' type-id='type-id-127' visibility='default' filepath='./ctf-impl.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ctfo_get_vbytes' type-id='type-id-128' visibility='default' filepath='./ctf-impl.h' line='119' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint32_t' type-id='type-id-129' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-114'/>
    <typedef-decl name='__uint32_t' type-id='type-id-16' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='41' column='1' id='type-id-129'/>
    <typedef-decl name='ssize_t' type-id='type-id-130' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='109' column='1' id='type-id-131'/>
    <typedef-decl name='__ssize_t' type-id='type-id-90' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='181' column='1' id='type-id-130'/>
    <typedef-decl name='ctf_file_t' type-id='type-id-107' filepath='./../include/ctf-api.h' line='43' column='1' id='type-id-132'/>
    <typedef-decl name='ctf_type_t' type-id='type-id-133' filepath='./../include/ctf.h' line='309' column='1' id='type-id-134'/>
    <class-decl name='ctf_type' size-in-bits='160' is-struct='yes' visibility='default' filepath='./../include/ctf.h' line='289' column='1' id='type-id-133'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctt_name' type-id='type-id-114' visibility='default' filepath='./../include/ctf.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ctt_info' type-id='type-id-114' visibility='default' filepath='./../include/ctf.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ctt_lsizehi' type-id='type-id-114' visibility='default' filepath='./../include/ctf.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ctt_lsizelo' type-id='type-id-114' visibility='default' filepath='./../include/ctf.h' line='308' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='./../include/ctf.h' line='301' column='1' id='type-id-135'>
      <data-member access='private'>
        <var-decl name='ctt_size' type-id='type-id-114' visibility='default' filepath='./../include/ctf.h' line='303' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ctt_type' type-id='type-id-114' visibility='default' filepath='./../include/ctf.h' line='304' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='size_t' type-id='type-id-3' filepath='/usr/lib/gcc/x86_64-linux-gnu/7/include/stddef.h' line='216' column='1' id='type-id-111'/>
    <class-decl name='ctf_header' size-in-bits='416' is-struct='yes' visibility='default' filepath='./../include/ctf.h' line='161' column='1' id='type-id-136'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cth_preamble' type-id='type-id-137' visibility='default' filepath='./../include/ctf.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='cth_parlabel' type-id='type-id-114' visibility='default' filepath='./../include/ctf.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cth_parname' type-id='type-id-114' visibility='default' filepath='./../include/ctf.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cth_cuname' type-id='type-id-114' visibility='default' filepath='./../include/ctf.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cth_lbloff' type-id='type-id-114' visibility='default' filepath='./../include/ctf.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='cth_objtoff' type-id='type-id-114' visibility='default' filepath='./../include/ctf.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cth_funcoff' type-id='type-id-114' visibility='default' filepath='./../include/ctf.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='cth_objtidxoff' type-id='type-id-114' visibility='default' filepath='./../include/ctf.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cth_funcidxoff' type-id='type-id-114' visibility='default' filepath='./../include/ctf.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='cth_varoff' type-id='type-id-114' visibility='default' filepath='./../include/ctf.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='cth_typeoff' type-id='type-id-114' visibility='default' filepath='./../include/ctf.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='cth_stroff' type-id='type-id-114' visibility='default' filepath='./../include/ctf.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='cth_strlen' type-id='type-id-114' visibility='default' filepath='./../include/ctf.h' line='175' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ctf_preamble_t' type-id='type-id-138' filepath='./../include/ctf.h' line='145' column='1' id='type-id-137'/>
    <class-decl name='ctf_preamble' size-in-bits='32' is-struct='yes' visibility='default' filepath='./../include/ctf.h' line='140' column='1' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctp_magic' type-id='type-id-99' visibility='default' filepath='./../include/ctf.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ctp_version' type-id='type-id-98' visibility='default' filepath='./../include/ctf.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='ctp_flags' type-id='type-id-98' visibility='default' filepath='./../include/ctf.h' line='144' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ctf_sect_t' type-id='type-id-139' filepath='./../include/ctf-api.h' line='65' column='1' id='type-id-104'/>
    <class-decl name='ctf_sect' size-in-bits='256' is-struct='yes' visibility='default' filepath='./../include/ctf-api.h' line='59' column='1' id='type-id-139'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cts_name' type-id='type-id-46' visibility='default' filepath='./../include/ctf-api.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cts_data' type-id='type-id-47' visibility='default' filepath='./../include/ctf-api.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cts_size' type-id='type-id-111' visibility='default' filepath='./../include/ctf-api.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cts_entsize' type-id='type-id-111' visibility='default' filepath='./../include/ctf-api.h' line='64' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ctf_dynhash_t' type-id='type-id-35' filepath='./ctf-impl.h' line='74' column='1' id='type-id-140'/>
    <typedef-decl name='ctf_names_t' type-id='type-id-141' filepath='./ctf-impl.h' line='103' column='1' id='type-id-112'/>
    <class-decl name='ctf_names' size-in-bits='128' is-struct='yes' visibility='default' filepath='./ctf-impl.h' line='99' column='1' id='type-id-141'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctn_readonly' type-id='type-id-142' visibility='default' filepath='./ctf-impl.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ctn_writable' type-id='type-id-110' visibility='default' filepath='./ctf-impl.h' line='102' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ctf_hash_t' type-id='type-id-36' filepath='./ctf-impl.h' line='73' column='1' id='type-id-143'/>
    <typedef-decl name='ctf_lookup_t' type-id='type-id-144' filepath='./ctf-impl.h' line='110' column='1' id='type-id-83'/>
    <class-decl name='ctf_lookup' size-in-bits='192' is-struct='yes' visibility='default' filepath='./ctf-impl.h' line='105' column='1' id='type-id-144'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctl_prefix' type-id='type-id-46' visibility='default' filepath='./ctf-impl.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ctl_len' type-id='type-id-111' visibility='default' filepath='./ctf-impl.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ctl_hash' type-id='type-id-145' visibility='default' filepath='./ctf-impl.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ctf_strs_t' type-id='type-id-146' filepath='./ctf-impl.h' line='80' column='1' id='type-id-86'/>
    <class-decl name='ctf_strs' size-in-bits='128' is-struct='yes' visibility='default' filepath='./ctf-impl.h' line='76' column='1' id='type-id-146'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cts_strs' type-id='type-id-46' visibility='default' filepath='./ctf-impl.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cts_len' type-id='type-id-111' visibility='default' filepath='./ctf-impl.h' line='79' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint64_t' type-id='type-id-147' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='27' column='1' id='type-id-113'/>
    <typedef-decl name='__uint64_t' type-id='type-id-3' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='44' column='1' id='type-id-147'/>
    <class-decl name='ctf_varent' size-in-bits='64' is-struct='yes' visibility='default' filepath='./../include/ctf.h' line='210' column='1' id='type-id-148'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctv_name' type-id='type-id-114' visibility='default' filepath='./../include/ctf.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ctv_type' type-id='type-id-114' visibility='default' filepath='./../include/ctf.h' line='213' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ctf_dmodel_t' type-id='type-id-149' filepath='./ctf-impl.h' line='97' column='1' id='type-id-150'/>
    <class-decl name='ctf_dmodel' size-in-bits='448' is-struct='yes' visibility='default' filepath='./ctf-impl.h' line='88' column='1' id='type-id-149'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctd_name' type-id='type-id-46' visibility='default' filepath='./ctf-impl.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ctd_code' type-id='type-id-89' visibility='default' filepath='./ctf-impl.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ctd_pointer' type-id='type-id-111' visibility='default' filepath='./ctf-impl.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ctd_char' type-id='type-id-111' visibility='default' filepath='./ctf-impl.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ctd_short' type-id='type-id-111' visibility='default' filepath='./ctf-impl.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ctd_int' type-id='type-id-111' visibility='default' filepath='./ctf-impl.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ctd_long' type-id='type-id-111' visibility='default' filepath='./ctf-impl.h' line='96' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ctf_list_t' type-id='type-id-151' filepath='./ctf-impl.h' line='126' column='1' id='type-id-121'/>
    <class-decl name='ctf_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='./ctf-impl.h' line='122' column='1' id='type-id-151'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='l_prev' type-id='type-id-152' visibility='default' filepath='./ctf-impl.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='l_next' type-id='type-id-152' visibility='default' filepath='./ctf-impl.h' line='125' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ctf_archive_t' type-id='type-id-101' filepath='./../include/ctf-api.h' line='44' column='1' id='type-id-153'/>
    <typedef-decl name='ctf_link_memb_name_changer_f' type-id='type-id-154' filepath='./../include/ctf-api.h' line='435' column='1' id='type-id-155'/>
    <class-decl name='ctf_archive' size-in-bits='320' is-struct='yes' visibility='default' filepath='./../include/ctf.h' line='571' column='1' id='type-id-156'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctfa_magic' type-id='type-id-113' visibility='default' filepath='./../include/ctf.h' line='575' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ctfa_model' type-id='type-id-113' visibility='default' filepath='./../include/ctf.h' line='578' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ctfa_nfiles' type-id='type-id-113' visibility='default' filepath='./../include/ctf.h' line='581' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ctfa_names' type-id='type-id-113' visibility='default' filepath='./../include/ctf.h' line='584' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ctfa_ctfs' type-id='type-id-113' visibility='default' filepath='./../include/ctf.h' line='588' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bfd' size-in-bits='2304' is-struct='yes' visibility='default' filepath='./../bfd/bfd.h' line='6493' column='1' id='type-id-157'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='filename' type-id='type-id-46' visibility='default' filepath='./../bfd/bfd.h' line='6496' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='xvec' type-id='type-id-158' visibility='default' filepath='./../bfd/bfd.h' line='6499' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='iostream' type-id='type-id-47' visibility='default' filepath='./../bfd/bfd.h' line='6503' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='iovec' type-id='type-id-159' visibility='default' filepath='./../bfd/bfd.h' line='6504' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lru_prev' type-id='type-id-105' visibility='default' filepath='./../bfd/bfd.h' line='6508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='lru_next' type-id='type-id-105' visibility='default' filepath='./../bfd/bfd.h' line='6508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='where' type-id='type-id-160' visibility='default' filepath='./../bfd/bfd.h' line='6513' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mtime' type-id='type-id-90' visibility='default' filepath='./../bfd/bfd.h' line='6516' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='id' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='6519' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='flags' type-id='type-id-161' visibility='default' filepath='./../bfd/bfd.h' line='6522' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='format' type-id='type-id-162' visibility='default' filepath='./../bfd/bfd.h' line='6625' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='direction' type-id='type-id-163' visibility='default' filepath='./../bfd/bfd.h' line='6628' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='cacheable' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='6632' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='target_defaulted' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='6637' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='opened_once' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='6640' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23'>
        <var-decl name='mtime_set' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='6644' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22'>
        <var-decl name='no_export' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='6647' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21'>
        <var-decl name='output_has_begun' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='6651' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='has_armap' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='6654' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='is_thin_archive' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='6657' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18'>
        <var-decl name='no_element_cache' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='6660' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='selective_search' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='6664' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='is_linker_output' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='6667' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='is_linker_input' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='6670' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13'>
        <var-decl name='plugin_format' type-id='type-id-164' visibility='default' filepath='./../bfd/bfd.h' line='6673' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='lto_output' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='6676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='lto_slim_object' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='6679' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='plugin_dummy_bfd' type-id='type-id-105' visibility='default' filepath='./../bfd/bfd.h' line='6683' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='origin' type-id='type-id-160' visibility='default' filepath='./../bfd/bfd.h' line='6687' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='proxy_origin' type-id='type-id-160' visibility='default' filepath='./../bfd/bfd.h' line='6694' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='section_htab' type-id='type-id-19' visibility='default' filepath='./../bfd/bfd.h' line='6697' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='sections' type-id='type-id-165' visibility='default' filepath='./../bfd/bfd.h' line='6700' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='section_last' type-id='type-id-165' visibility='default' filepath='./../bfd/bfd.h' line='6703' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='section_count' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='6706' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='archive_pass' type-id='type-id-89' visibility='default' filepath='./../bfd/bfd.h' line='6710' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='start_address' type-id='type-id-27' visibility='default' filepath='./../bfd/bfd.h' line='6714' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='outsymbols' type-id='type-id-166' visibility='default' filepath='./../bfd/bfd.h' line='6718' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='symcount' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='6721' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='dynsymcount' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='6724' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='arch_info' type-id='type-id-167' visibility='default' filepath='./../bfd/bfd.h' line='6727' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='size' type-id='type-id-160' visibility='default' filepath='./../bfd/bfd.h' line='6732' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='arelt_data' type-id='type-id-47' visibility='default' filepath='./../bfd/bfd.h' line='6735' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='my_archive' type-id='type-id-105' visibility='default' filepath='./../bfd/bfd.h' line='6736' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='archive_next' type-id='type-id-105' visibility='default' filepath='./../bfd/bfd.h' line='6737' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='archive_head' type-id='type-id-105' visibility='default' filepath='./../bfd/bfd.h' line='6738' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='nested_archives' type-id='type-id-105' visibility='default' filepath='./../bfd/bfd.h' line='6739' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='link' type-id='type-id-168' visibility='default' filepath='./../bfd/bfd.h' line='6747' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='tdata' type-id='type-id-169' visibility='default' filepath='./../bfd/bfd.h' line='6784' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='usrdata' type-id='type-id-47' visibility='default' filepath='./../bfd/bfd.h' line='6787' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='memory' type-id='type-id-47' visibility='default' filepath='./../bfd/bfd.h' line='6792' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='build_id' type-id='type-id-170' visibility='default' filepath='./../bfd/bfd.h' line='6795' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bfd_target' size-in-bits='7104' is-struct='yes' visibility='default' filepath='./../bfd/bfd.h' line='7320' column='1' id='type-id-171'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-46' visibility='default' filepath='./../bfd/bfd.h' line='7323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flavour' type-id='type-id-172' visibility='default' filepath='./../bfd/bfd.h' line='7327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='byteorder' type-id='type-id-173' visibility='default' filepath='./../bfd/bfd.h' line='7330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='header_byteorder' type-id='type-id-173' visibility='default' filepath='./../bfd/bfd.h' line='7333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='object_flags' type-id='type-id-161' visibility='default' filepath='./../bfd/bfd.h' line='7337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='section_flags' type-id='type-id-161' visibility='default' filepath='./../bfd/bfd.h' line='7341' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='symbol_leading_char' type-id='type-id-8' visibility='default' filepath='./../bfd/bfd.h' line='7345' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='ar_pad_char' type-id='type-id-8' visibility='default' filepath='./../bfd/bfd.h' line='7348' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='ar_max_namelen' type-id='type-id-98' visibility='default' filepath='./../bfd/bfd.h' line='7351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='match_priority' type-id='type-id-98' visibility='default' filepath='./../bfd/bfd.h' line='7355' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bfd_getx64' type-id='type-id-174' visibility='default' filepath='./../bfd/bfd.h' line='7360' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='bfd_getx_signed_64' type-id='type-id-175' visibility='default' filepath='./../bfd/bfd.h' line='7361' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='bfd_putx64' type-id='type-id-176' visibility='default' filepath='./../bfd/bfd.h' line='7362' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='bfd_getx32' type-id='type-id-177' visibility='default' filepath='./../bfd/bfd.h' line='7363' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='bfd_getx_signed_32' type-id='type-id-178' visibility='default' filepath='./../bfd/bfd.h' line='7364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='bfd_putx32' type-id='type-id-179' visibility='default' filepath='./../bfd/bfd.h' line='7365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='bfd_getx16' type-id='type-id-177' visibility='default' filepath='./../bfd/bfd.h' line='7366' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='bfd_getx_signed_16' type-id='type-id-178' visibility='default' filepath='./../bfd/bfd.h' line='7367' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bfd_putx16' type-id='type-id-179' visibility='default' filepath='./../bfd/bfd.h' line='7368' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='bfd_h_getx64' type-id='type-id-174' visibility='default' filepath='./../bfd/bfd.h' line='7371' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='bfd_h_getx_signed_64' type-id='type-id-175' visibility='default' filepath='./../bfd/bfd.h' line='7372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='bfd_h_putx64' type-id='type-id-176' visibility='default' filepath='./../bfd/bfd.h' line='7373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='bfd_h_getx32' type-id='type-id-177' visibility='default' filepath='./../bfd/bfd.h' line='7374' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='bfd_h_getx_signed_32' type-id='type-id-178' visibility='default' filepath='./../bfd/bfd.h' line='7375' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='bfd_h_putx32' type-id='type-id-179' visibility='default' filepath='./../bfd/bfd.h' line='7376' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='bfd_h_getx16' type-id='type-id-177' visibility='default' filepath='./../bfd/bfd.h' line='7377' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='bfd_h_getx_signed_16' type-id='type-id-178' visibility='default' filepath='./../bfd/bfd.h' line='7378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='bfd_h_putx16' type-id='type-id-179' visibility='default' filepath='./../bfd/bfd.h' line='7379' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_bfd_check_format' type-id='type-id-96' visibility='default' filepath='./../bfd/bfd.h' line='7386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='_bfd_set_format' type-id='type-id-93' visibility='default' filepath='./../bfd/bfd.h' line='7389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='_bfd_write_contents' type-id='type-id-93' visibility='default' filepath='./../bfd/bfd.h' line='7392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='_close_and_cleanup' type-id='type-id-92' visibility='default' filepath='./../bfd/bfd.h' line='7404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='_bfd_free_cached_info' type-id='type-id-92' visibility='default' filepath='./../bfd/bfd.h' line='7406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='_new_section_hook' type-id='type-id-180' visibility='default' filepath='./../bfd/bfd.h' line='7408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='_bfd_get_section_contents' type-id='type-id-181' visibility='default' filepath='./../bfd/bfd.h' line='7410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='_bfd_get_section_contents_in_window' type-id='type-id-182' visibility='default' filepath='./../bfd/bfd.h' line='7412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='_bfd_copy_private_bfd_data' type-id='type-id-183' visibility='default' filepath='./../bfd/bfd.h' line='7429' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='_bfd_merge_private_bfd_data' type-id='type-id-184' visibility='default' filepath='./../bfd/bfd.h' line='7432' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='_bfd_init_private_section_data' type-id='type-id-185' visibility='default' filepath='./../bfd/bfd.h' line='7438' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='_bfd_copy_private_section_data' type-id='type-id-186' visibility='default' filepath='./../bfd/bfd.h' line='7443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='_bfd_copy_private_symbol_data' type-id='type-id-187' visibility='default' filepath='./../bfd/bfd.h' line='7447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='_bfd_copy_private_header_data' type-id='type-id-183' visibility='default' filepath='./../bfd/bfd.h' line='7451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='_bfd_set_private_flags' type-id='type-id-188' visibility='default' filepath='./../bfd/bfd.h' line='7453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='_bfd_print_private_bfd_data' type-id='type-id-189' visibility='default' filepath='./../bfd/bfd.h' line='7456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='_core_file_failing_command' type-id='type-id-190' visibility='default' filepath='./../bfd/bfd.h' line='7465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='_core_file_failing_signal' type-id='type-id-191' visibility='default' filepath='./../bfd/bfd.h' line='7466' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='_core_file_matches_executable_p' type-id='type-id-183' visibility='default' filepath='./../bfd/bfd.h' line='7467' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='_core_file_pid' type-id='type-id-191' visibility='default' filepath='./../bfd/bfd.h' line='7468' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='_bfd_slurp_armap' type-id='type-id-92' visibility='default' filepath='./../bfd/bfd.h' line='7484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='_bfd_slurp_extended_name_table' type-id='type-id-92' visibility='default' filepath='./../bfd/bfd.h' line='7485' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='_bfd_construct_extended_name_table' type-id='type-id-192' visibility='default' filepath='./../bfd/bfd.h' line='7486' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='_bfd_truncate_arname' type-id='type-id-193' visibility='default' filepath='./../bfd/bfd.h' line='7489' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='write_armap' type-id='type-id-194' visibility='default' filepath='./../bfd/bfd.h' line='7490' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='_bfd_read_ar_hdr_fn' type-id='type-id-195' visibility='default' filepath='./../bfd/bfd.h' line='7492' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='_bfd_write_ar_hdr_fn' type-id='type-id-183' visibility='default' filepath='./../bfd/bfd.h' line='7493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='openr_next_archived_file' type-id='type-id-196' visibility='default' filepath='./../bfd/bfd.h' line='7494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='_bfd_get_elt_at_index' type-id='type-id-197' visibility='default' filepath='./../bfd/bfd.h' line='7497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='_bfd_stat_arch_elt' type-id='type-id-198' visibility='default' filepath='./../bfd/bfd.h' line='7498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='_bfd_update_armap_timestamp' type-id='type-id-92' visibility='default' filepath='./../bfd/bfd.h' line='7499' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='_bfd_get_symtab_upper_bound' type-id='type-id-199' visibility='default' filepath='./../bfd/bfd.h' line='7519' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='_bfd_canonicalize_symtab' type-id='type-id-200' visibility='default' filepath='./../bfd/bfd.h' line='7520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='_bfd_make_empty_symbol' type-id='type-id-201' visibility='default' filepath='./../bfd/bfd.h' line='7522' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='_bfd_print_symbol' type-id='type-id-202' visibility='default' filepath='./../bfd/bfd.h' line='7523' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='_bfd_get_symbol_info' type-id='type-id-203' visibility='default' filepath='./../bfd/bfd.h' line='7527' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='_bfd_get_symbol_version_string' type-id='type-id-204' visibility='default' filepath='./../bfd/bfd.h' line='7531' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='_bfd_is_local_label_name' type-id='type-id-205' visibility='default' filepath='./../bfd/bfd.h' line='7536' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='_bfd_is_target_special_symbol' type-id='type-id-206' visibility='default' filepath='./../bfd/bfd.h' line='7537' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='_get_lineno' type-id='type-id-207' visibility='default' filepath='./../bfd/bfd.h' line='7538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='_bfd_find_nearest_line' type-id='type-id-208' visibility='default' filepath='./../bfd/bfd.h' line='7539' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='_bfd_find_line' type-id='type-id-209' visibility='default' filepath='./../bfd/bfd.h' line='7543' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='_bfd_find_inliner_info' type-id='type-id-210' visibility='default' filepath='./../bfd/bfd.h' line='7546' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='_bfd_make_debug_symbol' type-id='type-id-211' visibility='default' filepath='./../bfd/bfd.h' line='7551' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='_read_minisymbols' type-id='type-id-212' visibility='default' filepath='./../bfd/bfd.h' line='7554' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='_minisymbol_to_symbol' type-id='type-id-213' visibility='default' filepath='./../bfd/bfd.h' line='7558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='_get_reloc_upper_bound' type-id='type-id-214' visibility='default' filepath='./../bfd/bfd.h' line='7569' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='_bfd_canonicalize_reloc' type-id='type-id-215' visibility='default' filepath='./../bfd/bfd.h' line='7570' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='_bfd_set_reloc' type-id='type-id-216' visibility='default' filepath='./../bfd/bfd.h' line='7572' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='reloc_type_lookup' type-id='type-id-217' visibility='default' filepath='./../bfd/bfd.h' line='7575' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='reloc_name_lookup' type-id='type-id-218' visibility='default' filepath='./../bfd/bfd.h' line='7577' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='_bfd_set_arch_mach' type-id='type-id-219' visibility='default' filepath='./../bfd/bfd.h' line='7584' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='_bfd_set_section_contents' type-id='type-id-181' visibility='default' filepath='./../bfd/bfd.h' line='7586' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5376'>
        <var-decl name='_bfd_sizeof_headers' type-id='type-id-220' visibility='default' filepath='./../bfd/bfd.h' line='7612' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='_bfd_get_relocated_section_contents' type-id='type-id-221' visibility='default' filepath='./../bfd/bfd.h' line='7613' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='_bfd_relax_section' type-id='type-id-222' visibility='default' filepath='./../bfd/bfd.h' line='7619' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='_bfd_link_hash_table_create' type-id='type-id-223' visibility='default' filepath='./../bfd/bfd.h' line='7625' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5632'>
        <var-decl name='_bfd_link_add_symbols' type-id='type-id-184' visibility='default' filepath='./../bfd/bfd.h' line='7628' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='_bfd_link_just_syms' type-id='type-id-224' visibility='default' filepath='./../bfd/bfd.h' line='7631' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5760'>
        <var-decl name='_bfd_copy_link_hash_symbol_type' type-id='type-id-225' visibility='default' filepath='./../bfd/bfd.h' line='7637' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='_bfd_final_link' type-id='type-id-184' visibility='default' filepath='./../bfd/bfd.h' line='7643' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5888'>
        <var-decl name='_bfd_link_split_section' type-id='type-id-226' visibility='default' filepath='./../bfd/bfd.h' line='7646' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='_bfd_link_check_relocs' type-id='type-id-184' visibility='default' filepath='./../bfd/bfd.h' line='7649' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6016'>
        <var-decl name='_bfd_gc_sections' type-id='type-id-184' visibility='default' filepath='./../bfd/bfd.h' line='7652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6080'>
        <var-decl name='_bfd_lookup_section_flags' type-id='type-id-227' visibility='default' filepath='./../bfd/bfd.h' line='7655' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='_bfd_merge_sections' type-id='type-id-184' visibility='default' filepath='./../bfd/bfd.h' line='7659' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6208'>
        <var-decl name='_bfd_is_group_section' type-id='type-id-228' visibility='default' filepath='./../bfd/bfd.h' line='7662' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6272'>
        <var-decl name='_bfd_group_name' type-id='type-id-229' visibility='default' filepath='./../bfd/bfd.h' line='7665' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='_bfd_discard_group' type-id='type-id-226' visibility='default' filepath='./../bfd/bfd.h' line='7668' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6400'>
        <var-decl name='_section_already_linked' type-id='type-id-230' visibility='default' filepath='./../bfd/bfd.h' line='7672' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6464'>
        <var-decl name='_bfd_define_common_symbol' type-id='type-id-231' visibility='default' filepath='./../bfd/bfd.h' line='7676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6528'>
        <var-decl name='_bfd_link_hide_symbol' type-id='type-id-232' visibility='default' filepath='./../bfd/bfd.h' line='7680' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='_bfd_define_start_stop' type-id='type-id-233' visibility='default' filepath='./../bfd/bfd.h' line='7685' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='_bfd_get_dynamic_symtab_upper_bound' type-id='type-id-199' visibility='default' filepath='./../bfd/bfd.h' line='7697' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6720'>
        <var-decl name='_bfd_canonicalize_dynamic_symtab' type-id='type-id-200' visibility='default' filepath='./../bfd/bfd.h' line='7699' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6784'>
        <var-decl name='_bfd_get_synthetic_symtab' type-id='type-id-234' visibility='default' filepath='./../bfd/bfd.h' line='7701' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6848'>
        <var-decl name='_bfd_get_dynamic_reloc_upper_bound' type-id='type-id-199' visibility='default' filepath='./../bfd/bfd.h' line='7705' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6912'>
        <var-decl name='_bfd_canonicalize_dynamic_reloc' type-id='type-id-235' visibility='default' filepath='./../bfd/bfd.h' line='7707' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6976'>
        <var-decl name='alternative_target' type-id='type-id-158' visibility='default' filepath='./../bfd/bfd.h' line='7711' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7040'>
        <var-decl name='backend_data' type-id='type-id-47' visibility='default' filepath='./../bfd/bfd.h' line='7715' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='bfd_flavour' filepath='./../bfd/bfd.h' line='7284' column='1' id='type-id-172'>
      <underlying-type type-id='type-id-97'/>
      <enumerator name='bfd_target_unknown_flavour' value='0'/>
      <enumerator name='bfd_target_aout_flavour' value='1'/>
      <enumerator name='bfd_target_coff_flavour' value='2'/>
      <enumerator name='bfd_target_ecoff_flavour' value='3'/>
      <enumerator name='bfd_target_xcoff_flavour' value='4'/>
      <enumerator name='bfd_target_elf_flavour' value='5'/>
      <enumerator name='bfd_target_tekhex_flavour' value='6'/>
      <enumerator name='bfd_target_srec_flavour' value='7'/>
      <enumerator name='bfd_target_verilog_flavour' value='8'/>
      <enumerator name='bfd_target_ihex_flavour' value='9'/>
      <enumerator name='bfd_target_som_flavour' value='10'/>
      <enumerator name='bfd_target_os9k_flavour' value='11'/>
      <enumerator name='bfd_target_versados_flavour' value='12'/>
      <enumerator name='bfd_target_msdos_flavour' value='13'/>
      <enumerator name='bfd_target_ovax_flavour' value='14'/>
      <enumerator name='bfd_target_evax_flavour' value='15'/>
      <enumerator name='bfd_target_mmo_flavour' value='16'/>
      <enumerator name='bfd_target_mach_o_flavour' value='17'/>
      <enumerator name='bfd_target_pef_flavour' value='18'/>
      <enumerator name='bfd_target_pef_xlib_flavour' value='19'/>
      <enumerator name='bfd_target_sym_flavour' value='20'/>
    </enum-decl>
    <enum-decl name='bfd_endian' filepath='./../bfd/bfd.h' line='7310' column='1' id='type-id-173'>
      <underlying-type type-id='type-id-97'/>
      <enumerator name='BFD_ENDIAN_BIG' value='0'/>
      <enumerator name='BFD_ENDIAN_LITTLE' value='1'/>
      <enumerator name='BFD_ENDIAN_UNKNOWN' value='2'/>
    </enum-decl>
    <typedef-decl name='flagword' type-id='type-id-16' filepath='./../bfd/bfd.h' line='225' column='1' id='type-id-161'/>
    <typedef-decl name='bfd_uint64_t' type-id='type-id-3' filepath='./../bfd/bfd.h' line='100' column='1' id='type-id-236'/>
    <typedef-decl name='bfd_int64_t' type-id='type-id-90' filepath='./../bfd/bfd.h' line='99' column='1' id='type-id-237'/>
    <typedef-decl name='bfd_vma' type-id='type-id-3' filepath='./../bfd/bfd.h' line='161' column='1' id='type-id-27'/>
    <typedef-decl name='bfd_signed_vma' type-id='type-id-90' filepath='./../bfd/bfd.h' line='162' column='1' id='type-id-238'/>
    <typedef-decl name='bfd_cleanup' type-id='type-id-21' filepath='./../bfd/bfd.h' line='7318' column='1' id='type-id-239'/>
    <typedef-decl name='bfd' type-id='type-id-157' filepath='./../bfd/bfd.h' line='138' column='1' id='type-id-240'/>
    <typedef-decl name='bfd_boolean' type-id='type-id-89' filepath='./../bfd/bfd.h' line='149' column='1' id='type-id-241'/>
    <typedef-decl name='sec_ptr' type-id='type-id-165' filepath='./../bfd/bfd.h' line='282' column='1' id='type-id-242'/>
    <class-decl name='bfd_section' size-in-bits='2368' is-struct='yes' visibility='default' filepath='./../bfd/bfd.h' line='789' column='1' id='type-id-243'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-46' visibility='default' filepath='./../bfd/bfd.h' line='793' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='796' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='section_id' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='800' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='index' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='803' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='next' type-id='type-id-165' visibility='default' filepath='./../bfd/bfd.h' line='806' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='prev' type-id='type-id-165' visibility='default' filepath='./../bfd/bfd.h' line='809' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='flags' type-id='type-id-161' visibility='default' filepath='./../bfd/bfd.h' line='814' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='user_set_vma' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='1020' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='linker_mark' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='1023' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='linker_has_input' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='1027' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='gc_mark' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='1030' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='compress_status' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='1033' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='segment_mark' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='1041' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22'>
        <var-decl name='sec_info_type' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='1044' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21'>
        <var-decl name='use_rela_p' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='1054' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='sec_flg0' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='1059' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='sec_flg1' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='1060' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18'>
        <var-decl name='sec_flg2' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='1061' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='sec_flg3' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='1062' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sec_flg4' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='1063' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='sec_flg5' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='1064' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='vma' type-id='type-id-27' visibility='default' filepath='./../bfd/bfd.h' line='1074' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='lma' type-id='type-id-27' visibility='default' filepath='./../bfd/bfd.h' line='1079' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='size' type-id='type-id-28' visibility='default' filepath='./../bfd/bfd.h' line='1084' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='rawsize' type-id='type-id-28' visibility='default' filepath='./../bfd/bfd.h' line='1094' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='compressed_size' type-id='type-id-28' visibility='default' filepath='./../bfd/bfd.h' line='1097' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='relax' type-id='type-id-244' visibility='default' filepath='./../bfd/bfd.h' line='1100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='relax_count' type-id='type-id-89' visibility='default' filepath='./../bfd/bfd.h' line='1103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='output_offset' type-id='type-id-27' visibility='default' filepath='./../bfd/bfd.h' line='1113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='output_section' type-id='type-id-165' visibility='default' filepath='./../bfd/bfd.h' line='1116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='alignment_power' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='1120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='relocation' type-id='type-id-245' visibility='default' filepath='./../bfd/bfd.h' line='1124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='orelocation' type-id='type-id-246' visibility='default' filepath='./../bfd/bfd.h' line='1128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='reloc_count' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='1131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='filepos' type-id='type-id-247' visibility='default' filepath='./../bfd/bfd.h' line='1137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='rel_filepos' type-id='type-id-247' visibility='default' filepath='./../bfd/bfd.h' line='1140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='line_filepos' type-id='type-id-247' visibility='default' filepath='./../bfd/bfd.h' line='1143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='userdata' type-id='type-id-47' visibility='default' filepath='./../bfd/bfd.h' line='1146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='contents' type-id='type-id-115' visibility='default' filepath='./../bfd/bfd.h' line='1150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='lineno' type-id='type-id-248' visibility='default' filepath='./../bfd/bfd.h' line='1153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='lineno_count' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='1156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='entsize' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='1159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='kept_section' type-id='type-id-165' visibility='default' filepath='./../bfd/bfd.h' line='1163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='moving_line_filepos' type-id='type-id-247' visibility='default' filepath='./../bfd/bfd.h' line='1167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='target_index' type-id='type-id-89' visibility='default' filepath='./../bfd/bfd.h' line='1170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='used_by_bfd' type-id='type-id-47' visibility='default' filepath='./../bfd/bfd.h' line='1172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='constructor_chain' type-id='type-id-249' visibility='default' filepath='./../bfd/bfd.h' line='1176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='owner' type-id='type-id-105' visibility='default' filepath='./../bfd/bfd.h' line='1179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='symbol' type-id='type-id-250' visibility='default' filepath='./../bfd/bfd.h' line='1182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='symbol_ptr_ptr' type-id='type-id-166' visibility='default' filepath='./../bfd/bfd.h' line='1183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='map_head' type-id='type-id-251' visibility='default' filepath='./../bfd/bfd.h' line='1194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='map_tail' type-id='type-id-251' visibility='default' filepath='./../bfd/bfd.h' line='1194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='already_assigned' type-id='type-id-165' visibility='default' filepath='./../bfd/bfd.h' line='1197' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='bfd_size_type' type-id='type-id-3' filepath='./../bfd/bfd.h' line='163' column='1' id='type-id-28'/>
    <class-decl name='relax_table' size-in-bits='128' is-struct='yes' visibility='default' filepath='./../bfd/bfd.h' line='1204' column='1' id='type-id-252'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-27' visibility='default' filepath='./../bfd/bfd.h' line='1206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-89' visibility='default' filepath='./../bfd/bfd.h' line='1209' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='reloc_cache_entry' size-in-bits='256' is-struct='yes' visibility='default' filepath='./../bfd/bfd.h' line='2068' column='1' id='type-id-253'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sym_ptr_ptr' type-id='type-id-166' visibility='default' filepath='./../bfd/bfd.h' line='2071' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='address' type-id='type-id-28' visibility='default' filepath='./../bfd/bfd.h' line='2074' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addend' type-id='type-id-27' visibility='default' filepath='./../bfd/bfd.h' line='2077' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='howto' type-id='type-id-254' visibility='default' filepath='./../bfd/bfd.h' line='2080' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bfd_symbol' size-in-bits='384' is-struct='yes' visibility='default' filepath='./../bfd/bfd.h' line='6283' column='1' id='type-id-255'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='the_bfd' type-id='type-id-105' visibility='default' filepath='./../bfd/bfd.h' line='6294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-46' visibility='default' filepath='./../bfd/bfd.h' line='6298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='value' type-id='type-id-256' visibility='default' filepath='./../bfd/bfd.h' line='6303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flags' type-id='type-id-161' visibility='default' filepath='./../bfd/bfd.h' line='6409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='section' type-id='type-id-165' visibility='default' filepath='./../bfd/bfd.h' line='6414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='udata' type-id='type-id-257' visibility='default' filepath='./../bfd/bfd.h' line='6422' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='symvalue' type-id='type-id-3' filepath='./../bfd/bfd.h' line='164' column='1' id='type-id-256'/>
    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='./../bfd/bfd.h' line='6417' column='1' id='type-id-257'>
      <data-member access='private'>
        <var-decl name='p' type-id='type-id-47' visibility='default' filepath='./../bfd/bfd.h' line='6419' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='i' type-id='type-id-27' visibility='default' filepath='./../bfd/bfd.h' line='6420' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='reloc_howto_type' type-id='type-id-258' filepath='./../bfd/bfd.h' line='2066' column='1' id='type-id-259'/>
    <class-decl name='reloc_howto_struct' size-in-bits='320' is-struct='yes' visibility='default' filepath='./../bfd/bfd.h' line='2104' column='1' id='type-id-260'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='2109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='size' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='2114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22'>
        <var-decl name='bitsize' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='2118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='rightshift' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='2122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='bitpos' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='2126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='complain_on_overflow' type-id='type-id-261' visibility='default' filepath='./../bfd/bfd.h' line='2130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='negate' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='2133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='pc_relative' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='2136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='partial_inplace' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='2153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='pcrel_offset' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='2161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='src_mask' type-id='type-id-27' visibility='default' filepath='./../bfd/bfd.h' line='2171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dst_mask' type-id='type-id-27' visibility='default' filepath='./../bfd/bfd.h' line='2175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='special_function' type-id='type-id-262' visibility='default' filepath='./../bfd/bfd.h' line='2180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='name' type-id='type-id-46' visibility='default' filepath='./../bfd/bfd.h' line='2185' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='complain_overflow' filepath='./../bfd/bfd.h' line='2086' column='1' id='type-id-261'>
      <underlying-type type-id='type-id-97'/>
      <enumerator name='complain_overflow_dont' value='0'/>
      <enumerator name='complain_overflow_bitfield' value='1'/>
      <enumerator name='complain_overflow_signed' value='2'/>
      <enumerator name='complain_overflow_unsigned' value='3'/>
    </enum-decl>
    <typedef-decl name='bfd_reloc_status_type' type-id='type-id-263' filepath='./../bfd/bfd.h' line='2064' column='1' id='type-id-264'/>
    <enum-decl name='bfd_reloc_status' filepath='./../bfd/bfd.h' line='2035' column='1' id='type-id-263'>
      <underlying-type type-id='type-id-97'/>
      <enumerator name='bfd_reloc_ok' value='2'/>
      <enumerator name='bfd_reloc_overflow' value='3'/>
      <enumerator name='bfd_reloc_outofrange' value='4'/>
      <enumerator name='bfd_reloc_continue' value='5'/>
      <enumerator name='bfd_reloc_notsupported' value='6'/>
      <enumerator name='bfd_reloc_other' value='7'/>
      <enumerator name='bfd_reloc_undefined' value='8'/>
      <enumerator name='bfd_reloc_dangerous' value='9'/>
    </enum-decl>
    <typedef-decl name='arelent' type-id='type-id-253' filepath='./../bfd/bfd.h' line='2083' column='1' id='type-id-265'/>
    <typedef-decl name='asection' type-id='type-id-243' filepath='./../bfd/bfd.h' line='1199' column='1' id='type-id-266'/>
    <typedef-decl name='file_ptr' type-id='type-id-90' filepath='./../bfd/bfd.h' line='216' column='1' id='type-id-247'/>
    <typedef-decl name='alent' type-id='type-id-267' filepath='./../bfd/bfd.h' line='279' column='1' id='type-id-268'/>
    <class-decl name='lineno_cache_entry' size-in-bits='128' is-struct='yes' visibility='default' filepath='./../bfd/bfd.h' line='270' column='1' id='type-id-267'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='line_number' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='u' type-id='type-id-269' visibility='default' filepath='./../bfd/bfd.h' line='277' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__2' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='./../bfd/bfd.h' line='273' column='1' id='type-id-269'>
      <data-member access='private'>
        <var-decl name='sym' type-id='type-id-250' visibility='default' filepath='./../bfd/bfd.h' line='275' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='offset' type-id='type-id-27' visibility='default' filepath='./../bfd/bfd.h' line='276' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='relent_chain' size-in-bits='320' is-struct='yes' visibility='default' filepath='./../bfd/bfd.h' line='2198' column='1' id='type-id-270'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='relent' type-id='type-id-265' visibility='default' filepath='./../bfd/bfd.h' line='2200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='next' type-id='type-id-249' visibility='default' filepath='./../bfd/bfd.h' line='2201' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__3' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='./../bfd/bfd.h' line='1190' column='1' id='type-id-251'>
      <data-member access='private'>
        <var-decl name='link_order' type-id='type-id-25' visibility='default' filepath='./../bfd/bfd.h' line='1191' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='s' type-id='type-id-165' visibility='default' filepath='./../bfd/bfd.h' line='1192' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='linked_to_symbol_name' type-id='type-id-46' visibility='default' filepath='./../bfd/bfd.h' line='1193' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='bfd_window' type-id='type-id-271' filepath='./../bfd/bfd.h' line='538' column='1' id='type-id-272'/>
    <class-decl name='_bfd_window' size-in-bits='192' is-struct='yes' visibility='default' filepath='./../bfd/bfd.h' line='525' column='1' id='type-id-271'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-47' visibility='default' filepath='./../bfd/bfd.h' line='528' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-28' visibility='default' filepath='./../bfd/bfd.h' line='529' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='i' type-id='type-id-273' visibility='default' filepath='./../bfd/bfd.h' line='536' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='asymbol' type-id='type-id-255' filepath='./../bfd/bfd.h' line='6424' column='1' id='type-id-274'/>
    <class-decl name='orl' size-in-bits='192' is-struct='yes' visibility='default' filepath='./../bfd/bfd.h' line='258' column='1' id='type-id-275'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-276' visibility='default' filepath='./../bfd/bfd.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='u' type-id='type-id-277' visibility='default' filepath='./../bfd/bfd.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='namidx' type-id='type-id-89' visibility='default' filepath='./../bfd/bfd.h' line='266' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__4' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='./../bfd/bfd.h' line='261' column='1' id='type-id-277'>
      <data-member access='private'>
        <var-decl name='pos' type-id='type-id-247' visibility='default' filepath='./../bfd/bfd.h' line='263' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='abfd' type-id='type-id-105' visibility='default' filepath='./../bfd/bfd.h' line='264' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='symindex' type-id='type-id-3' filepath='./../bfd/bfd.h' line='243' column='1' id='type-id-278'/>
    <class-decl name='stat' size-in-bits='1152' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='46' column='1' id='type-id-279'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-280' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-281' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-282' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-283' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-284' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-285' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-89' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-280' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-286' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-287' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-288' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-289' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-289' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-289' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='type-id-2' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='106' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__dev_t' type-id='type-id-3' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='133' column='1' id='type-id-280'/>
    <typedef-decl name='__ino_t' type-id='type-id-3' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='136' column='1' id='type-id-281'/>
    <typedef-decl name='__nlink_t' type-id='type-id-3' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='139' column='1' id='type-id-282'/>
    <typedef-decl name='__mode_t' type-id='type-id-16' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='138' column='1' id='type-id-283'/>
    <typedef-decl name='__uid_t' type-id='type-id-16' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='134' column='1' id='type-id-284'/>
    <typedef-decl name='__gid_t' type-id='type-id-16' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='135' column='1' id='type-id-285'/>
    <typedef-decl name='__off_t' type-id='type-id-90' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='140' column='1' id='type-id-286'/>
    <typedef-decl name='__blksize_t' type-id='type-id-90' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='162' column='1' id='type-id-287'/>
    <typedef-decl name='__blkcnt_t' type-id='type-id-90' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='167' column='1' id='type-id-288'/>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h' line='9' column='1' id='type-id-289'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-290' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h' line='12' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__time_t' type-id='type-id-90' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='148' column='1' id='type-id-290'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-90' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='184' column='1' id='type-id-1'/>
    <typedef-decl name='bfd_print_symbol_type' type-id='type-id-291' filepath='./../bfd/bfd.h' line='301' column='1' id='type-id-292'/>
    <enum-decl name='bfd_print_symbol' filepath='./../bfd/bfd.h' line='296' column='1' id='type-id-291'>
      <underlying-type type-id='type-id-97'/>
      <enumerator name='bfd_print_symbol_name' value='0'/>
      <enumerator name='bfd_print_symbol_more' value='1'/>
      <enumerator name='bfd_print_symbol_all' value='2'/>
    </enum-decl>
    <typedef-decl name='symbol_info' type-id='type-id-293' filepath='./../bfd/bfd.h' line='314' column='1' id='type-id-294'/>
    <class-decl name='_symbol_info' size-in-bits='320' is-struct='yes' visibility='default' filepath='./../bfd/bfd.h' line='305' column='1' id='type-id-293'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-256' visibility='default' filepath='./../bfd/bfd.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-8' visibility='default' filepath='./../bfd/bfd.h' line='308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-46' visibility='default' filepath='./../bfd/bfd.h' line='309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='stab_type' type-id='type-id-98' visibility='default' filepath='./../bfd/bfd.h' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='stab_other' type-id='type-id-8' visibility='default' filepath='./../bfd/bfd.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='stab_desc' type-id='type-id-91' visibility='default' filepath='./../bfd/bfd.h' line='312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='stab_name' type-id='type-id-46' visibility='default' filepath='./../bfd/bfd.h' line='313' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='bfd_reloc_code_real_type' type-id='type-id-295' filepath='./../bfd/bfd.h' line='6273' column='1' id='type-id-296'/>
    <enum-decl name='bfd_reloc_code_real' filepath='./../bfd/bfd.h' line='2233' column='1' id='type-id-295'>
      <underlying-type type-id='type-id-97'/>
      <enumerator name='_dummy_first_bfd_reloc_code_real' value='0'/>
      <enumerator name='BFD_RELOC_64' value='1'/>
      <enumerator name='BFD_RELOC_32' value='2'/>
      <enumerator name='BFD_RELOC_26' value='3'/>
      <enumerator name='BFD_RELOC_24' value='4'/>
      <enumerator name='BFD_RELOC_16' value='5'/>
      <enumerator name='BFD_RELOC_14' value='6'/>
      <enumerator name='BFD_RELOC_8' value='7'/>
      <enumerator name='BFD_RELOC_64_PCREL' value='8'/>
      <enumerator name='BFD_RELOC_32_PCREL' value='9'/>
      <enumerator name='BFD_RELOC_24_PCREL' value='10'/>
      <enumerator name='BFD_RELOC_16_PCREL' value='11'/>
      <enumerator name='BFD_RELOC_12_PCREL' value='12'/>
      <enumerator name='BFD_RELOC_8_PCREL' value='13'/>
      <enumerator name='BFD_RELOC_32_SECREL' value='14'/>
      <enumerator name='BFD_RELOC_32_GOT_PCREL' value='15'/>
      <enumerator name='BFD_RELOC_16_GOT_PCREL' value='16'/>
      <enumerator name='BFD_RELOC_8_GOT_PCREL' value='17'/>
      <enumerator name='BFD_RELOC_32_GOTOFF' value='18'/>
      <enumerator name='BFD_RELOC_16_GOTOFF' value='19'/>
      <enumerator name='BFD_RELOC_LO16_GOTOFF' value='20'/>
      <enumerator name='BFD_RELOC_HI16_GOTOFF' value='21'/>
      <enumerator name='BFD_RELOC_HI16_S_GOTOFF' value='22'/>
      <enumerator name='BFD_RELOC_8_GOTOFF' value='23'/>
      <enumerator name='BFD_RELOC_64_PLT_PCREL' value='24'/>
      <enumerator name='BFD_RELOC_32_PLT_PCREL' value='25'/>
      <enumerator name='BFD_RELOC_24_PLT_PCREL' value='26'/>
      <enumerator name='BFD_RELOC_16_PLT_PCREL' value='27'/>
      <enumerator name='BFD_RELOC_8_PLT_PCREL' value='28'/>
      <enumerator name='BFD_RELOC_64_PLTOFF' value='29'/>
      <enumerator name='BFD_RELOC_32_PLTOFF' value='30'/>
      <enumerator name='BFD_RELOC_16_PLTOFF' value='31'/>
      <enumerator name='BFD_RELOC_LO16_PLTOFF' value='32'/>
      <enumerator name='BFD_RELOC_HI16_PLTOFF' value='33'/>
      <enumerator name='BFD_RELOC_HI16_S_PLTOFF' value='34'/>
      <enumerator name='BFD_RELOC_8_PLTOFF' value='35'/>
      <enumerator name='BFD_RELOC_SIZE32' value='36'/>
      <enumerator name='BFD_RELOC_SIZE64' value='37'/>
      <enumerator name='BFD_RELOC_68K_GLOB_DAT' value='38'/>
      <enumerator name='BFD_RELOC_68K_JMP_SLOT' value='39'/>
      <enumerator name='BFD_RELOC_68K_RELATIVE' value='40'/>
      <enumerator name='BFD_RELOC_68K_TLS_GD32' value='41'/>
      <enumerator name='BFD_RELOC_68K_TLS_GD16' value='42'/>
      <enumerator name='BFD_RELOC_68K_TLS_GD8' value='43'/>
      <enumerator name='BFD_RELOC_68K_TLS_LDM32' value='44'/>
      <enumerator name='BFD_RELOC_68K_TLS_LDM16' value='45'/>
      <enumerator name='BFD_RELOC_68K_TLS_LDM8' value='46'/>
      <enumerator name='BFD_RELOC_68K_TLS_LDO32' value='47'/>
      <enumerator name='BFD_RELOC_68K_TLS_LDO16' value='48'/>
      <enumerator name='BFD_RELOC_68K_TLS_LDO8' value='49'/>
      <enumerator name='BFD_RELOC_68K_TLS_IE32' value='50'/>
      <enumerator name='BFD_RELOC_68K_TLS_IE16' value='51'/>
      <enumerator name='BFD_RELOC_68K_TLS_IE8' value='52'/>
      <enumerator name='BFD_RELOC_68K_TLS_LE32' value='53'/>
      <enumerator name='BFD_RELOC_68K_TLS_LE16' value='54'/>
      <enumerator name='BFD_RELOC_68K_TLS_LE8' value='55'/>
      <enumerator name='BFD_RELOC_32_BASEREL' value='56'/>
      <enumerator name='BFD_RELOC_16_BASEREL' value='57'/>
      <enumerator name='BFD_RELOC_LO16_BASEREL' value='58'/>
      <enumerator name='BFD_RELOC_HI16_BASEREL' value='59'/>
      <enumerator name='BFD_RELOC_HI16_S_BASEREL' value='60'/>
      <enumerator name='BFD_RELOC_8_BASEREL' value='61'/>
      <enumerator name='BFD_RELOC_RVA' value='62'/>
      <enumerator name='BFD_RELOC_8_FFnn' value='63'/>
      <enumerator name='BFD_RELOC_32_PCREL_S2' value='64'/>
      <enumerator name='BFD_RELOC_16_PCREL_S2' value='65'/>
      <enumerator name='BFD_RELOC_23_PCREL_S2' value='66'/>
      <enumerator name='BFD_RELOC_HI22' value='67'/>
      <enumerator name='BFD_RELOC_LO10' value='68'/>
      <enumerator name='BFD_RELOC_GPREL16' value='69'/>
      <enumerator name='BFD_RELOC_GPREL32' value='70'/>
      <enumerator name='BFD_RELOC_NONE' value='71'/>
      <enumerator name='BFD_RELOC_SPARC_WDISP22' value='72'/>
      <enumerator name='BFD_RELOC_SPARC22' value='73'/>
      <enumerator name='BFD_RELOC_SPARC13' value='74'/>
      <enumerator name='BFD_RELOC_SPARC_GOT10' value='75'/>
      <enumerator name='BFD_RELOC_SPARC_GOT13' value='76'/>
      <enumerator name='BFD_RELOC_SPARC_GOT22' value='77'/>
      <enumerator name='BFD_RELOC_SPARC_PC10' value='78'/>
      <enumerator name='BFD_RELOC_SPARC_PC22' value='79'/>
      <enumerator name='BFD_RELOC_SPARC_WPLT30' value='80'/>
      <enumerator name='BFD_RELOC_SPARC_COPY' value='81'/>
      <enumerator name='BFD_RELOC_SPARC_GLOB_DAT' value='82'/>
      <enumerator name='BFD_RELOC_SPARC_JMP_SLOT' value='83'/>
      <enumerator name='BFD_RELOC_SPARC_RELATIVE' value='84'/>
      <enumerator name='BFD_RELOC_SPARC_UA16' value='85'/>
      <enumerator name='BFD_RELOC_SPARC_UA32' value='86'/>
      <enumerator name='BFD_RELOC_SPARC_UA64' value='87'/>
      <enumerator name='BFD_RELOC_SPARC_GOTDATA_HIX22' value='88'/>
      <enumerator name='BFD_RELOC_SPARC_GOTDATA_LOX10' value='89'/>
      <enumerator name='BFD_RELOC_SPARC_GOTDATA_OP_HIX22' value='90'/>
      <enumerator name='BFD_RELOC_SPARC_GOTDATA_OP_LOX10' value='91'/>
      <enumerator name='BFD_RELOC_SPARC_GOTDATA_OP' value='92'/>
      <enumerator name='BFD_RELOC_SPARC_JMP_IREL' value='93'/>
      <enumerator name='BFD_RELOC_SPARC_IRELATIVE' value='94'/>
      <enumerator name='BFD_RELOC_SPARC_BASE13' value='95'/>
      <enumerator name='BFD_RELOC_SPARC_BASE22' value='96'/>
      <enumerator name='BFD_RELOC_SPARC_10' value='97'/>
      <enumerator name='BFD_RELOC_SPARC_11' value='98'/>
      <enumerator name='BFD_RELOC_SPARC_OLO10' value='99'/>
      <enumerator name='BFD_RELOC_SPARC_HH22' value='100'/>
      <enumerator name='BFD_RELOC_SPARC_HM10' value='101'/>
      <enumerator name='BFD_RELOC_SPARC_LM22' value='102'/>
      <enumerator name='BFD_RELOC_SPARC_PC_HH22' value='103'/>
      <enumerator name='BFD_RELOC_SPARC_PC_HM10' value='104'/>
      <enumerator name='BFD_RELOC_SPARC_PC_LM22' value='105'/>
      <enumerator name='BFD_RELOC_SPARC_WDISP16' value='106'/>
      <enumerator name='BFD_RELOC_SPARC_WDISP19' value='107'/>
      <enumerator name='BFD_RELOC_SPARC_7' value='108'/>
      <enumerator name='BFD_RELOC_SPARC_6' value='109'/>
      <enumerator name='BFD_RELOC_SPARC_5' value='110'/>
      <enumerator name='BFD_RELOC_SPARC_PLT32' value='111'/>
      <enumerator name='BFD_RELOC_SPARC_PLT64' value='112'/>
      <enumerator name='BFD_RELOC_SPARC_HIX22' value='113'/>
      <enumerator name='BFD_RELOC_SPARC_LOX10' value='114'/>
      <enumerator name='BFD_RELOC_SPARC_H44' value='115'/>
      <enumerator name='BFD_RELOC_SPARC_M44' value='116'/>
      <enumerator name='BFD_RELOC_SPARC_L44' value='117'/>
      <enumerator name='BFD_RELOC_SPARC_REGISTER' value='118'/>
      <enumerator name='BFD_RELOC_SPARC_H34' value='119'/>
      <enumerator name='BFD_RELOC_SPARC_SIZE32' value='120'/>
      <enumerator name='BFD_RELOC_SPARC_SIZE64' value='121'/>
      <enumerator name='BFD_RELOC_SPARC_WDISP10' value='122'/>
      <enumerator name='BFD_RELOC_SPARC_REV32' value='123'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_GD_HI22' value='124'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_GD_LO10' value='125'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_GD_ADD' value='126'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_GD_CALL' value='127'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_LDM_HI22' value='128'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_LDM_LO10' value='129'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_LDM_ADD' value='130'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_LDM_CALL' value='131'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_LDO_HIX22' value='132'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_LDO_LOX10' value='133'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_LDO_ADD' value='134'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_IE_HI22' value='135'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_IE_LO10' value='136'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_IE_LD' value='137'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_IE_LDX' value='138'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_IE_ADD' value='139'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_LE_HIX22' value='140'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_LE_LOX10' value='141'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_DTPMOD32' value='142'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_DTPMOD64' value='143'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_DTPOFF32' value='144'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_DTPOFF64' value='145'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_TPOFF32' value='146'/>
      <enumerator name='BFD_RELOC_SPARC_TLS_TPOFF64' value='147'/>
      <enumerator name='BFD_RELOC_SPU_IMM7' value='148'/>
      <enumerator name='BFD_RELOC_SPU_IMM8' value='149'/>
      <enumerator name='BFD_RELOC_SPU_IMM10' value='150'/>
      <enumerator name='BFD_RELOC_SPU_IMM10W' value='151'/>
      <enumerator name='BFD_RELOC_SPU_IMM16' value='152'/>
      <enumerator name='BFD_RELOC_SPU_IMM16W' value='153'/>
      <enumerator name='BFD_RELOC_SPU_IMM18' value='154'/>
      <enumerator name='BFD_RELOC_SPU_PCREL9a' value='155'/>
      <enumerator name='BFD_RELOC_SPU_PCREL9b' value='156'/>
      <enumerator name='BFD_RELOC_SPU_PCREL16' value='157'/>
      <enumerator name='BFD_RELOC_SPU_LO16' value='158'/>
      <enumerator name='BFD_RELOC_SPU_HI16' value='159'/>
      <enumerator name='BFD_RELOC_SPU_PPU32' value='160'/>
      <enumerator name='BFD_RELOC_SPU_PPU64' value='161'/>
      <enumerator name='BFD_RELOC_SPU_ADD_PIC' value='162'/>
      <enumerator name='BFD_RELOC_ALPHA_GPDISP_HI16' value='163'/>
      <enumerator name='BFD_RELOC_ALPHA_GPDISP_LO16' value='164'/>
      <enumerator name='BFD_RELOC_ALPHA_GPDISP' value='165'/>
      <enumerator name='BFD_RELOC_ALPHA_LITERAL' value='166'/>
      <enumerator name='BFD_RELOC_ALPHA_ELF_LITERAL' value='167'/>
      <enumerator name='BFD_RELOC_ALPHA_LITUSE' value='168'/>
      <enumerator name='BFD_RELOC_ALPHA_HINT' value='169'/>
      <enumerator name='BFD_RELOC_ALPHA_LINKAGE' value='170'/>
      <enumerator name='BFD_RELOC_ALPHA_CODEADDR' value='171'/>
      <enumerator name='BFD_RELOC_ALPHA_GPREL_HI16' value='172'/>
      <enumerator name='BFD_RELOC_ALPHA_GPREL_LO16' value='173'/>
      <enumerator name='BFD_RELOC_ALPHA_BRSGP' value='174'/>
      <enumerator name='BFD_RELOC_ALPHA_NOP' value='175'/>
      <enumerator name='BFD_RELOC_ALPHA_BSR' value='176'/>
      <enumerator name='BFD_RELOC_ALPHA_LDA' value='177'/>
      <enumerator name='BFD_RELOC_ALPHA_BOH' value='178'/>
      <enumerator name='BFD_RELOC_ALPHA_TLSGD' value='179'/>
      <enumerator name='BFD_RELOC_ALPHA_TLSLDM' value='180'/>
      <enumerator name='BFD_RELOC_ALPHA_DTPMOD64' value='181'/>
      <enumerator name='BFD_RELOC_ALPHA_GOTDTPREL16' value='182'/>
      <enumerator name='BFD_RELOC_ALPHA_DTPREL64' value='183'/>
      <enumerator name='BFD_RELOC_ALPHA_DTPREL_HI16' value='184'/>
      <enumerator name='BFD_RELOC_ALPHA_DTPREL_LO16' value='185'/>
      <enumerator name='BFD_RELOC_ALPHA_DTPREL16' value='186'/>
      <enumerator name='BFD_RELOC_ALPHA_GOTTPREL16' value='187'/>
      <enumerator name='BFD_RELOC_ALPHA_TPREL64' value='188'/>
      <enumerator name='BFD_RELOC_ALPHA_TPREL_HI16' value='189'/>
      <enumerator name='BFD_RELOC_ALPHA_TPREL_LO16' value='190'/>
      <enumerator name='BFD_RELOC_ALPHA_TPREL16' value='191'/>
      <enumerator name='BFD_RELOC_MIPS_JMP' value='192'/>
      <enumerator name='BFD_RELOC_MICROMIPS_JMP' value='193'/>
      <enumerator name='BFD_RELOC_MIPS16_JMP' value='194'/>
      <enumerator name='BFD_RELOC_MIPS16_GPREL' value='195'/>
      <enumerator name='BFD_RELOC_HI16' value='196'/>
      <enumerator name='BFD_RELOC_HI16_S' value='197'/>
      <enumerator name='BFD_RELOC_LO16' value='198'/>
      <enumerator name='BFD_RELOC_HI16_PCREL' value='199'/>
      <enumerator name='BFD_RELOC_HI16_S_PCREL' value='200'/>
      <enumerator name='BFD_RELOC_LO16_PCREL' value='201'/>
      <enumerator name='BFD_RELOC_MIPS16_GOT16' value='202'/>
      <enumerator name='BFD_RELOC_MIPS16_CALL16' value='203'/>
      <enumerator name='BFD_RELOC_MIPS16_HI16' value='204'/>
      <enumerator name='BFD_RELOC_MIPS16_HI16_S' value='205'/>
      <enumerator name='BFD_RELOC_MIPS16_LO16' value='206'/>
      <enumerator name='BFD_RELOC_MIPS16_TLS_GD' value='207'/>
      <enumerator name='BFD_RELOC_MIPS16_TLS_LDM' value='208'/>
      <enumerator name='BFD_RELOC_MIPS16_TLS_DTPREL_HI16' value='209'/>
      <enumerator name='BFD_RELOC_MIPS16_TLS_DTPREL_LO16' value='210'/>
      <enumerator name='BFD_RELOC_MIPS16_TLS_GOTTPREL' value='211'/>
      <enumerator name='BFD_RELOC_MIPS16_TLS_TPREL_HI16' value='212'/>
      <enumerator name='BFD_RELOC_MIPS16_TLS_TPREL_LO16' value='213'/>
      <enumerator name='BFD_RELOC_MIPS_LITERAL' value='214'/>
      <enumerator name='BFD_RELOC_MICROMIPS_LITERAL' value='215'/>
      <enumerator name='BFD_RELOC_MICROMIPS_7_PCREL_S1' value='216'/>
      <enumerator name='BFD_RELOC_MICROMIPS_10_PCREL_S1' value='217'/>
      <enumerator name='BFD_RELOC_MICROMIPS_16_PCREL_S1' value='218'/>
      <enumerator name='BFD_RELOC_MIPS16_16_PCREL_S1' value='219'/>
      <enumerator name='BFD_RELOC_MIPS_21_PCREL_S2' value='220'/>
      <enumerator name='BFD_RELOC_MIPS_26_PCREL_S2' value='221'/>
      <enumerator name='BFD_RELOC_MIPS_18_PCREL_S3' value='222'/>
      <enumerator name='BFD_RELOC_MIPS_19_PCREL_S2' value='223'/>
      <enumerator name='BFD_RELOC_MICROMIPS_GPREL16' value='224'/>
      <enumerator name='BFD_RELOC_MICROMIPS_HI16' value='225'/>
      <enumerator name='BFD_RELOC_MICROMIPS_HI16_S' value='226'/>
      <enumerator name='BFD_RELOC_MICROMIPS_LO16' value='227'/>
      <enumerator name='BFD_RELOC_MIPS_GOT16' value='228'/>
      <enumerator name='BFD_RELOC_MICROMIPS_GOT16' value='229'/>
      <enumerator name='BFD_RELOC_MIPS_CALL16' value='230'/>
      <enumerator name='BFD_RELOC_MICROMIPS_CALL16' value='231'/>
      <enumerator name='BFD_RELOC_MIPS_GOT_HI16' value='232'/>
      <enumerator name='BFD_RELOC_MICROMIPS_GOT_HI16' value='233'/>
      <enumerator name='BFD_RELOC_MIPS_GOT_LO16' value='234'/>
      <enumerator name='BFD_RELOC_MICROMIPS_GOT_LO16' value='235'/>
      <enumerator name='BFD_RELOC_MIPS_CALL_HI16' value='236'/>
      <enumerator name='BFD_RELOC_MICROMIPS_CALL_HI16' value='237'/>
      <enumerator name='BFD_RELOC_MIPS_CALL_LO16' value='238'/>
      <enumerator name='BFD_RELOC_MICROMIPS_CALL_LO16' value='239'/>
      <enumerator name='BFD_RELOC_MIPS_SUB' value='240'/>
      <enumerator name='BFD_RELOC_MICROMIPS_SUB' value='241'/>
      <enumerator name='BFD_RELOC_MIPS_GOT_PAGE' value='242'/>
      <enumerator name='BFD_RELOC_MICROMIPS_GOT_PAGE' value='243'/>
      <enumerator name='BFD_RELOC_MIPS_GOT_OFST' value='244'/>
      <enumerator name='BFD_RELOC_MICROMIPS_GOT_OFST' value='245'/>
      <enumerator name='BFD_RELOC_MIPS_GOT_DISP' value='246'/>
      <enumerator name='BFD_RELOC_MICROMIPS_GOT_DISP' value='247'/>
      <enumerator name='BFD_RELOC_MIPS_SHIFT5' value='248'/>
      <enumerator name='BFD_RELOC_MIPS_SHIFT6' value='249'/>
      <enumerator name='BFD_RELOC_MIPS_INSERT_A' value='250'/>
      <enumerator name='BFD_RELOC_MIPS_INSERT_B' value='251'/>
      <enumerator name='BFD_RELOC_MIPS_DELETE' value='252'/>
      <enumerator name='BFD_RELOC_MIPS_HIGHEST' value='253'/>
      <enumerator name='BFD_RELOC_MICROMIPS_HIGHEST' value='254'/>
      <enumerator name='BFD_RELOC_MIPS_HIGHER' value='255'/>
      <enumerator name='BFD_RELOC_MICROMIPS_HIGHER' value='256'/>
      <enumerator name='BFD_RELOC_MIPS_SCN_DISP' value='257'/>
      <enumerator name='BFD_RELOC_MICROMIPS_SCN_DISP' value='258'/>
      <enumerator name='BFD_RELOC_MIPS_REL16' value='259'/>
      <enumerator name='BFD_RELOC_MIPS_RELGOT' value='260'/>
      <enumerator name='BFD_RELOC_MIPS_JALR' value='261'/>
      <enumerator name='BFD_RELOC_MICROMIPS_JALR' value='262'/>
      <enumerator name='BFD_RELOC_MIPS_TLS_DTPMOD32' value='263'/>
      <enumerator name='BFD_RELOC_MIPS_TLS_DTPREL32' value='264'/>
      <enumerator name='BFD_RELOC_MIPS_TLS_DTPMOD64' value='265'/>
      <enumerator name='BFD_RELOC_MIPS_TLS_DTPREL64' value='266'/>
      <enumerator name='BFD_RELOC_MIPS_TLS_GD' value='267'/>
      <enumerator name='BFD_RELOC_MICROMIPS_TLS_GD' value='268'/>
      <enumerator name='BFD_RELOC_MIPS_TLS_LDM' value='269'/>
      <enumerator name='BFD_RELOC_MICROMIPS_TLS_LDM' value='270'/>
      <enumerator name='BFD_RELOC_MIPS_TLS_DTPREL_HI16' value='271'/>
      <enumerator name='BFD_RELOC_MICROMIPS_TLS_DTPREL_HI16' value='272'/>
      <enumerator name='BFD_RELOC_MIPS_TLS_DTPREL_LO16' value='273'/>
      <enumerator name='BFD_RELOC_MICROMIPS_TLS_DTPREL_LO16' value='274'/>
      <enumerator name='BFD_RELOC_MIPS_TLS_GOTTPREL' value='275'/>
      <enumerator name='BFD_RELOC_MICROMIPS_TLS_GOTTPREL' value='276'/>
      <enumerator name='BFD_RELOC_MIPS_TLS_TPREL32' value='277'/>
      <enumerator name='BFD_RELOC_MIPS_TLS_TPREL64' value='278'/>
      <enumerator name='BFD_RELOC_MIPS_TLS_TPREL_HI16' value='279'/>
      <enumerator name='BFD_RELOC_MICROMIPS_TLS_TPREL_HI16' value='280'/>
      <enumerator name='BFD_RELOC_MIPS_TLS_TPREL_LO16' value='281'/>
      <enumerator name='BFD_RELOC_MICROMIPS_TLS_TPREL_LO16' value='282'/>
      <enumerator name='BFD_RELOC_MIPS_EH' value='283'/>
      <enumerator name='BFD_RELOC_MIPS_COPY' value='284'/>
      <enumerator name='BFD_RELOC_MIPS_JUMP_SLOT' value='285'/>
      <enumerator name='BFD_RELOC_MOXIE_10_PCREL' value='286'/>
      <enumerator name='BFD_RELOC_FT32_10' value='287'/>
      <enumerator name='BFD_RELOC_FT32_20' value='288'/>
      <enumerator name='BFD_RELOC_FT32_17' value='289'/>
      <enumerator name='BFD_RELOC_FT32_18' value='290'/>
      <enumerator name='BFD_RELOC_FT32_RELAX' value='291'/>
      <enumerator name='BFD_RELOC_FT32_SC0' value='292'/>
      <enumerator name='BFD_RELOC_FT32_SC1' value='293'/>
      <enumerator name='BFD_RELOC_FT32_15' value='294'/>
      <enumerator name='BFD_RELOC_FT32_DIFF32' value='295'/>
      <enumerator name='BFD_RELOC_FRV_LABEL16' value='296'/>
      <enumerator name='BFD_RELOC_FRV_LABEL24' value='297'/>
      <enumerator name='BFD_RELOC_FRV_LO16' value='298'/>
      <enumerator name='BFD_RELOC_FRV_HI16' value='299'/>
      <enumerator name='BFD_RELOC_FRV_GPREL12' value='300'/>
      <enumerator name='BFD_RELOC_FRV_GPRELU12' value='301'/>
      <enumerator name='BFD_RELOC_FRV_GPREL32' value='302'/>
      <enumerator name='BFD_RELOC_FRV_GPRELHI' value='303'/>
      <enumerator name='BFD_RELOC_FRV_GPRELLO' value='304'/>
      <enumerator name='BFD_RELOC_FRV_GOT12' value='305'/>
      <enumerator name='BFD_RELOC_FRV_GOTHI' value='306'/>
      <enumerator name='BFD_RELOC_FRV_GOTLO' value='307'/>
      <enumerator name='BFD_RELOC_FRV_FUNCDESC' value='308'/>
      <enumerator name='BFD_RELOC_FRV_FUNCDESC_GOT12' value='309'/>
      <enumerator name='BFD_RELOC_FRV_FUNCDESC_GOTHI' value='310'/>
      <enumerator name='BFD_RELOC_FRV_FUNCDESC_GOTLO' value='311'/>
      <enumerator name='BFD_RELOC_FRV_FUNCDESC_VALUE' value='312'/>
      <enumerator name='BFD_RELOC_FRV_FUNCDESC_GOTOFF12' value='313'/>
      <enumerator name='BFD_RELOC_FRV_FUNCDESC_GOTOFFHI' value='314'/>
      <enumerator name='BFD_RELOC_FRV_FUNCDESC_GOTOFFLO' value='315'/>
      <enumerator name='BFD_RELOC_FRV_GOTOFF12' value='316'/>
      <enumerator name='BFD_RELOC_FRV_GOTOFFHI' value='317'/>
      <enumerator name='BFD_RELOC_FRV_GOTOFFLO' value='318'/>
      <enumerator name='BFD_RELOC_FRV_GETTLSOFF' value='319'/>
      <enumerator name='BFD_RELOC_FRV_TLSDESC_VALUE' value='320'/>
      <enumerator name='BFD_RELOC_FRV_GOTTLSDESC12' value='321'/>
      <enumerator name='BFD_RELOC_FRV_GOTTLSDESCHI' value='322'/>
      <enumerator name='BFD_RELOC_FRV_GOTTLSDESCLO' value='323'/>
      <enumerator name='BFD_RELOC_FRV_TLSMOFF12' value='324'/>
      <enumerator name='BFD_RELOC_FRV_TLSMOFFHI' value='325'/>
      <enumerator name='BFD_RELOC_FRV_TLSMOFFLO' value='326'/>
      <enumerator name='BFD_RELOC_FRV_GOTTLSOFF12' value='327'/>
      <enumerator name='BFD_RELOC_FRV_GOTTLSOFFHI' value='328'/>
      <enumerator name='BFD_RELOC_FRV_GOTTLSOFFLO' value='329'/>
      <enumerator name='BFD_RELOC_FRV_TLSOFF' value='330'/>
      <enumerator name='BFD_RELOC_FRV_TLSDESC_RELAX' value='331'/>
      <enumerator name='BFD_RELOC_FRV_GETTLSOFF_RELAX' value='332'/>
      <enumerator name='BFD_RELOC_FRV_TLSOFF_RELAX' value='333'/>
      <enumerator name='BFD_RELOC_FRV_TLSMOFF' value='334'/>
      <enumerator name='BFD_RELOC_MN10300_GOTOFF24' value='335'/>
      <enumerator name='BFD_RELOC_MN10300_GOT32' value='336'/>
      <enumerator name='BFD_RELOC_MN10300_GOT24' value='337'/>
      <enumerator name='BFD_RELOC_MN10300_GOT16' value='338'/>
      <enumerator name='BFD_RELOC_MN10300_COPY' value='339'/>
      <enumerator name='BFD_RELOC_MN10300_GLOB_DAT' value='340'/>
      <enumerator name='BFD_RELOC_MN10300_JMP_SLOT' value='341'/>
      <enumerator name='BFD_RELOC_MN10300_RELATIVE' value='342'/>
      <enumerator name='BFD_RELOC_MN10300_SYM_DIFF' value='343'/>
      <enumerator name='BFD_RELOC_MN10300_ALIGN' value='344'/>
      <enumerator name='BFD_RELOC_MN10300_TLS_GD' value='345'/>
      <enumerator name='BFD_RELOC_MN10300_TLS_LD' value='346'/>
      <enumerator name='BFD_RELOC_MN10300_TLS_LDO' value='347'/>
      <enumerator name='BFD_RELOC_MN10300_TLS_GOTIE' value='348'/>
      <enumerator name='BFD_RELOC_MN10300_TLS_IE' value='349'/>
      <enumerator name='BFD_RELOC_MN10300_TLS_LE' value='350'/>
      <enumerator name='BFD_RELOC_MN10300_TLS_DTPMOD' value='351'/>
      <enumerator name='BFD_RELOC_MN10300_TLS_DTPOFF' value='352'/>
      <enumerator name='BFD_RELOC_MN10300_TLS_TPOFF' value='353'/>
      <enumerator name='BFD_RELOC_MN10300_32_PCREL' value='354'/>
      <enumerator name='BFD_RELOC_MN10300_16_PCREL' value='355'/>
      <enumerator name='BFD_RELOC_386_GOT32' value='356'/>
      <enumerator name='BFD_RELOC_386_PLT32' value='357'/>
      <enumerator name='BFD_RELOC_386_COPY' value='358'/>
      <enumerator name='BFD_RELOC_386_GLOB_DAT' value='359'/>
      <enumerator name='BFD_RELOC_386_JUMP_SLOT' value='360'/>
      <enumerator name='BFD_RELOC_386_RELATIVE' value='361'/>
      <enumerator name='BFD_RELOC_386_GOTOFF' value='362'/>
      <enumerator name='BFD_RELOC_386_GOTPC' value='363'/>
      <enumerator name='BFD_RELOC_386_TLS_TPOFF' value='364'/>
      <enumerator name='BFD_RELOC_386_TLS_IE' value='365'/>
      <enumerator name='BFD_RELOC_386_TLS_GOTIE' value='366'/>
      <enumerator name='BFD_RELOC_386_TLS_LE' value='367'/>
      <enumerator name='BFD_RELOC_386_TLS_GD' value='368'/>
      <enumerator name='BFD_RELOC_386_TLS_LDM' value='369'/>
      <enumerator name='BFD_RELOC_386_TLS_LDO_32' value='370'/>
      <enumerator name='BFD_RELOC_386_TLS_IE_32' value='371'/>
      <enumerator name='BFD_RELOC_386_TLS_LE_32' value='372'/>
      <enumerator name='BFD_RELOC_386_TLS_DTPMOD32' value='373'/>
      <enumerator name='BFD_RELOC_386_TLS_DTPOFF32' value='374'/>
      <enumerator name='BFD_RELOC_386_TLS_TPOFF32' value='375'/>
      <enumerator name='BFD_RELOC_386_TLS_GOTDESC' value='376'/>
      <enumerator name='BFD_RELOC_386_TLS_DESC_CALL' value='377'/>
      <enumerator name='BFD_RELOC_386_TLS_DESC' value='378'/>
      <enumerator name='BFD_RELOC_386_IRELATIVE' value='379'/>
      <enumerator name='BFD_RELOC_386_GOT32X' value='380'/>
      <enumerator name='BFD_RELOC_X86_64_GOT32' value='381'/>
      <enumerator name='BFD_RELOC_X86_64_PLT32' value='382'/>
      <enumerator name='BFD_RELOC_X86_64_COPY' value='383'/>
      <enumerator name='BFD_RELOC_X86_64_GLOB_DAT' value='384'/>
      <enumerator name='BFD_RELOC_X86_64_JUMP_SLOT' value='385'/>
      <enumerator name='BFD_RELOC_X86_64_RELATIVE' value='386'/>
      <enumerator name='BFD_RELOC_X86_64_GOTPCREL' value='387'/>
      <enumerator name='BFD_RELOC_X86_64_32S' value='388'/>
      <enumerator name='BFD_RELOC_X86_64_DTPMOD64' value='389'/>
      <enumerator name='BFD_RELOC_X86_64_DTPOFF64' value='390'/>
      <enumerator name='BFD_RELOC_X86_64_TPOFF64' value='391'/>
      <enumerator name='BFD_RELOC_X86_64_TLSGD' value='392'/>
      <enumerator name='BFD_RELOC_X86_64_TLSLD' value='393'/>
      <enumerator name='BFD_RELOC_X86_64_DTPOFF32' value='394'/>
      <enumerator name='BFD_RELOC_X86_64_GOTTPOFF' value='395'/>
      <enumerator name='BFD_RELOC_X86_64_TPOFF32' value='396'/>
      <enumerator name='BFD_RELOC_X86_64_GOTOFF64' value='397'/>
      <enumerator name='BFD_RELOC_X86_64_GOTPC32' value='398'/>
      <enumerator name='BFD_RELOC_X86_64_GOT64' value='399'/>
      <enumerator name='BFD_RELOC_X86_64_GOTPCREL64' value='400'/>
      <enumerator name='BFD_RELOC_X86_64_GOTPC64' value='401'/>
      <enumerator name='BFD_RELOC_X86_64_GOTPLT64' value='402'/>
      <enumerator name='BFD_RELOC_X86_64_PLTOFF64' value='403'/>
      <enumerator name='BFD_RELOC_X86_64_GOTPC32_TLSDESC' value='404'/>
      <enumerator name='BFD_RELOC_X86_64_TLSDESC_CALL' value='405'/>
      <enumerator name='BFD_RELOC_X86_64_TLSDESC' value='406'/>
      <enumerator name='BFD_RELOC_X86_64_IRELATIVE' value='407'/>
      <enumerator name='BFD_RELOC_X86_64_PC32_BND' value='408'/>
      <enumerator name='BFD_RELOC_X86_64_PLT32_BND' value='409'/>
      <enumerator name='BFD_RELOC_X86_64_GOTPCRELX' value='410'/>
      <enumerator name='BFD_RELOC_X86_64_REX_GOTPCRELX' value='411'/>
      <enumerator name='BFD_RELOC_NS32K_IMM_8' value='412'/>
      <enumerator name='BFD_RELOC_NS32K_IMM_16' value='413'/>
      <enumerator name='BFD_RELOC_NS32K_IMM_32' value='414'/>
      <enumerator name='BFD_RELOC_NS32K_IMM_8_PCREL' value='415'/>
      <enumerator name='BFD_RELOC_NS32K_IMM_16_PCREL' value='416'/>
      <enumerator name='BFD_RELOC_NS32K_IMM_32_PCREL' value='417'/>
      <enumerator name='BFD_RELOC_NS32K_DISP_8' value='418'/>
      <enumerator name='BFD_RELOC_NS32K_DISP_16' value='419'/>
      <enumerator name='BFD_RELOC_NS32K_DISP_32' value='420'/>
      <enumerator name='BFD_RELOC_NS32K_DISP_8_PCREL' value='421'/>
      <enumerator name='BFD_RELOC_NS32K_DISP_16_PCREL' value='422'/>
      <enumerator name='BFD_RELOC_NS32K_DISP_32_PCREL' value='423'/>
      <enumerator name='BFD_RELOC_PDP11_DISP_8_PCREL' value='424'/>
      <enumerator name='BFD_RELOC_PDP11_DISP_6_PCREL' value='425'/>
      <enumerator name='BFD_RELOC_PJ_CODE_HI16' value='426'/>
      <enumerator name='BFD_RELOC_PJ_CODE_LO16' value='427'/>
      <enumerator name='BFD_RELOC_PJ_CODE_DIR16' value='428'/>
      <enumerator name='BFD_RELOC_PJ_CODE_DIR32' value='429'/>
      <enumerator name='BFD_RELOC_PJ_CODE_REL16' value='430'/>
      <enumerator name='BFD_RELOC_PJ_CODE_REL32' value='431'/>
      <enumerator name='BFD_RELOC_PPC_B26' value='432'/>
      <enumerator name='BFD_RELOC_PPC_BA26' value='433'/>
      <enumerator name='BFD_RELOC_PPC_TOC16' value='434'/>
      <enumerator name='BFD_RELOC_PPC_B16' value='435'/>
      <enumerator name='BFD_RELOC_PPC_B16_BRTAKEN' value='436'/>
      <enumerator name='BFD_RELOC_PPC_B16_BRNTAKEN' value='437'/>
      <enumerator name='BFD_RELOC_PPC_BA16' value='438'/>
      <enumerator name='BFD_RELOC_PPC_BA16_BRTAKEN' value='439'/>
      <enumerator name='BFD_RELOC_PPC_BA16_BRNTAKEN' value='440'/>
      <enumerator name='BFD_RELOC_PPC_COPY' value='441'/>
      <enumerator name='BFD_RELOC_PPC_GLOB_DAT' value='442'/>
      <enumerator name='BFD_RELOC_PPC_JMP_SLOT' value='443'/>
      <enumerator name='BFD_RELOC_PPC_RELATIVE' value='444'/>
      <enumerator name='BFD_RELOC_PPC_LOCAL24PC' value='445'/>
      <enumerator name='BFD_RELOC_PPC_EMB_NADDR32' value='446'/>
      <enumerator name='BFD_RELOC_PPC_EMB_NADDR16' value='447'/>
      <enumerator name='BFD_RELOC_PPC_EMB_NADDR16_LO' value='448'/>
      <enumerator name='BFD_RELOC_PPC_EMB_NADDR16_HI' value='449'/>
      <enumerator name='BFD_RELOC_PPC_EMB_NADDR16_HA' value='450'/>
      <enumerator name='BFD_RELOC_PPC_EMB_SDAI16' value='451'/>
      <enumerator name='BFD_RELOC_PPC_EMB_SDA2I16' value='452'/>
      <enumerator name='BFD_RELOC_PPC_EMB_SDA2REL' value='453'/>
      <enumerator name='BFD_RELOC_PPC_EMB_SDA21' value='454'/>
      <enumerator name='BFD_RELOC_PPC_EMB_MRKREF' value='455'/>
      <enumerator name='BFD_RELOC_PPC_EMB_RELSEC16' value='456'/>
      <enumerator name='BFD_RELOC_PPC_EMB_RELST_LO' value='457'/>
      <enumerator name='BFD_RELOC_PPC_EMB_RELST_HI' value='458'/>
      <enumerator name='BFD_RELOC_PPC_EMB_RELST_HA' value='459'/>
      <enumerator name='BFD_RELOC_PPC_EMB_BIT_FLD' value='460'/>
      <enumerator name='BFD_RELOC_PPC_EMB_RELSDA' value='461'/>
      <enumerator name='BFD_RELOC_PPC_VLE_REL8' value='462'/>
      <enumerator name='BFD_RELOC_PPC_VLE_REL15' value='463'/>
      <enumerator name='BFD_RELOC_PPC_VLE_REL24' value='464'/>
      <enumerator name='BFD_RELOC_PPC_VLE_LO16A' value='465'/>
      <enumerator name='BFD_RELOC_PPC_VLE_LO16D' value='466'/>
      <enumerator name='BFD_RELOC_PPC_VLE_HI16A' value='467'/>
      <enumerator name='BFD_RELOC_PPC_VLE_HI16D' value='468'/>
      <enumerator name='BFD_RELOC_PPC_VLE_HA16A' value='469'/>
      <enumerator name='BFD_RELOC_PPC_VLE_HA16D' value='470'/>
      <enumerator name='BFD_RELOC_PPC_VLE_SDA21' value='471'/>
      <enumerator name='BFD_RELOC_PPC_VLE_SDA21_LO' value='472'/>
      <enumerator name='BFD_RELOC_PPC_VLE_SDAREL_LO16A' value='473'/>
      <enumerator name='BFD_RELOC_PPC_VLE_SDAREL_LO16D' value='474'/>
      <enumerator name='BFD_RELOC_PPC_VLE_SDAREL_HI16A' value='475'/>
      <enumerator name='BFD_RELOC_PPC_VLE_SDAREL_HI16D' value='476'/>
      <enumerator name='BFD_RELOC_PPC_VLE_SDAREL_HA16A' value='477'/>
      <enumerator name='BFD_RELOC_PPC_VLE_SDAREL_HA16D' value='478'/>
      <enumerator name='BFD_RELOC_PPC_16DX_HA' value='479'/>
      <enumerator name='BFD_RELOC_PPC_REL16DX_HA' value='480'/>
      <enumerator name='BFD_RELOC_PPC64_HIGHER' value='481'/>
      <enumerator name='BFD_RELOC_PPC64_HIGHER_S' value='482'/>
      <enumerator name='BFD_RELOC_PPC64_HIGHEST' value='483'/>
      <enumerator name='BFD_RELOC_PPC64_HIGHEST_S' value='484'/>
      <enumerator name='BFD_RELOC_PPC64_TOC16_LO' value='485'/>
      <enumerator name='BFD_RELOC_PPC64_TOC16_HI' value='486'/>
      <enumerator name='BFD_RELOC_PPC64_TOC16_HA' value='487'/>
      <enumerator name='BFD_RELOC_PPC64_TOC' value='488'/>
      <enumerator name='BFD_RELOC_PPC64_PLTGOT16' value='489'/>
      <enumerator name='BFD_RELOC_PPC64_PLTGOT16_LO' value='490'/>
      <enumerator name='BFD_RELOC_PPC64_PLTGOT16_HI' value='491'/>
      <enumerator name='BFD_RELOC_PPC64_PLTGOT16_HA' value='492'/>
      <enumerator name='BFD_RELOC_PPC64_ADDR16_DS' value='493'/>
      <enumerator name='BFD_RELOC_PPC64_ADDR16_LO_DS' value='494'/>
      <enumerator name='BFD_RELOC_PPC64_GOT16_DS' value='495'/>
      <enumerator name='BFD_RELOC_PPC64_GOT16_LO_DS' value='496'/>
      <enumerator name='BFD_RELOC_PPC64_PLT16_LO_DS' value='497'/>
      <enumerator name='BFD_RELOC_PPC64_SECTOFF_DS' value='498'/>
      <enumerator name='BFD_RELOC_PPC64_SECTOFF_LO_DS' value='499'/>
      <enumerator name='BFD_RELOC_PPC64_TOC16_DS' value='500'/>
      <enumerator name='BFD_RELOC_PPC64_TOC16_LO_DS' value='501'/>
      <enumerator name='BFD_RELOC_PPC64_PLTGOT16_DS' value='502'/>
      <enumerator name='BFD_RELOC_PPC64_PLTGOT16_LO_DS' value='503'/>
      <enumerator name='BFD_RELOC_PPC64_ADDR16_HIGH' value='504'/>
      <enumerator name='BFD_RELOC_PPC64_ADDR16_HIGHA' value='505'/>
      <enumerator name='BFD_RELOC_PPC64_REL16_HIGH' value='506'/>
      <enumerator name='BFD_RELOC_PPC64_REL16_HIGHA' value='507'/>
      <enumerator name='BFD_RELOC_PPC64_REL16_HIGHER' value='508'/>
      <enumerator name='BFD_RELOC_PPC64_REL16_HIGHERA' value='509'/>
      <enumerator name='BFD_RELOC_PPC64_REL16_HIGHEST' value='510'/>
      <enumerator name='BFD_RELOC_PPC64_REL16_HIGHESTA' value='511'/>
      <enumerator name='BFD_RELOC_PPC64_ADDR64_LOCAL' value='512'/>
      <enumerator name='BFD_RELOC_PPC64_ENTRY' value='513'/>
      <enumerator name='BFD_RELOC_PPC64_REL24_NOTOC' value='514'/>
      <enumerator name='BFD_RELOC_PPC64_D34' value='515'/>
      <enumerator name='BFD_RELOC_PPC64_D34_LO' value='516'/>
      <enumerator name='BFD_RELOC_PPC64_D34_HI30' value='517'/>
      <enumerator name='BFD_RELOC_PPC64_D34_HA30' value='518'/>
      <enumerator name='BFD_RELOC_PPC64_PCREL34' value='519'/>
      <enumerator name='BFD_RELOC_PPC64_GOT_PCREL34' value='520'/>
      <enumerator name='BFD_RELOC_PPC64_PLT_PCREL34' value='521'/>
      <enumerator name='BFD_RELOC_PPC64_ADDR16_HIGHER34' value='522'/>
      <enumerator name='BFD_RELOC_PPC64_ADDR16_HIGHERA34' value='523'/>
      <enumerator name='BFD_RELOC_PPC64_ADDR16_HIGHEST34' value='524'/>
      <enumerator name='BFD_RELOC_PPC64_ADDR16_HIGHESTA34' value='525'/>
      <enumerator name='BFD_RELOC_PPC64_REL16_HIGHER34' value='526'/>
      <enumerator name='BFD_RELOC_PPC64_REL16_HIGHERA34' value='527'/>
      <enumerator name='BFD_RELOC_PPC64_REL16_HIGHEST34' value='528'/>
      <enumerator name='BFD_RELOC_PPC64_REL16_HIGHESTA34' value='529'/>
      <enumerator name='BFD_RELOC_PPC64_D28' value='530'/>
      <enumerator name='BFD_RELOC_PPC64_PCREL28' value='531'/>
      <enumerator name='BFD_RELOC_PPC_TLS' value='532'/>
      <enumerator name='BFD_RELOC_PPC_TLSGD' value='533'/>
      <enumerator name='BFD_RELOC_PPC_TLSLD' value='534'/>
      <enumerator name='BFD_RELOC_PPC_DTPMOD' value='535'/>
      <enumerator name='BFD_RELOC_PPC_TPREL16' value='536'/>
      <enumerator name='BFD_RELOC_PPC_TPREL16_LO' value='537'/>
      <enumerator name='BFD_RELOC_PPC_TPREL16_HI' value='538'/>
      <enumerator name='BFD_RELOC_PPC_TPREL16_HA' value='539'/>
      <enumerator name='BFD_RELOC_PPC_TPREL' value='540'/>
      <enumerator name='BFD_RELOC_PPC_DTPREL16' value='541'/>
      <enumerator name='BFD_RELOC_PPC_DTPREL16_LO' value='542'/>
      <enumerator name='BFD_RELOC_PPC_DTPREL16_HI' value='543'/>
      <enumerator name='BFD_RELOC_PPC_DTPREL16_HA' value='544'/>
      <enumerator name='BFD_RELOC_PPC_DTPREL' value='545'/>
      <enumerator name='BFD_RELOC_PPC_GOT_TLSGD16' value='546'/>
      <enumerator name='BFD_RELOC_PPC_GOT_TLSGD16_LO' value='547'/>
      <enumerator name='BFD_RELOC_PPC_GOT_TLSGD16_HI' value='548'/>
      <enumerator name='BFD_RELOC_PPC_GOT_TLSGD16_HA' value='549'/>
      <enumerator name='BFD_RELOC_PPC_GOT_TLSLD16' value='550'/>
      <enumerator name='BFD_RELOC_PPC_GOT_TLSLD16_LO' value='551'/>
      <enumerator name='BFD_RELOC_PPC_GOT_TLSLD16_HI' value='552'/>
      <enumerator name='BFD_RELOC_PPC_GOT_TLSLD16_HA' value='553'/>
      <enumerator name='BFD_RELOC_PPC_GOT_TPREL16' value='554'/>
      <enumerator name='BFD_RELOC_PPC_GOT_TPREL16_LO' value='555'/>
      <enumerator name='BFD_RELOC_PPC_GOT_TPREL16_HI' value='556'/>
      <enumerator name='BFD_RELOC_PPC_GOT_TPREL16_HA' value='557'/>
      <enumerator name='BFD_RELOC_PPC_GOT_DTPREL16' value='558'/>
      <enumerator name='BFD_RELOC_PPC_GOT_DTPREL16_LO' value='559'/>
      <enumerator name='BFD_RELOC_PPC_GOT_DTPREL16_HI' value='560'/>
      <enumerator name='BFD_RELOC_PPC_GOT_DTPREL16_HA' value='561'/>
      <enumerator name='BFD_RELOC_PPC64_TPREL16_DS' value='562'/>
      <enumerator name='BFD_RELOC_PPC64_TPREL16_LO_DS' value='563'/>
      <enumerator name='BFD_RELOC_PPC64_TPREL16_HIGH' value='564'/>
      <enumerator name='BFD_RELOC_PPC64_TPREL16_HIGHA' value='565'/>
      <enumerator name='BFD_RELOC_PPC64_TPREL16_HIGHER' value='566'/>
      <enumerator name='BFD_RELOC_PPC64_TPREL16_HIGHERA' value='567'/>
      <enumerator name='BFD_RELOC_PPC64_TPREL16_HIGHEST' value='568'/>
      <enumerator name='BFD_RELOC_PPC64_TPREL16_HIGHESTA' value='569'/>
      <enumerator name='BFD_RELOC_PPC64_DTPREL16_DS' value='570'/>
      <enumerator name='BFD_RELOC_PPC64_DTPREL16_LO_DS' value='571'/>
      <enumerator name='BFD_RELOC_PPC64_DTPREL16_HIGH' value='572'/>
      <enumerator name='BFD_RELOC_PPC64_DTPREL16_HIGHA' value='573'/>
      <enumerator name='BFD_RELOC_PPC64_DTPREL16_HIGHER' value='574'/>
      <enumerator name='BFD_RELOC_PPC64_DTPREL16_HIGHERA' value='575'/>
      <enumerator name='BFD_RELOC_PPC64_DTPREL16_HIGHEST' value='576'/>
      <enumerator name='BFD_RELOC_PPC64_DTPREL16_HIGHESTA' value='577'/>
      <enumerator name='BFD_RELOC_PPC64_TPREL34' value='578'/>
      <enumerator name='BFD_RELOC_PPC64_DTPREL34' value='579'/>
      <enumerator name='BFD_RELOC_PPC64_GOT_TLSGD_PCREL34' value='580'/>
      <enumerator name='BFD_RELOC_PPC64_GOT_TLSLD_PCREL34' value='581'/>
      <enumerator name='BFD_RELOC_PPC64_GOT_TPREL_PCREL34' value='582'/>
      <enumerator name='BFD_RELOC_PPC64_GOT_DTPREL_PCREL34' value='583'/>
      <enumerator name='BFD_RELOC_PPC64_TLS_PCREL' value='584'/>
      <enumerator name='BFD_RELOC_I370_D12' value='585'/>
      <enumerator name='BFD_RELOC_CTOR' value='586'/>
      <enumerator name='BFD_RELOC_ARM_PCREL_BRANCH' value='587'/>
      <enumerator name='BFD_RELOC_ARM_PCREL_BLX' value='588'/>
      <enumerator name='BFD_RELOC_THUMB_PCREL_BLX' value='589'/>
      <enumerator name='BFD_RELOC_ARM_PCREL_CALL' value='590'/>
      <enumerator name='BFD_RELOC_ARM_PCREL_JUMP' value='591'/>
      <enumerator name='BFD_RELOC_THUMB_PCREL_BRANCH5' value='592'/>
      <enumerator name='BFD_RELOC_THUMB_PCREL_BFCSEL' value='593'/>
      <enumerator name='BFD_RELOC_ARM_THUMB_BF17' value='594'/>
      <enumerator name='BFD_RELOC_ARM_THUMB_BF13' value='595'/>
      <enumerator name='BFD_RELOC_ARM_THUMB_BF19' value='596'/>
      <enumerator name='BFD_RELOC_ARM_THUMB_LOOP12' value='597'/>
      <enumerator name='BFD_RELOC_THUMB_PCREL_BRANCH7' value='598'/>
      <enumerator name='BFD_RELOC_THUMB_PCREL_BRANCH9' value='599'/>
      <enumerator name='BFD_RELOC_THUMB_PCREL_BRANCH12' value='600'/>
      <enumerator name='BFD_RELOC_THUMB_PCREL_BRANCH20' value='601'/>
      <enumerator name='BFD_RELOC_THUMB_PCREL_BRANCH23' value='602'/>
      <enumerator name='BFD_RELOC_THUMB_PCREL_BRANCH25' value='603'/>
      <enumerator name='BFD_RELOC_ARM_OFFSET_IMM' value='604'/>
      <enumerator name='BFD_RELOC_ARM_THUMB_OFFSET' value='605'/>
      <enumerator name='BFD_RELOC_ARM_TARGET1' value='606'/>
      <enumerator name='BFD_RELOC_ARM_ROSEGREL32' value='607'/>
      <enumerator name='BFD_RELOC_ARM_SBREL32' value='608'/>
      <enumerator name='BFD_RELOC_ARM_TARGET2' value='609'/>
      <enumerator name='BFD_RELOC_ARM_PREL31' value='610'/>
      <enumerator name='BFD_RELOC_ARM_MOVW' value='611'/>
      <enumerator name='BFD_RELOC_ARM_MOVT' value='612'/>
      <enumerator name='BFD_RELOC_ARM_MOVW_PCREL' value='613'/>
      <enumerator name='BFD_RELOC_ARM_MOVT_PCREL' value='614'/>
      <enumerator name='BFD_RELOC_ARM_THUMB_MOVW' value='615'/>
      <enumerator name='BFD_RELOC_ARM_THUMB_MOVT' value='616'/>
      <enumerator name='BFD_RELOC_ARM_THUMB_MOVW_PCREL' value='617'/>
      <enumerator name='BFD_RELOC_ARM_THUMB_MOVT_PCREL' value='618'/>
      <enumerator name='BFD_RELOC_ARM_GOTFUNCDESC' value='619'/>
      <enumerator name='BFD_RELOC_ARM_GOTOFFFUNCDESC' value='620'/>
      <enumerator name='BFD_RELOC_ARM_FUNCDESC' value='621'/>
      <enumerator name='BFD_RELOC_ARM_FUNCDESC_VALUE' value='622'/>
      <enumerator name='BFD_RELOC_ARM_TLS_GD32_FDPIC' value='623'/>
      <enumerator name='BFD_RELOC_ARM_TLS_LDM32_FDPIC' value='624'/>
      <enumerator name='BFD_RELOC_ARM_TLS_IE32_FDPIC' value='625'/>
      <enumerator name='BFD_RELOC_ARM_JUMP_SLOT' value='626'/>
      <enumerator name='BFD_RELOC_ARM_GLOB_DAT' value='627'/>
      <enumerator name='BFD_RELOC_ARM_GOT32' value='628'/>
      <enumerator name='BFD_RELOC_ARM_PLT32' value='629'/>
      <enumerator name='BFD_RELOC_ARM_RELATIVE' value='630'/>
      <enumerator name='BFD_RELOC_ARM_GOTOFF' value='631'/>
      <enumerator name='BFD_RELOC_ARM_GOTPC' value='632'/>
      <enumerator name='BFD_RELOC_ARM_GOT_PREL' value='633'/>
      <enumerator name='BFD_RELOC_ARM_TLS_GD32' value='634'/>
      <enumerator name='BFD_RELOC_ARM_TLS_LDO32' value='635'/>
      <enumerator name='BFD_RELOC_ARM_TLS_LDM32' value='636'/>
      <enumerator name='BFD_RELOC_ARM_TLS_DTPOFF32' value='637'/>
      <enumerator name='BFD_RELOC_ARM_TLS_DTPMOD32' value='638'/>
      <enumerator name='BFD_RELOC_ARM_TLS_TPOFF32' value='639'/>
      <enumerator name='BFD_RELOC_ARM_TLS_IE32' value='640'/>
      <enumerator name='BFD_RELOC_ARM_TLS_LE32' value='641'/>
      <enumerator name='BFD_RELOC_ARM_TLS_GOTDESC' value='642'/>
      <enumerator name='BFD_RELOC_ARM_TLS_CALL' value='643'/>
      <enumerator name='BFD_RELOC_ARM_THM_TLS_CALL' value='644'/>
      <enumerator name='BFD_RELOC_ARM_TLS_DESCSEQ' value='645'/>
      <enumerator name='BFD_RELOC_ARM_THM_TLS_DESCSEQ' value='646'/>
      <enumerator name='BFD_RELOC_ARM_TLS_DESC' value='647'/>
      <enumerator name='BFD_RELOC_ARM_ALU_PC_G0_NC' value='648'/>
      <enumerator name='BFD_RELOC_ARM_ALU_PC_G0' value='649'/>
      <enumerator name='BFD_RELOC_ARM_ALU_PC_G1_NC' value='650'/>
      <enumerator name='BFD_RELOC_ARM_ALU_PC_G1' value='651'/>
      <enumerator name='BFD_RELOC_ARM_ALU_PC_G2' value='652'/>
      <enumerator name='BFD_RELOC_ARM_LDR_PC_G0' value='653'/>
      <enumerator name='BFD_RELOC_ARM_LDR_PC_G1' value='654'/>
      <enumerator name='BFD_RELOC_ARM_LDR_PC_G2' value='655'/>
      <enumerator name='BFD_RELOC_ARM_LDRS_PC_G0' value='656'/>
      <enumerator name='BFD_RELOC_ARM_LDRS_PC_G1' value='657'/>
      <enumerator name='BFD_RELOC_ARM_LDRS_PC_G2' value='658'/>
      <enumerator name='BFD_RELOC_ARM_LDC_PC_G0' value='659'/>
      <enumerator name='BFD_RELOC_ARM_LDC_PC_G1' value='660'/>
      <enumerator name='BFD_RELOC_ARM_LDC_PC_G2' value='661'/>
      <enumerator name='BFD_RELOC_ARM_ALU_SB_G0_NC' value='662'/>
      <enumerator name='BFD_RELOC_ARM_ALU_SB_G0' value='663'/>
      <enumerator name='BFD_RELOC_ARM_ALU_SB_G1_NC' value='664'/>
      <enumerator name='BFD_RELOC_ARM_ALU_SB_G1' value='665'/>
      <enumerator name='BFD_RELOC_ARM_ALU_SB_G2' value='666'/>
      <enumerator name='BFD_RELOC_ARM_LDR_SB_G0' value='667'/>
      <enumerator name='BFD_RELOC_ARM_LDR_SB_G1' value='668'/>
      <enumerator name='BFD_RELOC_ARM_LDR_SB_G2' value='669'/>
      <enumerator name='BFD_RELOC_ARM_LDRS_SB_G0' value='670'/>
      <enumerator name='BFD_RELOC_ARM_LDRS_SB_G1' value='671'/>
      <enumerator name='BFD_RELOC_ARM_LDRS_SB_G2' value='672'/>
      <enumerator name='BFD_RELOC_ARM_LDC_SB_G0' value='673'/>
      <enumerator name='BFD_RELOC_ARM_LDC_SB_G1' value='674'/>
      <enumerator name='BFD_RELOC_ARM_LDC_SB_G2' value='675'/>
      <enumerator name='BFD_RELOC_ARM_V4BX' value='676'/>
      <enumerator name='BFD_RELOC_ARM_IRELATIVE' value='677'/>
      <enumerator name='BFD_RELOC_ARM_THUMB_ALU_ABS_G0_NC' value='678'/>
      <enumerator name='BFD_RELOC_ARM_THUMB_ALU_ABS_G1_NC' value='679'/>
      <enumerator name='BFD_RELOC_ARM_THUMB_ALU_ABS_G2_NC' value='680'/>
      <enumerator name='BFD_RELOC_ARM_THUMB_ALU_ABS_G3_NC' value='681'/>
      <enumerator name='BFD_RELOC_ARM_IMMEDIATE' value='682'/>
      <enumerator name='BFD_RELOC_ARM_ADRL_IMMEDIATE' value='683'/>
      <enumerator name='BFD_RELOC_ARM_T32_IMMEDIATE' value='684'/>
      <enumerator name='BFD_RELOC_ARM_T32_ADD_IMM' value='685'/>
      <enumerator name='BFD_RELOC_ARM_T32_IMM12' value='686'/>
      <enumerator name='BFD_RELOC_ARM_T32_ADD_PC12' value='687'/>
      <enumerator name='BFD_RELOC_ARM_SHIFT_IMM' value='688'/>
      <enumerator name='BFD_RELOC_ARM_SMC' value='689'/>
      <enumerator name='BFD_RELOC_ARM_HVC' value='690'/>
      <enumerator name='BFD_RELOC_ARM_SWI' value='691'/>
      <enumerator name='BFD_RELOC_ARM_MULTI' value='692'/>
      <enumerator name='BFD_RELOC_ARM_CP_OFF_IMM' value='693'/>
      <enumerator name='BFD_RELOC_ARM_CP_OFF_IMM_S2' value='694'/>
      <enumerator name='BFD_RELOC_ARM_T32_CP_OFF_IMM' value='695'/>
      <enumerator name='BFD_RELOC_ARM_T32_CP_OFF_IMM_S2' value='696'/>
      <enumerator name='BFD_RELOC_ARM_T32_VLDR_VSTR_OFF_IMM' value='697'/>
      <enumerator name='BFD_RELOC_ARM_ADR_IMM' value='698'/>
      <enumerator name='BFD_RELOC_ARM_LDR_IMM' value='699'/>
      <enumerator name='BFD_RELOC_ARM_LITERAL' value='700'/>
      <enumerator name='BFD_RELOC_ARM_IN_POOL' value='701'/>
      <enumerator name='BFD_RELOC_ARM_OFFSET_IMM8' value='702'/>
      <enumerator name='BFD_RELOC_ARM_T32_OFFSET_U8' value='703'/>
      <enumerator name='BFD_RELOC_ARM_T32_OFFSET_IMM' value='704'/>
      <enumerator name='BFD_RELOC_ARM_HWLITERAL' value='705'/>
      <enumerator name='BFD_RELOC_ARM_THUMB_ADD' value='706'/>
      <enumerator name='BFD_RELOC_ARM_THUMB_IMM' value='707'/>
      <enumerator name='BFD_RELOC_ARM_THUMB_SHIFT' value='708'/>
      <enumerator name='BFD_RELOC_SH_PCDISP8BY2' value='709'/>
      <enumerator name='BFD_RELOC_SH_PCDISP12BY2' value='710'/>
      <enumerator name='BFD_RELOC_SH_IMM3' value='711'/>
      <enumerator name='BFD_RELOC_SH_IMM3U' value='712'/>
      <enumerator name='BFD_RELOC_SH_DISP12' value='713'/>
      <enumerator name='BFD_RELOC_SH_DISP12BY2' value='714'/>
      <enumerator name='BFD_RELOC_SH_DISP12BY4' value='715'/>
      <enumerator name='BFD_RELOC_SH_DISP12BY8' value='716'/>
      <enumerator name='BFD_RELOC_SH_DISP20' value='717'/>
      <enumerator name='BFD_RELOC_SH_DISP20BY8' value='718'/>
      <enumerator name='BFD_RELOC_SH_IMM4' value='719'/>
      <enumerator name='BFD_RELOC_SH_IMM4BY2' value='720'/>
      <enumerator name='BFD_RELOC_SH_IMM4BY4' value='721'/>
      <enumerator name='BFD_RELOC_SH_IMM8' value='722'/>
      <enumerator name='BFD_RELOC_SH_IMM8BY2' value='723'/>
      <enumerator name='BFD_RELOC_SH_IMM8BY4' value='724'/>
      <enumerator name='BFD_RELOC_SH_PCRELIMM8BY2' value='725'/>
      <enumerator name='BFD_RELOC_SH_PCRELIMM8BY4' value='726'/>
      <enumerator name='BFD_RELOC_SH_SWITCH16' value='727'/>
      <enumerator name='BFD_RELOC_SH_SWITCH32' value='728'/>
      <enumerator name='BFD_RELOC_SH_USES' value='729'/>
      <enumerator name='BFD_RELOC_SH_COUNT' value='730'/>
      <enumerator name='BFD_RELOC_SH_ALIGN' value='731'/>
      <enumerator name='BFD_RELOC_SH_CODE' value='732'/>
      <enumerator name='BFD_RELOC_SH_DATA' value='733'/>
      <enumerator name='BFD_RELOC_SH_LABEL' value='734'/>
      <enumerator name='BFD_RELOC_SH_LOOP_START' value='735'/>
      <enumerator name='BFD_RELOC_SH_LOOP_END' value='736'/>
      <enumerator name='BFD_RELOC_SH_COPY' value='737'/>
      <enumerator name='BFD_RELOC_SH_GLOB_DAT' value='738'/>
      <enumerator name='BFD_RELOC_SH_JMP_SLOT' value='739'/>
      <enumerator name='BFD_RELOC_SH_RELATIVE' value='740'/>
      <enumerator name='BFD_RELOC_SH_GOTPC' value='741'/>
      <enumerator name='BFD_RELOC_SH_GOT_LOW16' value='742'/>
      <enumerator name='BFD_RELOC_SH_GOT_MEDLOW16' value='743'/>
      <enumerator name='BFD_RELOC_SH_GOT_MEDHI16' value='744'/>
      <enumerator name='BFD_RELOC_SH_GOT_HI16' value='745'/>
      <enumerator name='BFD_RELOC_SH_GOTPLT_LOW16' value='746'/>
      <enumerator name='BFD_RELOC_SH_GOTPLT_MEDLOW16' value='747'/>
      <enumerator name='BFD_RELOC_SH_GOTPLT_MEDHI16' value='748'/>
      <enumerator name='BFD_RELOC_SH_GOTPLT_HI16' value='749'/>
      <enumerator name='BFD_RELOC_SH_PLT_LOW16' value='750'/>
      <enumerator name='BFD_RELOC_SH_PLT_MEDLOW16' value='751'/>
      <enumerator name='BFD_RELOC_SH_PLT_MEDHI16' value='752'/>
      <enumerator name='BFD_RELOC_SH_PLT_HI16' value='753'/>
      <enumerator name='BFD_RELOC_SH_GOTOFF_LOW16' value='754'/>
      <enumerator name='BFD_RELOC_SH_GOTOFF_MEDLOW16' value='755'/>
      <enumerator name='BFD_RELOC_SH_GOTOFF_MEDHI16' value='756'/>
      <enumerator name='BFD_RELOC_SH_GOTOFF_HI16' value='757'/>
      <enumerator name='BFD_RELOC_SH_GOTPC_LOW16' value='758'/>
      <enumerator name='BFD_RELOC_SH_GOTPC_MEDLOW16' value='759'/>
      <enumerator name='BFD_RELOC_SH_GOTPC_MEDHI16' value='760'/>
      <enumerator name='BFD_RELOC_SH_GOTPC_HI16' value='761'/>
      <enumerator name='BFD_RELOC_SH_COPY64' value='762'/>
      <enumerator name='BFD_RELOC_SH_GLOB_DAT64' value='763'/>
      <enumerator name='BFD_RELOC_SH_JMP_SLOT64' value='764'/>
      <enumerator name='BFD_RELOC_SH_RELATIVE64' value='765'/>
      <enumerator name='BFD_RELOC_SH_GOT10BY4' value='766'/>
      <enumerator name='BFD_RELOC_SH_GOT10BY8' value='767'/>
      <enumerator name='BFD_RELOC_SH_GOTPLT10BY4' value='768'/>
      <enumerator name='BFD_RELOC_SH_GOTPLT10BY8' value='769'/>
      <enumerator name='BFD_RELOC_SH_GOTPLT32' value='770'/>
      <enumerator name='BFD_RELOC_SH_SHMEDIA_CODE' value='771'/>
      <enumerator name='BFD_RELOC_SH_IMMU5' value='772'/>
      <enumerator name='BFD_RELOC_SH_IMMS6' value='773'/>
      <enumerator name='BFD_RELOC_SH_IMMS6BY32' value='774'/>
      <enumerator name='BFD_RELOC_SH_IMMU6' value='775'/>
      <enumerator name='BFD_RELOC_SH_IMMS10' value='776'/>
      <enumerator name='BFD_RELOC_SH_IMMS10BY2' value='777'/>
      <enumerator name='BFD_RELOC_SH_IMMS10BY4' value='778'/>
      <enumerator name='BFD_RELOC_SH_IMMS10BY8' value='779'/>
      <enumerator name='BFD_RELOC_SH_IMMS16' value='780'/>
      <enumerator name='BFD_RELOC_SH_IMMU16' value='781'/>
      <enumerator name='BFD_RELOC_SH_IMM_LOW16' value='782'/>
      <enumerator name='BFD_RELOC_SH_IMM_LOW16_PCREL' value='783'/>
      <enumerator name='BFD_RELOC_SH_IMM_MEDLOW16' value='784'/>
      <enumerator name='BFD_RELOC_SH_IMM_MEDLOW16_PCREL' value='785'/>
      <enumerator name='BFD_RELOC_SH_IMM_MEDHI16' value='786'/>
      <enumerator name='BFD_RELOC_SH_IMM_MEDHI16_PCREL' value='787'/>
      <enumerator name='BFD_RELOC_SH_IMM_HI16' value='788'/>
      <enumerator name='BFD_RELOC_SH_IMM_HI16_PCREL' value='789'/>
      <enumerator name='BFD_RELOC_SH_PT_16' value='790'/>
      <enumerator name='BFD_RELOC_SH_TLS_GD_32' value='791'/>
      <enumerator name='BFD_RELOC_SH_TLS_LD_32' value='792'/>
      <enumerator name='BFD_RELOC_SH_TLS_LDO_32' value='793'/>
      <enumerator name='BFD_RELOC_SH_TLS_IE_32' value='794'/>
      <enumerator name='BFD_RELOC_SH_TLS_LE_32' value='795'/>
      <enumerator name='BFD_RELOC_SH_TLS_DTPMOD32' value='796'/>
      <enumerator name='BFD_RELOC_SH_TLS_DTPOFF32' value='797'/>
      <enumerator name='BFD_RELOC_SH_TLS_TPOFF32' value='798'/>
      <enumerator name='BFD_RELOC_SH_GOT20' value='799'/>
      <enumerator name='BFD_RELOC_SH_GOTOFF20' value='800'/>
      <enumerator name='BFD_RELOC_SH_GOTFUNCDESC' value='801'/>
      <enumerator name='BFD_RELOC_SH_GOTFUNCDESC20' value='802'/>
      <enumerator name='BFD_RELOC_SH_GOTOFFFUNCDESC' value='803'/>
      <enumerator name='BFD_RELOC_SH_GOTOFFFUNCDESC20' value='804'/>
      <enumerator name='BFD_RELOC_SH_FUNCDESC' value='805'/>
      <enumerator name='BFD_RELOC_ARC_NONE' value='806'/>
      <enumerator name='BFD_RELOC_ARC_8' value='807'/>
      <enumerator name='BFD_RELOC_ARC_16' value='808'/>
      <enumerator name='BFD_RELOC_ARC_24' value='809'/>
      <enumerator name='BFD_RELOC_ARC_32' value='810'/>
      <enumerator name='BFD_RELOC_ARC_N8' value='811'/>
      <enumerator name='BFD_RELOC_ARC_N16' value='812'/>
      <enumerator name='BFD_RELOC_ARC_N24' value='813'/>
      <enumerator name='BFD_RELOC_ARC_N32' value='814'/>
      <enumerator name='BFD_RELOC_ARC_SDA' value='815'/>
      <enumerator name='BFD_RELOC_ARC_SECTOFF' value='816'/>
      <enumerator name='BFD_RELOC_ARC_S21H_PCREL' value='817'/>
      <enumerator name='BFD_RELOC_ARC_S21W_PCREL' value='818'/>
      <enumerator name='BFD_RELOC_ARC_S25H_PCREL' value='819'/>
      <enumerator name='BFD_RELOC_ARC_S25W_PCREL' value='820'/>
      <enumerator name='BFD_RELOC_ARC_SDA32' value='821'/>
      <enumerator name='BFD_RELOC_ARC_SDA_LDST' value='822'/>
      <enumerator name='BFD_RELOC_ARC_SDA_LDST1' value='823'/>
      <enumerator name='BFD_RELOC_ARC_SDA_LDST2' value='824'/>
      <enumerator name='BFD_RELOC_ARC_SDA16_LD' value='825'/>
      <enumerator name='BFD_RELOC_ARC_SDA16_LD1' value='826'/>
      <enumerator name='BFD_RELOC_ARC_SDA16_LD2' value='827'/>
      <enumerator name='BFD_RELOC_ARC_S13_PCREL' value='828'/>
      <enumerator name='BFD_RELOC_ARC_W' value='829'/>
      <enumerator name='BFD_RELOC_ARC_32_ME' value='830'/>
      <enumerator name='BFD_RELOC_ARC_32_ME_S' value='831'/>
      <enumerator name='BFD_RELOC_ARC_N32_ME' value='832'/>
      <enumerator name='BFD_RELOC_ARC_SECTOFF_ME' value='833'/>
      <enumerator name='BFD_RELOC_ARC_SDA32_ME' value='834'/>
      <enumerator name='BFD_RELOC_ARC_W_ME' value='835'/>
      <enumerator name='BFD_RELOC_AC_SECTOFF_U8' value='836'/>
      <enumerator name='BFD_RELOC_AC_SECTOFF_U8_1' value='837'/>
      <enumerator name='BFD_RELOC_AC_SECTOFF_U8_2' value='838'/>
      <enumerator name='BFD_RELOC_AC_SECTOFF_S9' value='839'/>
      <enumerator name='BFD_RELOC_AC_SECTOFF_S9_1' value='840'/>
      <enumerator name='BFD_RELOC_AC_SECTOFF_S9_2' value='841'/>
      <enumerator name='BFD_RELOC_ARC_SECTOFF_ME_1' value='842'/>
      <enumerator name='BFD_RELOC_ARC_SECTOFF_ME_2' value='843'/>
      <enumerator name='BFD_RELOC_ARC_SECTOFF_1' value='844'/>
      <enumerator name='BFD_RELOC_ARC_SECTOFF_2' value='845'/>
      <enumerator name='BFD_RELOC_ARC_SDA_12' value='846'/>
      <enumerator name='BFD_RELOC_ARC_SDA16_ST2' value='847'/>
      <enumerator name='BFD_RELOC_ARC_32_PCREL' value='848'/>
      <enumerator name='BFD_RELOC_ARC_PC32' value='849'/>
      <enumerator name='BFD_RELOC_ARC_GOT32' value='850'/>
      <enumerator name='BFD_RELOC_ARC_GOTPC32' value='851'/>
      <enumerator name='BFD_RELOC_ARC_PLT32' value='852'/>
      <enumerator name='BFD_RELOC_ARC_COPY' value='853'/>
      <enumerator name='BFD_RELOC_ARC_GLOB_DAT' value='854'/>
      <enumerator name='BFD_RELOC_ARC_JMP_SLOT' value='855'/>
      <enumerator name='BFD_RELOC_ARC_RELATIVE' value='856'/>
      <enumerator name='BFD_RELOC_ARC_GOTOFF' value='857'/>
      <enumerator name='BFD_RELOC_ARC_GOTPC' value='858'/>
      <enumerator name='BFD_RELOC_ARC_S21W_PCREL_PLT' value='859'/>
      <enumerator name='BFD_RELOC_ARC_S25H_PCREL_PLT' value='860'/>
      <enumerator name='BFD_RELOC_ARC_TLS_DTPMOD' value='861'/>
      <enumerator name='BFD_RELOC_ARC_TLS_TPOFF' value='862'/>
      <enumerator name='BFD_RELOC_ARC_TLS_GD_GOT' value='863'/>
      <enumerator name='BFD_RELOC_ARC_TLS_GD_LD' value='864'/>
      <enumerator name='BFD_RELOC_ARC_TLS_GD_CALL' value='865'/>
      <enumerator name='BFD_RELOC_ARC_TLS_IE_GOT' value='866'/>
      <enumerator name='BFD_RELOC_ARC_TLS_DTPOFF' value='867'/>
      <enumerator name='BFD_RELOC_ARC_TLS_DTPOFF_S9' value='868'/>
      <enumerator name='BFD_RELOC_ARC_TLS_LE_S9' value='869'/>
      <enumerator name='BFD_RELOC_ARC_TLS_LE_32' value='870'/>
      <enumerator name='BFD_RELOC_ARC_S25W_PCREL_PLT' value='871'/>
      <enumerator name='BFD_RELOC_ARC_S21H_PCREL_PLT' value='872'/>
      <enumerator name='BFD_RELOC_ARC_NPS_CMEM16' value='873'/>
      <enumerator name='BFD_RELOC_ARC_JLI_SECTOFF' value='874'/>
      <enumerator name='BFD_RELOC_BFIN_16_IMM' value='875'/>
      <enumerator name='BFD_RELOC_BFIN_16_HIGH' value='876'/>
      <enumerator name='BFD_RELOC_BFIN_4_PCREL' value='877'/>
      <enumerator name='BFD_RELOC_BFIN_5_PCREL' value='878'/>
      <enumerator name='BFD_RELOC_BFIN_16_LOW' value='879'/>
      <enumerator name='BFD_RELOC_BFIN_10_PCREL' value='880'/>
      <enumerator name='BFD_RELOC_BFIN_11_PCREL' value='881'/>
      <enumerator name='BFD_RELOC_BFIN_12_PCREL_JUMP' value='882'/>
      <enumerator name='BFD_RELOC_BFIN_12_PCREL_JUMP_S' value='883'/>
      <enumerator name='BFD_RELOC_BFIN_24_PCREL_CALL_X' value='884'/>
      <enumerator name='BFD_RELOC_BFIN_24_PCREL_JUMP_L' value='885'/>
      <enumerator name='BFD_RELOC_BFIN_GOT17M4' value='886'/>
      <enumerator name='BFD_RELOC_BFIN_GOTHI' value='887'/>
      <enumerator name='BFD_RELOC_BFIN_GOTLO' value='888'/>
      <enumerator name='BFD_RELOC_BFIN_FUNCDESC' value='889'/>
      <enumerator name='BFD_RELOC_BFIN_FUNCDESC_GOT17M4' value='890'/>
      <enumerator name='BFD_RELOC_BFIN_FUNCDESC_GOTHI' value='891'/>
      <enumerator name='BFD_RELOC_BFIN_FUNCDESC_GOTLO' value='892'/>
      <enumerator name='BFD_RELOC_BFIN_FUNCDESC_VALUE' value='893'/>
      <enumerator name='BFD_RELOC_BFIN_FUNCDESC_GOTOFF17M4' value='894'/>
      <enumerator name='BFD_RELOC_BFIN_FUNCDESC_GOTOFFHI' value='895'/>
      <enumerator name='BFD_RELOC_BFIN_FUNCDESC_GOTOFFLO' value='896'/>
      <enumerator name='BFD_RELOC_BFIN_GOTOFF17M4' value='897'/>
      <enumerator name='BFD_RELOC_BFIN_GOTOFFHI' value='898'/>
      <enumerator name='BFD_RELOC_BFIN_GOTOFFLO' value='899'/>
      <enumerator name='BFD_RELOC_BFIN_GOT' value='900'/>
      <enumerator name='BFD_RELOC_BFIN_PLTPC' value='901'/>
      <enumerator name='BFD_ARELOC_BFIN_PUSH' value='902'/>
      <enumerator name='BFD_ARELOC_BFIN_CONST' value='903'/>
      <enumerator name='BFD_ARELOC_BFIN_ADD' value='904'/>
      <enumerator name='BFD_ARELOC_BFIN_SUB' value='905'/>
      <enumerator name='BFD_ARELOC_BFIN_MULT' value='906'/>
      <enumerator name='BFD_ARELOC_BFIN_DIV' value='907'/>
      <enumerator name='BFD_ARELOC_BFIN_MOD' value='908'/>
      <enumerator name='BFD_ARELOC_BFIN_LSHIFT' value='909'/>
      <enumerator name='BFD_ARELOC_BFIN_RSHIFT' value='910'/>
      <enumerator name='BFD_ARELOC_BFIN_AND' value='911'/>
      <enumerator name='BFD_ARELOC_BFIN_OR' value='912'/>
      <enumerator name='BFD_ARELOC_BFIN_XOR' value='913'/>
      <enumerator name='BFD_ARELOC_BFIN_LAND' value='914'/>
      <enumerator name='BFD_ARELOC_BFIN_LOR' value='915'/>
      <enumerator name='BFD_ARELOC_BFIN_LEN' value='916'/>
      <enumerator name='BFD_ARELOC_BFIN_NEG' value='917'/>
      <enumerator name='BFD_ARELOC_BFIN_COMP' value='918'/>
      <enumerator name='BFD_ARELOC_BFIN_PAGE' value='919'/>
      <enumerator name='BFD_ARELOC_BFIN_HWPAGE' value='920'/>
      <enumerator name='BFD_ARELOC_BFIN_ADDR' value='921'/>
      <enumerator name='BFD_RELOC_D10V_10_PCREL_R' value='922'/>
      <enumerator name='BFD_RELOC_D10V_10_PCREL_L' value='923'/>
      <enumerator name='BFD_RELOC_D10V_18' value='924'/>
      <enumerator name='BFD_RELOC_D10V_18_PCREL' value='925'/>
      <enumerator name='BFD_RELOC_D30V_6' value='926'/>
      <enumerator name='BFD_RELOC_D30V_9_PCREL' value='927'/>
      <enumerator name='BFD_RELOC_D30V_9_PCREL_R' value='928'/>
      <enumerator name='BFD_RELOC_D30V_15' value='929'/>
      <enumerator name='BFD_RELOC_D30V_15_PCREL' value='930'/>
      <enumerator name='BFD_RELOC_D30V_15_PCREL_R' value='931'/>
      <enumerator name='BFD_RELOC_D30V_21' value='932'/>
      <enumerator name='BFD_RELOC_D30V_21_PCREL' value='933'/>
      <enumerator name='BFD_RELOC_D30V_21_PCREL_R' value='934'/>
      <enumerator name='BFD_RELOC_D30V_32' value='935'/>
      <enumerator name='BFD_RELOC_D30V_32_PCREL' value='936'/>
      <enumerator name='BFD_RELOC_DLX_HI16_S' value='937'/>
      <enumerator name='BFD_RELOC_DLX_LO16' value='938'/>
      <enumerator name='BFD_RELOC_DLX_JMP26' value='939'/>
      <enumerator name='BFD_RELOC_M32C_HI8' value='940'/>
      <enumerator name='BFD_RELOC_M32C_RL_JUMP' value='941'/>
      <enumerator name='BFD_RELOC_M32C_RL_1ADDR' value='942'/>
      <enumerator name='BFD_RELOC_M32C_RL_2ADDR' value='943'/>
      <enumerator name='BFD_RELOC_M32R_24' value='944'/>
      <enumerator name='BFD_RELOC_M32R_10_PCREL' value='945'/>
      <enumerator name='BFD_RELOC_M32R_18_PCREL' value='946'/>
      <enumerator name='BFD_RELOC_M32R_26_PCREL' value='947'/>
      <enumerator name='BFD_RELOC_M32R_HI16_ULO' value='948'/>
      <enumerator name='BFD_RELOC_M32R_HI16_SLO' value='949'/>
      <enumerator name='BFD_RELOC_M32R_LO16' value='950'/>
      <enumerator name='BFD_RELOC_M32R_SDA16' value='951'/>
      <enumerator name='BFD_RELOC_M32R_GOT24' value='952'/>
      <enumerator name='BFD_RELOC_M32R_26_PLTREL' value='953'/>
      <enumerator name='BFD_RELOC_M32R_COPY' value='954'/>
      <enumerator name='BFD_RELOC_M32R_GLOB_DAT' value='955'/>
      <enumerator name='BFD_RELOC_M32R_JMP_SLOT' value='956'/>
      <enumerator name='BFD_RELOC_M32R_RELATIVE' value='957'/>
      <enumerator name='BFD_RELOC_M32R_GOTOFF' value='958'/>
      <enumerator name='BFD_RELOC_M32R_GOTOFF_HI_ULO' value='959'/>
      <enumerator name='BFD_RELOC_M32R_GOTOFF_HI_SLO' value='960'/>
      <enumerator name='BFD_RELOC_M32R_GOTOFF_LO' value='961'/>
      <enumerator name='BFD_RELOC_M32R_GOTPC24' value='962'/>
      <enumerator name='BFD_RELOC_M32R_GOT16_HI_ULO' value='963'/>
      <enumerator name='BFD_RELOC_M32R_GOT16_HI_SLO' value='964'/>
      <enumerator name='BFD_RELOC_M32R_GOT16_LO' value='965'/>
      <enumerator name='BFD_RELOC_M32R_GOTPC_HI_ULO' value='966'/>
      <enumerator name='BFD_RELOC_M32R_GOTPC_HI_SLO' value='967'/>
      <enumerator name='BFD_RELOC_M32R_GOTPC_LO' value='968'/>
      <enumerator name='BFD_RELOC_NDS32_20' value='969'/>
      <enumerator name='BFD_RELOC_NDS32_9_PCREL' value='970'/>
      <enumerator name='BFD_RELOC_NDS32_WORD_9_PCREL' value='971'/>
      <enumerator name='BFD_RELOC_NDS32_15_PCREL' value='972'/>
      <enumerator name='BFD_RELOC_NDS32_17_PCREL' value='973'/>
      <enumerator name='BFD_RELOC_NDS32_25_PCREL' value='974'/>
      <enumerator name='BFD_RELOC_NDS32_HI20' value='975'/>
      <enumerator name='BFD_RELOC_NDS32_LO12S3' value='976'/>
      <enumerator name='BFD_RELOC_NDS32_LO12S2' value='977'/>
      <enumerator name='BFD_RELOC_NDS32_LO12S1' value='978'/>
      <enumerator name='BFD_RELOC_NDS32_LO12S0' value='979'/>
      <enumerator name='BFD_RELOC_NDS32_LO12S0_ORI' value='980'/>
      <enumerator name='BFD_RELOC_NDS32_SDA15S3' value='981'/>
      <enumerator name='BFD_RELOC_NDS32_SDA15S2' value='982'/>
      <enumerator name='BFD_RELOC_NDS32_SDA15S1' value='983'/>
      <enumerator name='BFD_RELOC_NDS32_SDA15S0' value='984'/>
      <enumerator name='BFD_RELOC_NDS32_SDA16S3' value='985'/>
      <enumerator name='BFD_RELOC_NDS32_SDA17S2' value='986'/>
      <enumerator name='BFD_RELOC_NDS32_SDA18S1' value='987'/>
      <enumerator name='BFD_RELOC_NDS32_SDA19S0' value='988'/>
      <enumerator name='BFD_RELOC_NDS32_GOT20' value='989'/>
      <enumerator name='BFD_RELOC_NDS32_9_PLTREL' value='990'/>
      <enumerator name='BFD_RELOC_NDS32_25_PLTREL' value='991'/>
      <enumerator name='BFD_RELOC_NDS32_COPY' value='992'/>
      <enumerator name='BFD_RELOC_NDS32_GLOB_DAT' value='993'/>
      <enumerator name='BFD_RELOC_NDS32_JMP_SLOT' value='994'/>
      <enumerator name='BFD_RELOC_NDS32_RELATIVE' value='995'/>
      <enumerator name='BFD_RELOC_NDS32_GOTOFF' value='996'/>
      <enumerator name='BFD_RELOC_NDS32_GOTOFF_HI20' value='997'/>
      <enumerator name='BFD_RELOC_NDS32_GOTOFF_LO12' value='998'/>
      <enumerator name='BFD_RELOC_NDS32_GOTPC20' value='999'/>
      <enumerator name='BFD_RELOC_NDS32_GOT_HI20' value='1000'/>
      <enumerator name='BFD_RELOC_NDS32_GOT_LO12' value='1001'/>
      <enumerator name='BFD_RELOC_NDS32_GOTPC_HI20' value='1002'/>
      <enumerator name='BFD_RELOC_NDS32_GOTPC_LO12' value='1003'/>
      <enumerator name='BFD_RELOC_NDS32_INSN16' value='1004'/>
      <enumerator name='BFD_RELOC_NDS32_LABEL' value='1005'/>
      <enumerator name='BFD_RELOC_NDS32_LONGCALL1' value='1006'/>
      <enumerator name='BFD_RELOC_NDS32_LONGCALL2' value='1007'/>
      <enumerator name='BFD_RELOC_NDS32_LONGCALL3' value='1008'/>
      <enumerator name='BFD_RELOC_NDS32_LONGJUMP1' value='1009'/>
      <enumerator name='BFD_RELOC_NDS32_LONGJUMP2' value='1010'/>
      <enumerator name='BFD_RELOC_NDS32_LONGJUMP3' value='1011'/>
      <enumerator name='BFD_RELOC_NDS32_LOADSTORE' value='1012'/>
      <enumerator name='BFD_RELOC_NDS32_9_FIXED' value='1013'/>
      <enumerator name='BFD_RELOC_NDS32_15_FIXED' value='1014'/>
      <enumerator name='BFD_RELOC_NDS32_17_FIXED' value='1015'/>
      <enumerator name='BFD_RELOC_NDS32_25_FIXED' value='1016'/>
      <enumerator name='BFD_RELOC_NDS32_LONGCALL4' value='1017'/>
      <enumerator name='BFD_RELOC_NDS32_LONGCALL5' value='1018'/>
      <enumerator name='BFD_RELOC_NDS32_LONGCALL6' value='1019'/>
      <enumerator name='BFD_RELOC_NDS32_LONGJUMP4' value='1020'/>
      <enumerator name='BFD_RELOC_NDS32_LONGJUMP5' value='1021'/>
      <enumerator name='BFD_RELOC_NDS32_LONGJUMP6' value='1022'/>
      <enumerator name='BFD_RELOC_NDS32_LONGJUMP7' value='1023'/>
      <enumerator name='BFD_RELOC_NDS32_PLTREL_HI20' value='1024'/>
      <enumerator name='BFD_RELOC_NDS32_PLTREL_LO12' value='1025'/>
      <enumerator name='BFD_RELOC_NDS32_PLT_GOTREL_HI20' value='1026'/>
      <enumerator name='BFD_RELOC_NDS32_PLT_GOTREL_LO12' value='1027'/>
      <enumerator name='BFD_RELOC_NDS32_SDA12S2_DP' value='1028'/>
      <enumerator name='BFD_RELOC_NDS32_SDA12S2_SP' value='1029'/>
      <enumerator name='BFD_RELOC_NDS32_LO12S2_DP' value='1030'/>
      <enumerator name='BFD_RELOC_NDS32_LO12S2_SP' value='1031'/>
      <enumerator name='BFD_RELOC_NDS32_DWARF2_OP1' value='1032'/>
      <enumerator name='BFD_RELOC_NDS32_DWARF2_OP2' value='1033'/>
      <enumerator name='BFD_RELOC_NDS32_DWARF2_LEB' value='1034'/>
      <enumerator name='BFD_RELOC_NDS32_UPDATE_TA' value='1035'/>
      <enumerator name='BFD_RELOC_NDS32_PLT_GOTREL_LO20' value='1036'/>
      <enumerator name='BFD_RELOC_NDS32_PLT_GOTREL_LO15' value='1037'/>
      <enumerator name='BFD_RELOC_NDS32_PLT_GOTREL_LO19' value='1038'/>
      <enumerator name='BFD_RELOC_NDS32_GOT_LO15' value='1039'/>
      <enumerator name='BFD_RELOC_NDS32_GOT_LO19' value='1040'/>
      <enumerator name='BFD_RELOC_NDS32_GOTOFF_LO15' value='1041'/>
      <enumerator name='BFD_RELOC_NDS32_GOTOFF_LO19' value='1042'/>
      <enumerator name='BFD_RELOC_NDS32_GOT15S2' value='1043'/>
      <enumerator name='BFD_RELOC_NDS32_GOT17S2' value='1044'/>
      <enumerator name='BFD_RELOC_NDS32_5' value='1045'/>
      <enumerator name='BFD_RELOC_NDS32_10_UPCREL' value='1046'/>
      <enumerator name='BFD_RELOC_NDS32_SDA_FP7U2_RELA' value='1047'/>
      <enumerator name='BFD_RELOC_NDS32_RELAX_ENTRY' value='1048'/>
      <enumerator name='BFD_RELOC_NDS32_GOT_SUFF' value='1049'/>
      <enumerator name='BFD_RELOC_NDS32_GOTOFF_SUFF' value='1050'/>
      <enumerator name='BFD_RELOC_NDS32_PLT_GOT_SUFF' value='1051'/>
      <enumerator name='BFD_RELOC_NDS32_MULCALL_SUFF' value='1052'/>
      <enumerator name='BFD_RELOC_NDS32_PTR' value='1053'/>
      <enumerator name='BFD_RELOC_NDS32_PTR_COUNT' value='1054'/>
      <enumerator name='BFD_RELOC_NDS32_PTR_RESOLVED' value='1055'/>
      <enumerator name='BFD_RELOC_NDS32_PLTBLOCK' value='1056'/>
      <enumerator name='BFD_RELOC_NDS32_RELAX_REGION_BEGIN' value='1057'/>
      <enumerator name='BFD_RELOC_NDS32_RELAX_REGION_END' value='1058'/>
      <enumerator name='BFD_RELOC_NDS32_MINUEND' value='1059'/>
      <enumerator name='BFD_RELOC_NDS32_SUBTRAHEND' value='1060'/>
      <enumerator name='BFD_RELOC_NDS32_DIFF8' value='1061'/>
      <enumerator name='BFD_RELOC_NDS32_DIFF16' value='1062'/>
      <enumerator name='BFD_RELOC_NDS32_DIFF32' value='1063'/>
      <enumerator name='BFD_RELOC_NDS32_DIFF_ULEB128' value='1064'/>
      <enumerator name='BFD_RELOC_NDS32_EMPTY' value='1065'/>
      <enumerator name='BFD_RELOC_NDS32_25_ABS' value='1066'/>
      <enumerator name='BFD_RELOC_NDS32_DATA' value='1067'/>
      <enumerator name='BFD_RELOC_NDS32_TRAN' value='1068'/>
      <enumerator name='BFD_RELOC_NDS32_17IFC_PCREL' value='1069'/>
      <enumerator name='BFD_RELOC_NDS32_10IFCU_PCREL' value='1070'/>
      <enumerator name='BFD_RELOC_NDS32_TPOFF' value='1071'/>
      <enumerator name='BFD_RELOC_NDS32_GOTTPOFF' value='1072'/>
      <enumerator name='BFD_RELOC_NDS32_TLS_LE_HI20' value='1073'/>
      <enumerator name='BFD_RELOC_NDS32_TLS_LE_LO12' value='1074'/>
      <enumerator name='BFD_RELOC_NDS32_TLS_LE_20' value='1075'/>
      <enumerator name='BFD_RELOC_NDS32_TLS_LE_15S0' value='1076'/>
      <enumerator name='BFD_RELOC_NDS32_TLS_LE_15S1' value='1077'/>
      <enumerator name='BFD_RELOC_NDS32_TLS_LE_15S2' value='1078'/>
      <enumerator name='BFD_RELOC_NDS32_TLS_LE_ADD' value='1079'/>
      <enumerator name='BFD_RELOC_NDS32_TLS_LE_LS' value='1080'/>
      <enumerator name='BFD_RELOC_NDS32_TLS_IE_HI20' value='1081'/>
      <enumerator name='BFD_RELOC_NDS32_TLS_IE_LO12' value='1082'/>
      <enumerator name='BFD_RELOC_NDS32_TLS_IE_LO12S2' value='1083'/>
      <enumerator name='BFD_RELOC_NDS32_TLS_IEGP_HI20' value='1084'/>
      <enumerator name='BFD_RELOC_NDS32_TLS_IEGP_LO12' value='1085'/>
      <enumerator name='BFD_RELOC_NDS32_TLS_IEGP_LO12S2' value='1086'/>
      <enumerator name='BFD_RELOC_NDS32_TLS_IEGP_LW' value='1087'/>
      <enumerator name='BFD_RELOC_NDS32_TLS_DESC' value='1088'/>
      <enumerator name='BFD_RELOC_NDS32_TLS_DESC_HI20' value='1089'/>
      <enumerator name='BFD_RELOC_NDS32_TLS_DESC_LO12' value='1090'/>
      <enumerator name='BFD_RELOC_NDS32_TLS_DESC_20' value='1091'/>
      <enumerator name='BFD_RELOC_NDS32_TLS_DESC_SDA17S2' value='1092'/>
      <enumerator name='BFD_RELOC_NDS32_TLS_DESC_ADD' value='1093'/>
      <enumerator name='BFD_RELOC_NDS32_TLS_DESC_FUNC' value='1094'/>
      <enumerator name='BFD_RELOC_NDS32_TLS_DESC_CALL' value='1095'/>
      <enumerator name='BFD_RELOC_NDS32_TLS_DESC_MEM' value='1096'/>
      <enumerator name='BFD_RELOC_NDS32_REMOVE' value='1097'/>
      <enumerator name='BFD_RELOC_NDS32_GROUP' value='1098'/>
      <enumerator name='BFD_RELOC_NDS32_LSI' value='1099'/>
      <enumerator name='BFD_RELOC_V850_9_PCREL' value='1100'/>
      <enumerator name='BFD_RELOC_V850_22_PCREL' value='1101'/>
      <enumerator name='BFD_RELOC_V850_SDA_16_16_OFFSET' value='1102'/>
      <enumerator name='BFD_RELOC_V850_SDA_15_16_OFFSET' value='1103'/>
      <enumerator name='BFD_RELOC_V850_ZDA_16_16_OFFSET' value='1104'/>
      <enumerator name='BFD_RELOC_V850_ZDA_15_16_OFFSET' value='1105'/>
      <enumerator name='BFD_RELOC_V850_TDA_6_8_OFFSET' value='1106'/>
      <enumerator name='BFD_RELOC_V850_TDA_7_8_OFFSET' value='1107'/>
      <enumerator name='BFD_RELOC_V850_TDA_7_7_OFFSET' value='1108'/>
      <enumerator name='BFD_RELOC_V850_TDA_16_16_OFFSET' value='1109'/>
      <enumerator name='BFD_RELOC_V850_TDA_4_5_OFFSET' value='1110'/>
      <enumerator name='BFD_RELOC_V850_TDA_4_4_OFFSET' value='1111'/>
      <enumerator name='BFD_RELOC_V850_SDA_16_16_SPLIT_OFFSET' value='1112'/>
      <enumerator name='BFD_RELOC_V850_ZDA_16_16_SPLIT_OFFSET' value='1113'/>
      <enumerator name='BFD_RELOC_V850_CALLT_6_7_OFFSET' value='1114'/>
      <enumerator name='BFD_RELOC_V850_CALLT_16_16_OFFSET' value='1115'/>
      <enumerator name='BFD_RELOC_V850_LONGCALL' value='1116'/>
      <enumerator name='BFD_RELOC_V850_LONGJUMP' value='1117'/>
      <enumerator name='BFD_RELOC_V850_ALIGN' value='1118'/>
      <enumerator name='BFD_RELOC_V850_LO16_SPLIT_OFFSET' value='1119'/>
      <enumerator name='BFD_RELOC_V850_16_PCREL' value='1120'/>
      <enumerator name='BFD_RELOC_V850_17_PCREL' value='1121'/>
      <enumerator name='BFD_RELOC_V850_23' value='1122'/>
      <enumerator name='BFD_RELOC_V850_32_PCREL' value='1123'/>
      <enumerator name='BFD_RELOC_V850_32_ABS' value='1124'/>
      <enumerator name='BFD_RELOC_V850_16_SPLIT_OFFSET' value='1125'/>
      <enumerator name='BFD_RELOC_V850_16_S1' value='1126'/>
      <enumerator name='BFD_RELOC_V850_LO16_S1' value='1127'/>
      <enumerator name='BFD_RELOC_V850_CALLT_15_16_OFFSET' value='1128'/>
      <enumerator name='BFD_RELOC_V850_32_GOTPCREL' value='1129'/>
      <enumerator name='BFD_RELOC_V850_16_GOT' value='1130'/>
      <enumerator name='BFD_RELOC_V850_32_GOT' value='1131'/>
      <enumerator name='BFD_RELOC_V850_22_PLT_PCREL' value='1132'/>
      <enumerator name='BFD_RELOC_V850_32_PLT_PCREL' value='1133'/>
      <enumerator name='BFD_RELOC_V850_COPY' value='1134'/>
      <enumerator name='BFD_RELOC_V850_GLOB_DAT' value='1135'/>
      <enumerator name='BFD_RELOC_V850_JMP_SLOT' value='1136'/>
      <enumerator name='BFD_RELOC_V850_RELATIVE' value='1137'/>
      <enumerator name='BFD_RELOC_V850_16_GOTOFF' value='1138'/>
      <enumerator name='BFD_RELOC_V850_32_GOTOFF' value='1139'/>
      <enumerator name='BFD_RELOC_V850_CODE' value='1140'/>
      <enumerator name='BFD_RELOC_V850_DATA' value='1141'/>
      <enumerator name='BFD_RELOC_TIC30_LDP' value='1142'/>
      <enumerator name='BFD_RELOC_TIC54X_PARTLS7' value='1143'/>
      <enumerator name='BFD_RELOC_TIC54X_PARTMS9' value='1144'/>
      <enumerator name='BFD_RELOC_TIC54X_23' value='1145'/>
      <enumerator name='BFD_RELOC_TIC54X_16_OF_23' value='1146'/>
      <enumerator name='BFD_RELOC_TIC54X_MS7_OF_23' value='1147'/>
      <enumerator name='BFD_RELOC_C6000_PCR_S21' value='1148'/>
      <enumerator name='BFD_RELOC_C6000_PCR_S12' value='1149'/>
      <enumerator name='BFD_RELOC_C6000_PCR_S10' value='1150'/>
      <enumerator name='BFD_RELOC_C6000_PCR_S7' value='1151'/>
      <enumerator name='BFD_RELOC_C6000_ABS_S16' value='1152'/>
      <enumerator name='BFD_RELOC_C6000_ABS_L16' value='1153'/>
      <enumerator name='BFD_RELOC_C6000_ABS_H16' value='1154'/>
      <enumerator name='BFD_RELOC_C6000_SBR_U15_B' value='1155'/>
      <enumerator name='BFD_RELOC_C6000_SBR_U15_H' value='1156'/>
      <enumerator name='BFD_RELOC_C6000_SBR_U15_W' value='1157'/>
      <enumerator name='BFD_RELOC_C6000_SBR_S16' value='1158'/>
      <enumerator name='BFD_RELOC_C6000_SBR_L16_B' value='1159'/>
      <enumerator name='BFD_RELOC_C6000_SBR_L16_H' value='1160'/>
      <enumerator name='BFD_RELOC_C6000_SBR_L16_W' value='1161'/>
      <enumerator name='BFD_RELOC_C6000_SBR_H16_B' value='1162'/>
      <enumerator name='BFD_RELOC_C6000_SBR_H16_H' value='1163'/>
      <enumerator name='BFD_RELOC_C6000_SBR_H16_W' value='1164'/>
      <enumerator name='BFD_RELOC_C6000_SBR_GOT_U15_W' value='1165'/>
      <enumerator name='BFD_RELOC_C6000_SBR_GOT_L16_W' value='1166'/>
      <enumerator name='BFD_RELOC_C6000_SBR_GOT_H16_W' value='1167'/>
      <enumerator name='BFD_RELOC_C6000_DSBT_INDEX' value='1168'/>
      <enumerator name='BFD_RELOC_C6000_PREL31' value='1169'/>
      <enumerator name='BFD_RELOC_C6000_COPY' value='1170'/>
      <enumerator name='BFD_RELOC_C6000_JUMP_SLOT' value='1171'/>
      <enumerator name='BFD_RELOC_C6000_EHTYPE' value='1172'/>
      <enumerator name='BFD_RELOC_C6000_PCR_H16' value='1173'/>
      <enumerator name='BFD_RELOC_C6000_PCR_L16' value='1174'/>
      <enumerator name='BFD_RELOC_C6000_ALIGN' value='1175'/>
      <enumerator name='BFD_RELOC_C6000_FPHEAD' value='1176'/>
      <enumerator name='BFD_RELOC_C6000_NOCMP' value='1177'/>
      <enumerator name='BFD_RELOC_FR30_48' value='1178'/>
      <enumerator name='BFD_RELOC_FR30_20' value='1179'/>
      <enumerator name='BFD_RELOC_FR30_6_IN_4' value='1180'/>
      <enumerator name='BFD_RELOC_FR30_8_IN_8' value='1181'/>
      <enumerator name='BFD_RELOC_FR30_9_IN_8' value='1182'/>
      <enumerator name='BFD_RELOC_FR30_10_IN_8' value='1183'/>
      <enumerator name='BFD_RELOC_FR30_9_PCREL' value='1184'/>
      <enumerator name='BFD_RELOC_FR30_12_PCREL' value='1185'/>
      <enumerator name='BFD_RELOC_MCORE_PCREL_IMM8BY4' value='1186'/>
      <enumerator name='BFD_RELOC_MCORE_PCREL_IMM11BY2' value='1187'/>
      <enumerator name='BFD_RELOC_MCORE_PCREL_IMM4BY2' value='1188'/>
      <enumerator name='BFD_RELOC_MCORE_PCREL_32' value='1189'/>
      <enumerator name='BFD_RELOC_MCORE_PCREL_JSR_IMM11BY2' value='1190'/>
      <enumerator name='BFD_RELOC_MCORE_RVA' value='1191'/>
      <enumerator name='BFD_RELOC_MEP_8' value='1192'/>
      <enumerator name='BFD_RELOC_MEP_16' value='1193'/>
      <enumerator name='BFD_RELOC_MEP_32' value='1194'/>
      <enumerator name='BFD_RELOC_MEP_PCREL8A2' value='1195'/>
      <enumerator name='BFD_RELOC_MEP_PCREL12A2' value='1196'/>
      <enumerator name='BFD_RELOC_MEP_PCREL17A2' value='1197'/>
      <enumerator name='BFD_RELOC_MEP_PCREL24A2' value='1198'/>
      <enumerator name='BFD_RELOC_MEP_PCABS24A2' value='1199'/>
      <enumerator name='BFD_RELOC_MEP_LOW16' value='1200'/>
      <enumerator name='BFD_RELOC_MEP_HI16U' value='1201'/>
      <enumerator name='BFD_RELOC_MEP_HI16S' value='1202'/>
      <enumerator name='BFD_RELOC_MEP_GPREL' value='1203'/>
      <enumerator name='BFD_RELOC_MEP_TPREL' value='1204'/>
      <enumerator name='BFD_RELOC_MEP_TPREL7' value='1205'/>
      <enumerator name='BFD_RELOC_MEP_TPREL7A2' value='1206'/>
      <enumerator name='BFD_RELOC_MEP_TPREL7A4' value='1207'/>
      <enumerator name='BFD_RELOC_MEP_UIMM24' value='1208'/>
      <enumerator name='BFD_RELOC_MEP_ADDR24A4' value='1209'/>
      <enumerator name='BFD_RELOC_MEP_GNU_VTINHERIT' value='1210'/>
      <enumerator name='BFD_RELOC_MEP_GNU_VTENTRY' value='1211'/>
      <enumerator name='BFD_RELOC_METAG_HIADDR16' value='1212'/>
      <enumerator name='BFD_RELOC_METAG_LOADDR16' value='1213'/>
      <enumerator name='BFD_RELOC_METAG_RELBRANCH' value='1214'/>
      <enumerator name='BFD_RELOC_METAG_GETSETOFF' value='1215'/>
      <enumerator name='BFD_RELOC_METAG_HIOG' value='1216'/>
      <enumerator name='BFD_RELOC_METAG_LOOG' value='1217'/>
      <enumerator name='BFD_RELOC_METAG_REL8' value='1218'/>
      <enumerator name='BFD_RELOC_METAG_REL16' value='1219'/>
      <enumerator name='BFD_RELOC_METAG_HI16_GOTOFF' value='1220'/>
      <enumerator name='BFD_RELOC_METAG_LO16_GOTOFF' value='1221'/>
      <enumerator name='BFD_RELOC_METAG_GETSET_GOTOFF' value='1222'/>
      <enumerator name='BFD_RELOC_METAG_GETSET_GOT' value='1223'/>
      <enumerator name='BFD_RELOC_METAG_HI16_GOTPC' value='1224'/>
      <enumerator name='BFD_RELOC_METAG_LO16_GOTPC' value='1225'/>
      <enumerator name='BFD_RELOC_METAG_HI16_PLT' value='1226'/>
      <enumerator name='BFD_RELOC_METAG_LO16_PLT' value='1227'/>
      <enumerator name='BFD_RELOC_METAG_RELBRANCH_PLT' value='1228'/>
      <enumerator name='BFD_RELOC_METAG_GOTOFF' value='1229'/>
      <enumerator name='BFD_RELOC_METAG_PLT' value='1230'/>
      <enumerator name='BFD_RELOC_METAG_COPY' value='1231'/>
      <enumerator name='BFD_RELOC_METAG_JMP_SLOT' value='1232'/>
      <enumerator name='BFD_RELOC_METAG_RELATIVE' value='1233'/>
      <enumerator name='BFD_RELOC_METAG_GLOB_DAT' value='1234'/>
      <enumerator name='BFD_RELOC_METAG_TLS_GD' value='1235'/>
      <enumerator name='BFD_RELOC_METAG_TLS_LDM' value='1236'/>
      <enumerator name='BFD_RELOC_METAG_TLS_LDO_HI16' value='1237'/>
      <enumerator name='BFD_RELOC_METAG_TLS_LDO_LO16' value='1238'/>
      <enumerator name='BFD_RELOC_METAG_TLS_LDO' value='1239'/>
      <enumerator name='BFD_RELOC_METAG_TLS_IE' value='1240'/>
      <enumerator name='BFD_RELOC_METAG_TLS_IENONPIC' value='1241'/>
      <enumerator name='BFD_RELOC_METAG_TLS_IENONPIC_HI16' value='1242'/>
      <enumerator name='BFD_RELOC_METAG_TLS_IENONPIC_LO16' value='1243'/>
      <enumerator name='BFD_RELOC_METAG_TLS_TPOFF' value='1244'/>
      <enumerator name='BFD_RELOC_METAG_TLS_DTPMOD' value='1245'/>
      <enumerator name='BFD_RELOC_METAG_TLS_DTPOFF' value='1246'/>
      <enumerator name='BFD_RELOC_METAG_TLS_LE' value='1247'/>
      <enumerator name='BFD_RELOC_METAG_TLS_LE_HI16' value='1248'/>
      <enumerator name='BFD_RELOC_METAG_TLS_LE_LO16' value='1249'/>
      <enumerator name='BFD_RELOC_MMIX_GETA' value='1250'/>
      <enumerator name='BFD_RELOC_MMIX_GETA_1' value='1251'/>
      <enumerator name='BFD_RELOC_MMIX_GETA_2' value='1252'/>
      <enumerator name='BFD_RELOC_MMIX_GETA_3' value='1253'/>
      <enumerator name='BFD_RELOC_MMIX_CBRANCH' value='1254'/>
      <enumerator name='BFD_RELOC_MMIX_CBRANCH_J' value='1255'/>
      <enumerator name='BFD_RELOC_MMIX_CBRANCH_1' value='1256'/>
      <enumerator name='BFD_RELOC_MMIX_CBRANCH_2' value='1257'/>
      <enumerator name='BFD_RELOC_MMIX_CBRANCH_3' value='1258'/>
      <enumerator name='BFD_RELOC_MMIX_PUSHJ' value='1259'/>
      <enumerator name='BFD_RELOC_MMIX_PUSHJ_1' value='1260'/>
      <enumerator name='BFD_RELOC_MMIX_PUSHJ_2' value='1261'/>
      <enumerator name='BFD_RELOC_MMIX_PUSHJ_3' value='1262'/>
      <enumerator name='BFD_RELOC_MMIX_PUSHJ_STUBBABLE' value='1263'/>
      <enumerator name='BFD_RELOC_MMIX_JMP' value='1264'/>
      <enumerator name='BFD_RELOC_MMIX_JMP_1' value='1265'/>
      <enumerator name='BFD_RELOC_MMIX_JMP_2' value='1266'/>
      <enumerator name='BFD_RELOC_MMIX_JMP_3' value='1267'/>
      <enumerator name='BFD_RELOC_MMIX_ADDR19' value='1268'/>
      <enumerator name='BFD_RELOC_MMIX_ADDR27' value='1269'/>
      <enumerator name='BFD_RELOC_MMIX_REG_OR_BYTE' value='1270'/>
      <enumerator name='BFD_RELOC_MMIX_REG' value='1271'/>
      <enumerator name='BFD_RELOC_MMIX_BASE_PLUS_OFFSET' value='1272'/>
      <enumerator name='BFD_RELOC_MMIX_LOCAL' value='1273'/>
      <enumerator name='BFD_RELOC_AVR_7_PCREL' value='1274'/>
      <enumerator name='BFD_RELOC_AVR_13_PCREL' value='1275'/>
      <enumerator name='BFD_RELOC_AVR_16_PM' value='1276'/>
      <enumerator name='BFD_RELOC_AVR_LO8_LDI' value='1277'/>
      <enumerator name='BFD_RELOC_AVR_HI8_LDI' value='1278'/>
      <enumerator name='BFD_RELOC_AVR_HH8_LDI' value='1279'/>
      <enumerator name='BFD_RELOC_AVR_MS8_LDI' value='1280'/>
      <enumerator name='BFD_RELOC_AVR_LO8_LDI_NEG' value='1281'/>
      <enumerator name='BFD_RELOC_AVR_HI8_LDI_NEG' value='1282'/>
      <enumerator name='BFD_RELOC_AVR_HH8_LDI_NEG' value='1283'/>
      <enumerator name='BFD_RELOC_AVR_MS8_LDI_NEG' value='1284'/>
      <enumerator name='BFD_RELOC_AVR_LO8_LDI_PM' value='1285'/>
      <enumerator name='BFD_RELOC_AVR_LO8_LDI_GS' value='1286'/>
      <enumerator name='BFD_RELOC_AVR_HI8_LDI_PM' value='1287'/>
      <enumerator name='BFD_RELOC_AVR_HI8_LDI_GS' value='1288'/>
      <enumerator name='BFD_RELOC_AVR_HH8_LDI_PM' value='1289'/>
      <enumerator name='BFD_RELOC_AVR_LO8_LDI_PM_NEG' value='1290'/>
      <enumerator name='BFD_RELOC_AVR_HI8_LDI_PM_NEG' value='1291'/>
      <enumerator name='BFD_RELOC_AVR_HH8_LDI_PM_NEG' value='1292'/>
      <enumerator name='BFD_RELOC_AVR_CALL' value='1293'/>
      <enumerator name='BFD_RELOC_AVR_LDI' value='1294'/>
      <enumerator name='BFD_RELOC_AVR_6' value='1295'/>
      <enumerator name='BFD_RELOC_AVR_6_ADIW' value='1296'/>
      <enumerator name='BFD_RELOC_AVR_8_LO' value='1297'/>
      <enumerator name='BFD_RELOC_AVR_8_HI' value='1298'/>
      <enumerator name='BFD_RELOC_AVR_8_HLO' value='1299'/>
      <enumerator name='BFD_RELOC_AVR_DIFF8' value='1300'/>
      <enumerator name='BFD_RELOC_AVR_DIFF16' value='1301'/>
      <enumerator name='BFD_RELOC_AVR_DIFF32' value='1302'/>
      <enumerator name='BFD_RELOC_AVR_LDS_STS_16' value='1303'/>
      <enumerator name='BFD_RELOC_AVR_PORT6' value='1304'/>
      <enumerator name='BFD_RELOC_AVR_PORT5' value='1305'/>
      <enumerator name='BFD_RELOC_RISCV_HI20' value='1306'/>
      <enumerator name='BFD_RELOC_RISCV_PCREL_HI20' value='1307'/>
      <enumerator name='BFD_RELOC_RISCV_PCREL_LO12_I' value='1308'/>
      <enumerator name='BFD_RELOC_RISCV_PCREL_LO12_S' value='1309'/>
      <enumerator name='BFD_RELOC_RISCV_LO12_I' value='1310'/>
      <enumerator name='BFD_RELOC_RISCV_LO12_S' value='1311'/>
      <enumerator name='BFD_RELOC_RISCV_GPREL12_I' value='1312'/>
      <enumerator name='BFD_RELOC_RISCV_GPREL12_S' value='1313'/>
      <enumerator name='BFD_RELOC_RISCV_TPREL_HI20' value='1314'/>
      <enumerator name='BFD_RELOC_RISCV_TPREL_LO12_I' value='1315'/>
      <enumerator name='BFD_RELOC_RISCV_TPREL_LO12_S' value='1316'/>
      <enumerator name='BFD_RELOC_RISCV_TPREL_ADD' value='1317'/>
      <enumerator name='BFD_RELOC_RISCV_CALL' value='1318'/>
      <enumerator name='BFD_RELOC_RISCV_CALL_PLT' value='1319'/>
      <enumerator name='BFD_RELOC_RISCV_ADD8' value='1320'/>
      <enumerator name='BFD_RELOC_RISCV_ADD16' value='1321'/>
      <enumerator name='BFD_RELOC_RISCV_ADD32' value='1322'/>
      <enumerator name='BFD_RELOC_RISCV_ADD64' value='1323'/>
      <enumerator name='BFD_RELOC_RISCV_SUB8' value='1324'/>
      <enumerator name='BFD_RELOC_RISCV_SUB16' value='1325'/>
      <enumerator name='BFD_RELOC_RISCV_SUB32' value='1326'/>
      <enumerator name='BFD_RELOC_RISCV_SUB64' value='1327'/>
      <enumerator name='BFD_RELOC_RISCV_GOT_HI20' value='1328'/>
      <enumerator name='BFD_RELOC_RISCV_TLS_GOT_HI20' value='1329'/>
      <enumerator name='BFD_RELOC_RISCV_TLS_GD_HI20' value='1330'/>
      <enumerator name='BFD_RELOC_RISCV_JMP' value='1331'/>
      <enumerator name='BFD_RELOC_RISCV_TLS_DTPMOD32' value='1332'/>
      <enumerator name='BFD_RELOC_RISCV_TLS_DTPREL32' value='1333'/>
      <enumerator name='BFD_RELOC_RISCV_TLS_DTPMOD64' value='1334'/>
      <enumerator name='BFD_RELOC_RISCV_TLS_DTPREL64' value='1335'/>
      <enumerator name='BFD_RELOC_RISCV_TLS_TPREL32' value='1336'/>
      <enumerator name='BFD_RELOC_RISCV_TLS_TPREL64' value='1337'/>
      <enumerator name='BFD_RELOC_RISCV_ALIGN' value='1338'/>
      <enumerator name='BFD_RELOC_RISCV_RVC_BRANCH' value='1339'/>
      <enumerator name='BFD_RELOC_RISCV_RVC_JUMP' value='1340'/>
      <enumerator name='BFD_RELOC_RISCV_RVC_LUI' value='1341'/>
      <enumerator name='BFD_RELOC_RISCV_GPREL_I' value='1342'/>
      <enumerator name='BFD_RELOC_RISCV_GPREL_S' value='1343'/>
      <enumerator name='BFD_RELOC_RISCV_TPREL_I' value='1344'/>
      <enumerator name='BFD_RELOC_RISCV_TPREL_S' value='1345'/>
      <enumerator name='BFD_RELOC_RISCV_RELAX' value='1346'/>
      <enumerator name='BFD_RELOC_RISCV_CFA' value='1347'/>
      <enumerator name='BFD_RELOC_RISCV_SUB6' value='1348'/>
      <enumerator name='BFD_RELOC_RISCV_SET6' value='1349'/>
      <enumerator name='BFD_RELOC_RISCV_SET8' value='1350'/>
      <enumerator name='BFD_RELOC_RISCV_SET16' value='1351'/>
      <enumerator name='BFD_RELOC_RISCV_SET32' value='1352'/>
      <enumerator name='BFD_RELOC_RISCV_32_PCREL' value='1353'/>
      <enumerator name='BFD_RELOC_RL78_NEG8' value='1354'/>
      <enumerator name='BFD_RELOC_RL78_NEG16' value='1355'/>
      <enumerator name='BFD_RELOC_RL78_NEG24' value='1356'/>
      <enumerator name='BFD_RELOC_RL78_NEG32' value='1357'/>
      <enumerator name='BFD_RELOC_RL78_16_OP' value='1358'/>
      <enumerator name='BFD_RELOC_RL78_24_OP' value='1359'/>
      <enumerator name='BFD_RELOC_RL78_32_OP' value='1360'/>
      <enumerator name='BFD_RELOC_RL78_8U' value='1361'/>
      <enumerator name='BFD_RELOC_RL78_16U' value='1362'/>
      <enumerator name='BFD_RELOC_RL78_24U' value='1363'/>
      <enumerator name='BFD_RELOC_RL78_DIR3U_PCREL' value='1364'/>
      <enumerator name='BFD_RELOC_RL78_DIFF' value='1365'/>
      <enumerator name='BFD_RELOC_RL78_GPRELB' value='1366'/>
      <enumerator name='BFD_RELOC_RL78_GPRELW' value='1367'/>
      <enumerator name='BFD_RELOC_RL78_GPRELL' value='1368'/>
      <enumerator name='BFD_RELOC_RL78_SYM' value='1369'/>
      <enumerator name='BFD_RELOC_RL78_OP_SUBTRACT' value='1370'/>
      <enumerator name='BFD_RELOC_RL78_OP_NEG' value='1371'/>
      <enumerator name='BFD_RELOC_RL78_OP_AND' value='1372'/>
      <enumerator name='BFD_RELOC_RL78_OP_SHRA' value='1373'/>
      <enumerator name='BFD_RELOC_RL78_ABS8' value='1374'/>
      <enumerator name='BFD_RELOC_RL78_ABS16' value='1375'/>
      <enumerator name='BFD_RELOC_RL78_ABS16_REV' value='1376'/>
      <enumerator name='BFD_RELOC_RL78_ABS32' value='1377'/>
      <enumerator name='BFD_RELOC_RL78_ABS32_REV' value='1378'/>
      <enumerator name='BFD_RELOC_RL78_ABS16U' value='1379'/>
      <enumerator name='BFD_RELOC_RL78_ABS16UW' value='1380'/>
      <enumerator name='BFD_RELOC_RL78_ABS16UL' value='1381'/>
      <enumerator name='BFD_RELOC_RL78_RELAX' value='1382'/>
      <enumerator name='BFD_RELOC_RL78_HI16' value='1383'/>
      <enumerator name='BFD_RELOC_RL78_HI8' value='1384'/>
      <enumerator name='BFD_RELOC_RL78_LO16' value='1385'/>
      <enumerator name='BFD_RELOC_RL78_CODE' value='1386'/>
      <enumerator name='BFD_RELOC_RL78_SADDR' value='1387'/>
      <enumerator name='BFD_RELOC_RX_NEG8' value='1388'/>
      <enumerator name='BFD_RELOC_RX_NEG16' value='1389'/>
      <enumerator name='BFD_RELOC_RX_NEG24' value='1390'/>
      <enumerator name='BFD_RELOC_RX_NEG32' value='1391'/>
      <enumerator name='BFD_RELOC_RX_16_OP' value='1392'/>
      <enumerator name='BFD_RELOC_RX_24_OP' value='1393'/>
      <enumerator name='BFD_RELOC_RX_32_OP' value='1394'/>
      <enumerator name='BFD_RELOC_RX_8U' value='1395'/>
      <enumerator name='BFD_RELOC_RX_16U' value='1396'/>
      <enumerator name='BFD_RELOC_RX_24U' value='1397'/>
      <enumerator name='BFD_RELOC_RX_DIR3U_PCREL' value='1398'/>
      <enumerator name='BFD_RELOC_RX_DIFF' value='1399'/>
      <enumerator name='BFD_RELOC_RX_GPRELB' value='1400'/>
      <enumerator name='BFD_RELOC_RX_GPRELW' value='1401'/>
      <enumerator name='BFD_RELOC_RX_GPRELL' value='1402'/>
      <enumerator name='BFD_RELOC_RX_SYM' value='1403'/>
      <enumerator name='BFD_RELOC_RX_OP_SUBTRACT' value='1404'/>
      <enumerator name='BFD_RELOC_RX_OP_NEG' value='1405'/>
      <enumerator name='BFD_RELOC_RX_ABS8' value='1406'/>
      <enumerator name='BFD_RELOC_RX_ABS16' value='1407'/>
      <enumerator name='BFD_RELOC_RX_ABS16_REV' value='1408'/>
      <enumerator name='BFD_RELOC_RX_ABS32' value='1409'/>
      <enumerator name='BFD_RELOC_RX_ABS32_REV' value='1410'/>
      <enumerator name='BFD_RELOC_RX_ABS16U' value='1411'/>
      <enumerator name='BFD_RELOC_RX_ABS16UW' value='1412'/>
      <enumerator name='BFD_RELOC_RX_ABS16UL' value='1413'/>
      <enumerator name='BFD_RELOC_RX_RELAX' value='1414'/>
      <enumerator name='BFD_RELOC_390_12' value='1415'/>
      <enumerator name='BFD_RELOC_390_GOT12' value='1416'/>
      <enumerator name='BFD_RELOC_390_PLT32' value='1417'/>
      <enumerator name='BFD_RELOC_390_COPY' value='1418'/>
      <enumerator name='BFD_RELOC_390_GLOB_DAT' value='1419'/>
      <enumerator name='BFD_RELOC_390_JMP_SLOT' value='1420'/>
      <enumerator name='BFD_RELOC_390_RELATIVE' value='1421'/>
      <enumerator name='BFD_RELOC_390_GOTPC' value='1422'/>
      <enumerator name='BFD_RELOC_390_GOT16' value='1423'/>
      <enumerator name='BFD_RELOC_390_PC12DBL' value='1424'/>
      <enumerator name='BFD_RELOC_390_PLT12DBL' value='1425'/>
      <enumerator name='BFD_RELOC_390_PC16DBL' value='1426'/>
      <enumerator name='BFD_RELOC_390_PLT16DBL' value='1427'/>
      <enumerator name='BFD_RELOC_390_PC24DBL' value='1428'/>
      <enumerator name='BFD_RELOC_390_PLT24DBL' value='1429'/>
      <enumerator name='BFD_RELOC_390_PC32DBL' value='1430'/>
      <enumerator name='BFD_RELOC_390_PLT32DBL' value='1431'/>
      <enumerator name='BFD_RELOC_390_GOTPCDBL' value='1432'/>
      <enumerator name='BFD_RELOC_390_GOT64' value='1433'/>
      <enumerator name='BFD_RELOC_390_PLT64' value='1434'/>
      <enumerator name='BFD_RELOC_390_GOTENT' value='1435'/>
      <enumerator name='BFD_RELOC_390_GOTOFF64' value='1436'/>
      <enumerator name='BFD_RELOC_390_GOTPLT12' value='1437'/>
      <enumerator name='BFD_RELOC_390_GOTPLT16' value='1438'/>
      <enumerator name='BFD_RELOC_390_GOTPLT32' value='1439'/>
      <enumerator name='BFD_RELOC_390_GOTPLT64' value='1440'/>
      <enumerator name='BFD_RELOC_390_GOTPLTENT' value='1441'/>
      <enumerator name='BFD_RELOC_390_PLTOFF16' value='1442'/>
      <enumerator name='BFD_RELOC_390_PLTOFF32' value='1443'/>
      <enumerator name='BFD_RELOC_390_PLTOFF64' value='1444'/>
      <enumerator name='BFD_RELOC_390_TLS_LOAD' value='1445'/>
      <enumerator name='BFD_RELOC_390_TLS_GDCALL' value='1446'/>
      <enumerator name='BFD_RELOC_390_TLS_LDCALL' value='1447'/>
      <enumerator name='BFD_RELOC_390_TLS_GD32' value='1448'/>
      <enumerator name='BFD_RELOC_390_TLS_GD64' value='1449'/>
      <enumerator name='BFD_RELOC_390_TLS_GOTIE12' value='1450'/>
      <enumerator name='BFD_RELOC_390_TLS_GOTIE32' value='1451'/>
      <enumerator name='BFD_RELOC_390_TLS_GOTIE64' value='1452'/>
      <enumerator name='BFD_RELOC_390_TLS_LDM32' value='1453'/>
      <enumerator name='BFD_RELOC_390_TLS_LDM64' value='1454'/>
      <enumerator name='BFD_RELOC_390_TLS_IE32' value='1455'/>
      <enumerator name='BFD_RELOC_390_TLS_IE64' value='1456'/>
      <enumerator name='BFD_RELOC_390_TLS_IEENT' value='1457'/>
      <enumerator name='BFD_RELOC_390_TLS_LE32' value='1458'/>
      <enumerator name='BFD_RELOC_390_TLS_LE64' value='1459'/>
      <enumerator name='BFD_RELOC_390_TLS_LDO32' value='1460'/>
      <enumerator name='BFD_RELOC_390_TLS_LDO64' value='1461'/>
      <enumerator name='BFD_RELOC_390_TLS_DTPMOD' value='1462'/>
      <enumerator name='BFD_RELOC_390_TLS_DTPOFF' value='1463'/>
      <enumerator name='BFD_RELOC_390_TLS_TPOFF' value='1464'/>
      <enumerator name='BFD_RELOC_390_20' value='1465'/>
      <enumerator name='BFD_RELOC_390_GOT20' value='1466'/>
      <enumerator name='BFD_RELOC_390_GOTPLT20' value='1467'/>
      <enumerator name='BFD_RELOC_390_TLS_GOTIE20' value='1468'/>
      <enumerator name='BFD_RELOC_390_IRELATIVE' value='1469'/>
      <enumerator name='BFD_RELOC_SCORE_GPREL15' value='1470'/>
      <enumerator name='BFD_RELOC_SCORE_DUMMY2' value='1471'/>
      <enumerator name='BFD_RELOC_SCORE_JMP' value='1472'/>
      <enumerator name='BFD_RELOC_SCORE_BRANCH' value='1473'/>
      <enumerator name='BFD_RELOC_SCORE_IMM30' value='1474'/>
      <enumerator name='BFD_RELOC_SCORE_IMM32' value='1475'/>
      <enumerator name='BFD_RELOC_SCORE16_JMP' value='1476'/>
      <enumerator name='BFD_RELOC_SCORE16_BRANCH' value='1477'/>
      <enumerator name='BFD_RELOC_SCORE_BCMP' value='1478'/>
      <enumerator name='BFD_RELOC_SCORE_GOT15' value='1479'/>
      <enumerator name='BFD_RELOC_SCORE_GOT_LO16' value='1480'/>
      <enumerator name='BFD_RELOC_SCORE_CALL15' value='1481'/>
      <enumerator name='BFD_RELOC_SCORE_DUMMY_HI16' value='1482'/>
      <enumerator name='BFD_RELOC_IP2K_FR9' value='1483'/>
      <enumerator name='BFD_RELOC_IP2K_BANK' value='1484'/>
      <enumerator name='BFD_RELOC_IP2K_ADDR16CJP' value='1485'/>
      <enumerator name='BFD_RELOC_IP2K_PAGE3' value='1486'/>
      <enumerator name='BFD_RELOC_IP2K_LO8DATA' value='1487'/>
      <enumerator name='BFD_RELOC_IP2K_HI8DATA' value='1488'/>
      <enumerator name='BFD_RELOC_IP2K_EX8DATA' value='1489'/>
      <enumerator name='BFD_RELOC_IP2K_LO8INSN' value='1490'/>
      <enumerator name='BFD_RELOC_IP2K_HI8INSN' value='1491'/>
      <enumerator name='BFD_RELOC_IP2K_PC_SKIP' value='1492'/>
      <enumerator name='BFD_RELOC_IP2K_TEXT' value='1493'/>
      <enumerator name='BFD_RELOC_IP2K_FR_OFFSET' value='1494'/>
      <enumerator name='BFD_RELOC_VPE4KMATH_DATA' value='1495'/>
      <enumerator name='BFD_RELOC_VPE4KMATH_INSN' value='1496'/>
      <enumerator name='BFD_RELOC_VTABLE_INHERIT' value='1497'/>
      <enumerator name='BFD_RELOC_VTABLE_ENTRY' value='1498'/>
      <enumerator name='BFD_RELOC_IA64_IMM14' value='1499'/>
      <enumerator name='BFD_RELOC_IA64_IMM22' value='1500'/>
      <enumerator name='BFD_RELOC_IA64_IMM64' value='1501'/>
      <enumerator name='BFD_RELOC_IA64_DIR32MSB' value='1502'/>
      <enumerator name='BFD_RELOC_IA64_DIR32LSB' value='1503'/>
      <enumerator name='BFD_RELOC_IA64_DIR64MSB' value='1504'/>
      <enumerator name='BFD_RELOC_IA64_DIR64LSB' value='1505'/>
      <enumerator name='BFD_RELOC_IA64_GPREL22' value='1506'/>
      <enumerator name='BFD_RELOC_IA64_GPREL64I' value='1507'/>
      <enumerator name='BFD_RELOC_IA64_GPREL32MSB' value='1508'/>
      <enumerator name='BFD_RELOC_IA64_GPREL32LSB' value='1509'/>
      <enumerator name='BFD_RELOC_IA64_GPREL64MSB' value='1510'/>
      <enumerator name='BFD_RELOC_IA64_GPREL64LSB' value='1511'/>
      <enumerator name='BFD_RELOC_IA64_LTOFF22' value='1512'/>
      <enumerator name='BFD_RELOC_IA64_LTOFF64I' value='1513'/>
      <enumerator name='BFD_RELOC_IA64_PLTOFF22' value='1514'/>
      <enumerator name='BFD_RELOC_IA64_PLTOFF64I' value='1515'/>
      <enumerator name='BFD_RELOC_IA64_PLTOFF64MSB' value='1516'/>
      <enumerator name='BFD_RELOC_IA64_PLTOFF64LSB' value='1517'/>
      <enumerator name='BFD_RELOC_IA64_FPTR64I' value='1518'/>
      <enumerator name='BFD_RELOC_IA64_FPTR32MSB' value='1519'/>
      <enumerator name='BFD_RELOC_IA64_FPTR32LSB' value='1520'/>
      <enumerator name='BFD_RELOC_IA64_FPTR64MSB' value='1521'/>
      <enumerator name='BFD_RELOC_IA64_FPTR64LSB' value='1522'/>
      <enumerator name='BFD_RELOC_IA64_PCREL21B' value='1523'/>
      <enumerator name='BFD_RELOC_IA64_PCREL21BI' value='1524'/>
      <enumerator name='BFD_RELOC_IA64_PCREL21M' value='1525'/>
      <enumerator name='BFD_RELOC_IA64_PCREL21F' value='1526'/>
      <enumerator name='BFD_RELOC_IA64_PCREL22' value='1527'/>
      <enumerator name='BFD_RELOC_IA64_PCREL60B' value='1528'/>
      <enumerator name='BFD_RELOC_IA64_PCREL64I' value='1529'/>
      <enumerator name='BFD_RELOC_IA64_PCREL32MSB' value='1530'/>
      <enumerator name='BFD_RELOC_IA64_PCREL32LSB' value='1531'/>
      <enumerator name='BFD_RELOC_IA64_PCREL64MSB' value='1532'/>
      <enumerator name='BFD_RELOC_IA64_PCREL64LSB' value='1533'/>
      <enumerator name='BFD_RELOC_IA64_LTOFF_FPTR22' value='1534'/>
      <enumerator name='BFD_RELOC_IA64_LTOFF_FPTR64I' value='1535'/>
      <enumerator name='BFD_RELOC_IA64_LTOFF_FPTR32MSB' value='1536'/>
      <enumerator name='BFD_RELOC_IA64_LTOFF_FPTR32LSB' value='1537'/>
      <enumerator name='BFD_RELOC_IA64_LTOFF_FPTR64MSB' value='1538'/>
      <enumerator name='BFD_RELOC_IA64_LTOFF_FPTR64LSB' value='1539'/>
      <enumerator name='BFD_RELOC_IA64_SEGREL32MSB' value='1540'/>
      <enumerator name='BFD_RELOC_IA64_SEGREL32LSB' value='1541'/>
      <enumerator name='BFD_RELOC_IA64_SEGREL64MSB' value='1542'/>
      <enumerator name='BFD_RELOC_IA64_SEGREL64LSB' value='1543'/>
      <enumerator name='BFD_RELOC_IA64_SECREL32MSB' value='1544'/>
      <enumerator name='BFD_RELOC_IA64_SECREL32LSB' value='1545'/>
      <enumerator name='BFD_RELOC_IA64_SECREL64MSB' value='1546'/>
      <enumerator name='BFD_RELOC_IA64_SECREL64LSB' value='1547'/>
      <enumerator name='BFD_RELOC_IA64_REL32MSB' value='1548'/>
      <enumerator name='BFD_RELOC_IA64_REL32LSB' value='1549'/>
      <enumerator name='BFD_RELOC_IA64_REL64MSB' value='1550'/>
      <enumerator name='BFD_RELOC_IA64_REL64LSB' value='1551'/>
      <enumerator name='BFD_RELOC_IA64_LTV32MSB' value='1552'/>
      <enumerator name='BFD_RELOC_IA64_LTV32LSB' value='1553'/>
      <enumerator name='BFD_RELOC_IA64_LTV64MSB' value='1554'/>
      <enumerator name='BFD_RELOC_IA64_LTV64LSB' value='1555'/>
      <enumerator name='BFD_RELOC_IA64_IPLTMSB' value='1556'/>
      <enumerator name='BFD_RELOC_IA64_IPLTLSB' value='1557'/>
      <enumerator name='BFD_RELOC_IA64_COPY' value='1558'/>
      <enumerator name='BFD_RELOC_IA64_LTOFF22X' value='1559'/>
      <enumerator name='BFD_RELOC_IA64_LDXMOV' value='1560'/>
      <enumerator name='BFD_RELOC_IA64_TPREL14' value='1561'/>
      <enumerator name='BFD_RELOC_IA64_TPREL22' value='1562'/>
      <enumerator name='BFD_RELOC_IA64_TPREL64I' value='1563'/>
      <enumerator name='BFD_RELOC_IA64_TPREL64MSB' value='1564'/>
      <enumerator name='BFD_RELOC_IA64_TPREL64LSB' value='1565'/>
      <enumerator name='BFD_RELOC_IA64_LTOFF_TPREL22' value='1566'/>
      <enumerator name='BFD_RELOC_IA64_DTPMOD64MSB' value='1567'/>
      <enumerator name='BFD_RELOC_IA64_DTPMOD64LSB' value='1568'/>
      <enumerator name='BFD_RELOC_IA64_LTOFF_DTPMOD22' value='1569'/>
      <enumerator name='BFD_RELOC_IA64_DTPREL14' value='1570'/>
      <enumerator name='BFD_RELOC_IA64_DTPREL22' value='1571'/>
      <enumerator name='BFD_RELOC_IA64_DTPREL64I' value='1572'/>
      <enumerator name='BFD_RELOC_IA64_DTPREL32MSB' value='1573'/>
      <enumerator name='BFD_RELOC_IA64_DTPREL32LSB' value='1574'/>
      <enumerator name='BFD_RELOC_IA64_DTPREL64MSB' value='1575'/>
      <enumerator name='BFD_RELOC_IA64_DTPREL64LSB' value='1576'/>
      <enumerator name='BFD_RELOC_IA64_LTOFF_DTPREL22' value='1577'/>
      <enumerator name='BFD_RELOC_M68HC11_HI8' value='1578'/>
      <enumerator name='BFD_RELOC_M68HC11_LO8' value='1579'/>
      <enumerator name='BFD_RELOC_M68HC11_3B' value='1580'/>
      <enumerator name='BFD_RELOC_M68HC11_RL_JUMP' value='1581'/>
      <enumerator name='BFD_RELOC_M68HC11_RL_GROUP' value='1582'/>
      <enumerator name='BFD_RELOC_M68HC11_LO16' value='1583'/>
      <enumerator name='BFD_RELOC_M68HC11_PAGE' value='1584'/>
      <enumerator name='BFD_RELOC_M68HC11_24' value='1585'/>
      <enumerator name='BFD_RELOC_M68HC12_5B' value='1586'/>
      <enumerator name='BFD_RELOC_XGATE_RL_JUMP' value='1587'/>
      <enumerator name='BFD_RELOC_XGATE_RL_GROUP' value='1588'/>
      <enumerator name='BFD_RELOC_XGATE_LO16' value='1589'/>
      <enumerator name='BFD_RELOC_XGATE_GPAGE' value='1590'/>
      <enumerator name='BFD_RELOC_XGATE_24' value='1591'/>
      <enumerator name='BFD_RELOC_XGATE_PCREL_9' value='1592'/>
      <enumerator name='BFD_RELOC_XGATE_PCREL_10' value='1593'/>
      <enumerator name='BFD_RELOC_XGATE_IMM8_LO' value='1594'/>
      <enumerator name='BFD_RELOC_XGATE_IMM8_HI' value='1595'/>
      <enumerator name='BFD_RELOC_XGATE_IMM3' value='1596'/>
      <enumerator name='BFD_RELOC_XGATE_IMM4' value='1597'/>
      <enumerator name='BFD_RELOC_XGATE_IMM5' value='1598'/>
      <enumerator name='BFD_RELOC_M68HC12_9B' value='1599'/>
      <enumerator name='BFD_RELOC_M68HC12_16B' value='1600'/>
      <enumerator name='BFD_RELOC_M68HC12_9_PCREL' value='1601'/>
      <enumerator name='BFD_RELOC_M68HC12_10_PCREL' value='1602'/>
      <enumerator name='BFD_RELOC_M68HC12_LO8XG' value='1603'/>
      <enumerator name='BFD_RELOC_M68HC12_HI8XG' value='1604'/>
      <enumerator name='BFD_RELOC_S12Z_15_PCREL' value='1605'/>
      <enumerator name='BFD_RELOC_CR16_NUM8' value='1606'/>
      <enumerator name='BFD_RELOC_CR16_NUM16' value='1607'/>
      <enumerator name='BFD_RELOC_CR16_NUM32' value='1608'/>
      <enumerator name='BFD_RELOC_CR16_NUM32a' value='1609'/>
      <enumerator name='BFD_RELOC_CR16_REGREL0' value='1610'/>
      <enumerator name='BFD_RELOC_CR16_REGREL4' value='1611'/>
      <enumerator name='BFD_RELOC_CR16_REGREL4a' value='1612'/>
      <enumerator name='BFD_RELOC_CR16_REGREL14' value='1613'/>
      <enumerator name='BFD_RELOC_CR16_REGREL14a' value='1614'/>
      <enumerator name='BFD_RELOC_CR16_REGREL16' value='1615'/>
      <enumerator name='BFD_RELOC_CR16_REGREL20' value='1616'/>
      <enumerator name='BFD_RELOC_CR16_REGREL20a' value='1617'/>
      <enumerator name='BFD_RELOC_CR16_ABS20' value='1618'/>
      <enumerator name='BFD_RELOC_CR16_ABS24' value='1619'/>
      <enumerator name='BFD_RELOC_CR16_IMM4' value='1620'/>
      <enumerator name='BFD_RELOC_CR16_IMM8' value='1621'/>
      <enumerator name='BFD_RELOC_CR16_IMM16' value='1622'/>
      <enumerator name='BFD_RELOC_CR16_IMM20' value='1623'/>
      <enumerator name='BFD_RELOC_CR16_IMM24' value='1624'/>
      <enumerator name='BFD_RELOC_CR16_IMM32' value='1625'/>
      <enumerator name='BFD_RELOC_CR16_IMM32a' value='1626'/>
      <enumerator name='BFD_RELOC_CR16_DISP4' value='1627'/>
      <enumerator name='BFD_RELOC_CR16_DISP8' value='1628'/>
      <enumerator name='BFD_RELOC_CR16_DISP16' value='1629'/>
      <enumerator name='BFD_RELOC_CR16_DISP20' value='1630'/>
      <enumerator name='BFD_RELOC_CR16_DISP24' value='1631'/>
      <enumerator name='BFD_RELOC_CR16_DISP24a' value='1632'/>
      <enumerator name='BFD_RELOC_CR16_SWITCH8' value='1633'/>
      <enumerator name='BFD_RELOC_CR16_SWITCH16' value='1634'/>
      <enumerator name='BFD_RELOC_CR16_SWITCH32' value='1635'/>
      <enumerator name='BFD_RELOC_CR16_GOT_REGREL20' value='1636'/>
      <enumerator name='BFD_RELOC_CR16_GOTC_REGREL20' value='1637'/>
      <enumerator name='BFD_RELOC_CR16_GLOB_DAT' value='1638'/>
      <enumerator name='BFD_RELOC_CRX_REL4' value='1639'/>
      <enumerator name='BFD_RELOC_CRX_REL8' value='1640'/>
      <enumerator name='BFD_RELOC_CRX_REL8_CMP' value='1641'/>
      <enumerator name='BFD_RELOC_CRX_REL16' value='1642'/>
      <enumerator name='BFD_RELOC_CRX_REL24' value='1643'/>
      <enumerator name='BFD_RELOC_CRX_REL32' value='1644'/>
      <enumerator name='BFD_RELOC_CRX_REGREL12' value='1645'/>
      <enumerator name='BFD_RELOC_CRX_REGREL22' value='1646'/>
      <enumerator name='BFD_RELOC_CRX_REGREL28' value='1647'/>
      <enumerator name='BFD_RELOC_CRX_REGREL32' value='1648'/>
      <enumerator name='BFD_RELOC_CRX_ABS16' value='1649'/>
      <enumerator name='BFD_RELOC_CRX_ABS32' value='1650'/>
      <enumerator name='BFD_RELOC_CRX_NUM8' value='1651'/>
      <enumerator name='BFD_RELOC_CRX_NUM16' value='1652'/>
      <enumerator name='BFD_RELOC_CRX_NUM32' value='1653'/>
      <enumerator name='BFD_RELOC_CRX_IMM16' value='1654'/>
      <enumerator name='BFD_RELOC_CRX_IMM32' value='1655'/>
      <enumerator name='BFD_RELOC_CRX_SWITCH8' value='1656'/>
      <enumerator name='BFD_RELOC_CRX_SWITCH16' value='1657'/>
      <enumerator name='BFD_RELOC_CRX_SWITCH32' value='1658'/>
      <enumerator name='BFD_RELOC_CRIS_BDISP8' value='1659'/>
      <enumerator name='BFD_RELOC_CRIS_UNSIGNED_5' value='1660'/>
      <enumerator name='BFD_RELOC_CRIS_SIGNED_6' value='1661'/>
      <enumerator name='BFD_RELOC_CRIS_UNSIGNED_6' value='1662'/>
      <enumerator name='BFD_RELOC_CRIS_SIGNED_8' value='1663'/>
      <enumerator name='BFD_RELOC_CRIS_UNSIGNED_8' value='1664'/>
      <enumerator name='BFD_RELOC_CRIS_SIGNED_16' value='1665'/>
      <enumerator name='BFD_RELOC_CRIS_UNSIGNED_16' value='1666'/>
      <enumerator name='BFD_RELOC_CRIS_LAPCQ_OFFSET' value='1667'/>
      <enumerator name='BFD_RELOC_CRIS_UNSIGNED_4' value='1668'/>
      <enumerator name='BFD_RELOC_CRIS_COPY' value='1669'/>
      <enumerator name='BFD_RELOC_CRIS_GLOB_DAT' value='1670'/>
      <enumerator name='BFD_RELOC_CRIS_JUMP_SLOT' value='1671'/>
      <enumerator name='BFD_RELOC_CRIS_RELATIVE' value='1672'/>
      <enumerator name='BFD_RELOC_CRIS_32_GOT' value='1673'/>
      <enumerator name='BFD_RELOC_CRIS_16_GOT' value='1674'/>
      <enumerator name='BFD_RELOC_CRIS_32_GOTPLT' value='1675'/>
      <enumerator name='BFD_RELOC_CRIS_16_GOTPLT' value='1676'/>
      <enumerator name='BFD_RELOC_CRIS_32_GOTREL' value='1677'/>
      <enumerator name='BFD_RELOC_CRIS_32_PLT_GOTREL' value='1678'/>
      <enumerator name='BFD_RELOC_CRIS_32_PLT_PCREL' value='1679'/>
      <enumerator name='BFD_RELOC_CRIS_32_GOT_GD' value='1680'/>
      <enumerator name='BFD_RELOC_CRIS_16_GOT_GD' value='1681'/>
      <enumerator name='BFD_RELOC_CRIS_32_GD' value='1682'/>
      <enumerator name='BFD_RELOC_CRIS_DTP' value='1683'/>
      <enumerator name='BFD_RELOC_CRIS_32_DTPREL' value='1684'/>
      <enumerator name='BFD_RELOC_CRIS_16_DTPREL' value='1685'/>
      <enumerator name='BFD_RELOC_CRIS_32_GOT_TPREL' value='1686'/>
      <enumerator name='BFD_RELOC_CRIS_16_GOT_TPREL' value='1687'/>
      <enumerator name='BFD_RELOC_CRIS_32_TPREL' value='1688'/>
      <enumerator name='BFD_RELOC_CRIS_16_TPREL' value='1689'/>
      <enumerator name='BFD_RELOC_CRIS_DTPMOD' value='1690'/>
      <enumerator name='BFD_RELOC_CRIS_32_IE' value='1691'/>
      <enumerator name='BFD_RELOC_OR1K_REL_26' value='1692'/>
      <enumerator name='BFD_RELOC_OR1K_SLO16' value='1693'/>
      <enumerator name='BFD_RELOC_OR1K_PCREL_PG21' value='1694'/>
      <enumerator name='BFD_RELOC_OR1K_LO13' value='1695'/>
      <enumerator name='BFD_RELOC_OR1K_SLO13' value='1696'/>
      <enumerator name='BFD_RELOC_OR1K_GOTPC_HI16' value='1697'/>
      <enumerator name='BFD_RELOC_OR1K_GOTPC_LO16' value='1698'/>
      <enumerator name='BFD_RELOC_OR1K_GOT16' value='1699'/>
      <enumerator name='BFD_RELOC_OR1K_GOT_PG21' value='1700'/>
      <enumerator name='BFD_RELOC_OR1K_GOT_LO13' value='1701'/>
      <enumerator name='BFD_RELOC_OR1K_PLT26' value='1702'/>
      <enumerator name='BFD_RELOC_OR1K_PLTA26' value='1703'/>
      <enumerator name='BFD_RELOC_OR1K_GOTOFF_SLO16' value='1704'/>
      <enumerator name='BFD_RELOC_OR1K_COPY' value='1705'/>
      <enumerator name='BFD_RELOC_OR1K_GLOB_DAT' value='1706'/>
      <enumerator name='BFD_RELOC_OR1K_JMP_SLOT' value='1707'/>
      <enumerator name='BFD_RELOC_OR1K_RELATIVE' value='1708'/>
      <enumerator name='BFD_RELOC_OR1K_TLS_GD_HI16' value='1709'/>
      <enumerator name='BFD_RELOC_OR1K_TLS_GD_LO16' value='1710'/>
      <enumerator name='BFD_RELOC_OR1K_TLS_GD_PG21' value='1711'/>
      <enumerator name='BFD_RELOC_OR1K_TLS_GD_LO13' value='1712'/>
      <enumerator name='BFD_RELOC_OR1K_TLS_LDM_HI16' value='1713'/>
      <enumerator name='BFD_RELOC_OR1K_TLS_LDM_LO16' value='1714'/>
      <enumerator name='BFD_RELOC_OR1K_TLS_LDM_PG21' value='1715'/>
      <enumerator name='BFD_RELOC_OR1K_TLS_LDM_LO13' value='1716'/>
      <enumerator name='BFD_RELOC_OR1K_TLS_LDO_HI16' value='1717'/>
      <enumerator name='BFD_RELOC_OR1K_TLS_LDO_LO16' value='1718'/>
      <enumerator name='BFD_RELOC_OR1K_TLS_IE_HI16' value='1719'/>
      <enumerator name='BFD_RELOC_OR1K_TLS_IE_AHI16' value='1720'/>
      <enumerator name='BFD_RELOC_OR1K_TLS_IE_LO16' value='1721'/>
      <enumerator name='BFD_RELOC_OR1K_TLS_IE_PG21' value='1722'/>
      <enumerator name='BFD_RELOC_OR1K_TLS_IE_LO13' value='1723'/>
      <enumerator name='BFD_RELOC_OR1K_TLS_LE_HI16' value='1724'/>
      <enumerator name='BFD_RELOC_OR1K_TLS_LE_AHI16' value='1725'/>
      <enumerator name='BFD_RELOC_OR1K_TLS_LE_LO16' value='1726'/>
      <enumerator name='BFD_RELOC_OR1K_TLS_LE_SLO16' value='1727'/>
      <enumerator name='BFD_RELOC_OR1K_TLS_TPOFF' value='1728'/>
      <enumerator name='BFD_RELOC_OR1K_TLS_DTPOFF' value='1729'/>
      <enumerator name='BFD_RELOC_OR1K_TLS_DTPMOD' value='1730'/>
      <enumerator name='BFD_RELOC_H8_DIR16A8' value='1731'/>
      <enumerator name='BFD_RELOC_H8_DIR16R8' value='1732'/>
      <enumerator name='BFD_RELOC_H8_DIR24A8' value='1733'/>
      <enumerator name='BFD_RELOC_H8_DIR24R8' value='1734'/>
      <enumerator name='BFD_RELOC_H8_DIR32A16' value='1735'/>
      <enumerator name='BFD_RELOC_H8_DISP32A16' value='1736'/>
      <enumerator name='BFD_RELOC_XSTORMY16_REL_12' value='1737'/>
      <enumerator name='BFD_RELOC_XSTORMY16_12' value='1738'/>
      <enumerator name='BFD_RELOC_XSTORMY16_24' value='1739'/>
      <enumerator name='BFD_RELOC_XSTORMY16_FPTR16' value='1740'/>
      <enumerator name='BFD_RELOC_RELC' value='1741'/>
      <enumerator name='BFD_RELOC_XC16X_PAG' value='1742'/>
      <enumerator name='BFD_RELOC_XC16X_POF' value='1743'/>
      <enumerator name='BFD_RELOC_XC16X_SEG' value='1744'/>
      <enumerator name='BFD_RELOC_XC16X_SOF' value='1745'/>
      <enumerator name='BFD_RELOC_VAX_GLOB_DAT' value='1746'/>
      <enumerator name='BFD_RELOC_VAX_JMP_SLOT' value='1747'/>
      <enumerator name='BFD_RELOC_VAX_RELATIVE' value='1748'/>
      <enumerator name='BFD_RELOC_MT_PC16' value='1749'/>
      <enumerator name='BFD_RELOC_MT_HI16' value='1750'/>
      <enumerator name='BFD_RELOC_MT_LO16' value='1751'/>
      <enumerator name='BFD_RELOC_MT_GNU_VTINHERIT' value='1752'/>
      <enumerator name='BFD_RELOC_MT_GNU_VTENTRY' value='1753'/>
      <enumerator name='BFD_RELOC_MT_PCINSN8' value='1754'/>
      <enumerator name='BFD_RELOC_MSP430_10_PCREL' value='1755'/>
      <enumerator name='BFD_RELOC_MSP430_16_PCREL' value='1756'/>
      <enumerator name='BFD_RELOC_MSP430_16' value='1757'/>
      <enumerator name='BFD_RELOC_MSP430_16_PCREL_BYTE' value='1758'/>
      <enumerator name='BFD_RELOC_MSP430_16_BYTE' value='1759'/>
      <enumerator name='BFD_RELOC_MSP430_2X_PCREL' value='1760'/>
      <enumerator name='BFD_RELOC_MSP430_RL_PCREL' value='1761'/>
      <enumerator name='BFD_RELOC_MSP430_ABS8' value='1762'/>
      <enumerator name='BFD_RELOC_MSP430X_PCR20_EXT_SRC' value='1763'/>
      <enumerator name='BFD_RELOC_MSP430X_PCR20_EXT_DST' value='1764'/>
      <enumerator name='BFD_RELOC_MSP430X_PCR20_EXT_ODST' value='1765'/>
      <enumerator name='BFD_RELOC_MSP430X_ABS20_EXT_SRC' value='1766'/>
      <enumerator name='BFD_RELOC_MSP430X_ABS20_EXT_DST' value='1767'/>
      <enumerator name='BFD_RELOC_MSP430X_ABS20_EXT_ODST' value='1768'/>
      <enumerator name='BFD_RELOC_MSP430X_ABS20_ADR_SRC' value='1769'/>
      <enumerator name='BFD_RELOC_MSP430X_ABS20_ADR_DST' value='1770'/>
      <enumerator name='BFD_RELOC_MSP430X_PCR16' value='1771'/>
      <enumerator name='BFD_RELOC_MSP430X_PCR20_CALL' value='1772'/>
      <enumerator name='BFD_RELOC_MSP430X_ABS16' value='1773'/>
      <enumerator name='BFD_RELOC_MSP430_ABS_HI16' value='1774'/>
      <enumerator name='BFD_RELOC_MSP430_PREL31' value='1775'/>
      <enumerator name='BFD_RELOC_MSP430_SYM_DIFF' value='1776'/>
      <enumerator name='BFD_RELOC_NIOS2_S16' value='1777'/>
      <enumerator name='BFD_RELOC_NIOS2_U16' value='1778'/>
      <enumerator name='BFD_RELOC_NIOS2_CALL26' value='1779'/>
      <enumerator name='BFD_RELOC_NIOS2_IMM5' value='1780'/>
      <enumerator name='BFD_RELOC_NIOS2_CACHE_OPX' value='1781'/>
      <enumerator name='BFD_RELOC_NIOS2_IMM6' value='1782'/>
      <enumerator name='BFD_RELOC_NIOS2_IMM8' value='1783'/>
      <enumerator name='BFD_RELOC_NIOS2_HI16' value='1784'/>
      <enumerator name='BFD_RELOC_NIOS2_LO16' value='1785'/>
      <enumerator name='BFD_RELOC_NIOS2_HIADJ16' value='1786'/>
      <enumerator name='BFD_RELOC_NIOS2_GPREL' value='1787'/>
      <enumerator name='BFD_RELOC_NIOS2_UJMP' value='1788'/>
      <enumerator name='BFD_RELOC_NIOS2_CJMP' value='1789'/>
      <enumerator name='BFD_RELOC_NIOS2_CALLR' value='1790'/>
      <enumerator name='BFD_RELOC_NIOS2_ALIGN' value='1791'/>
      <enumerator name='BFD_RELOC_NIOS2_GOT16' value='1792'/>
      <enumerator name='BFD_RELOC_NIOS2_CALL16' value='1793'/>
      <enumerator name='BFD_RELOC_NIOS2_GOTOFF_LO' value='1794'/>
      <enumerator name='BFD_RELOC_NIOS2_GOTOFF_HA' value='1795'/>
      <enumerator name='BFD_RELOC_NIOS2_PCREL_LO' value='1796'/>
      <enumerator name='BFD_RELOC_NIOS2_PCREL_HA' value='1797'/>
      <enumerator name='BFD_RELOC_NIOS2_TLS_GD16' value='1798'/>
      <enumerator name='BFD_RELOC_NIOS2_TLS_LDM16' value='1799'/>
      <enumerator name='BFD_RELOC_NIOS2_TLS_LDO16' value='1800'/>
      <enumerator name='BFD_RELOC_NIOS2_TLS_IE16' value='1801'/>
      <enumerator name='BFD_RELOC_NIOS2_TLS_LE16' value='1802'/>
      <enumerator name='BFD_RELOC_NIOS2_TLS_DTPMOD' value='1803'/>
      <enumerator name='BFD_RELOC_NIOS2_TLS_DTPREL' value='1804'/>
      <enumerator name='BFD_RELOC_NIOS2_TLS_TPREL' value='1805'/>
      <enumerator name='BFD_RELOC_NIOS2_COPY' value='1806'/>
      <enumerator name='BFD_RELOC_NIOS2_GLOB_DAT' value='1807'/>
      <enumerator name='BFD_RELOC_NIOS2_JUMP_SLOT' value='1808'/>
      <enumerator name='BFD_RELOC_NIOS2_RELATIVE' value='1809'/>
      <enumerator name='BFD_RELOC_NIOS2_GOTOFF' value='1810'/>
      <enumerator name='BFD_RELOC_NIOS2_CALL26_NOAT' value='1811'/>
      <enumerator name='BFD_RELOC_NIOS2_GOT_LO' value='1812'/>
      <enumerator name='BFD_RELOC_NIOS2_GOT_HA' value='1813'/>
      <enumerator name='BFD_RELOC_NIOS2_CALL_LO' value='1814'/>
      <enumerator name='BFD_RELOC_NIOS2_CALL_HA' value='1815'/>
      <enumerator name='BFD_RELOC_NIOS2_R2_S12' value='1816'/>
      <enumerator name='BFD_RELOC_NIOS2_R2_I10_1_PCREL' value='1817'/>
      <enumerator name='BFD_RELOC_NIOS2_R2_T1I7_1_PCREL' value='1818'/>
      <enumerator name='BFD_RELOC_NIOS2_R2_T1I7_2' value='1819'/>
      <enumerator name='BFD_RELOC_NIOS2_R2_T2I4' value='1820'/>
      <enumerator name='BFD_RELOC_NIOS2_R2_T2I4_1' value='1821'/>
      <enumerator name='BFD_RELOC_NIOS2_R2_T2I4_2' value='1822'/>
      <enumerator name='BFD_RELOC_NIOS2_R2_X1I7_2' value='1823'/>
      <enumerator name='BFD_RELOC_NIOS2_R2_X2L5' value='1824'/>
      <enumerator name='BFD_RELOC_NIOS2_R2_F1I5_2' value='1825'/>
      <enumerator name='BFD_RELOC_NIOS2_R2_L5I4X1' value='1826'/>
      <enumerator name='BFD_RELOC_NIOS2_R2_T1X1I6' value='1827'/>
      <enumerator name='BFD_RELOC_NIOS2_R2_T1X1I6_2' value='1828'/>
      <enumerator name='BFD_RELOC_PRU_U16' value='1829'/>
      <enumerator name='BFD_RELOC_PRU_U16_PMEMIMM' value='1830'/>
      <enumerator name='BFD_RELOC_PRU_LDI32' value='1831'/>
      <enumerator name='BFD_RELOC_PRU_S10_PCREL' value='1832'/>
      <enumerator name='BFD_RELOC_PRU_U8_PCREL' value='1833'/>
      <enumerator name='BFD_RELOC_PRU_32_PMEM' value='1834'/>
      <enumerator name='BFD_RELOC_PRU_16_PMEM' value='1835'/>
      <enumerator name='BFD_RELOC_PRU_GNU_DIFF8' value='1836'/>
      <enumerator name='BFD_RELOC_PRU_GNU_DIFF16' value='1837'/>
      <enumerator name='BFD_RELOC_PRU_GNU_DIFF32' value='1838'/>
      <enumerator name='BFD_RELOC_PRU_GNU_DIFF16_PMEM' value='1839'/>
      <enumerator name='BFD_RELOC_PRU_GNU_DIFF32_PMEM' value='1840'/>
      <enumerator name='BFD_RELOC_IQ2000_OFFSET_16' value='1841'/>
      <enumerator name='BFD_RELOC_IQ2000_OFFSET_21' value='1842'/>
      <enumerator name='BFD_RELOC_IQ2000_UHI16' value='1843'/>
      <enumerator name='BFD_RELOC_XTENSA_RTLD' value='1844'/>
      <enumerator name='BFD_RELOC_XTENSA_GLOB_DAT' value='1845'/>
      <enumerator name='BFD_RELOC_XTENSA_JMP_SLOT' value='1846'/>
      <enumerator name='BFD_RELOC_XTENSA_RELATIVE' value='1847'/>
      <enumerator name='BFD_RELOC_XTENSA_PLT' value='1848'/>
      <enumerator name='BFD_RELOC_XTENSA_DIFF8' value='1849'/>
      <enumerator name='BFD_RELOC_XTENSA_DIFF16' value='1850'/>
      <enumerator name='BFD_RELOC_XTENSA_DIFF32' value='1851'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT0_OP' value='1852'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT1_OP' value='1853'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT2_OP' value='1854'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT3_OP' value='1855'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT4_OP' value='1856'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT5_OP' value='1857'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT6_OP' value='1858'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT7_OP' value='1859'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT8_OP' value='1860'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT9_OP' value='1861'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT10_OP' value='1862'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT11_OP' value='1863'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT12_OP' value='1864'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT13_OP' value='1865'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT14_OP' value='1866'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT0_ALT' value='1867'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT1_ALT' value='1868'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT2_ALT' value='1869'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT3_ALT' value='1870'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT4_ALT' value='1871'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT5_ALT' value='1872'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT6_ALT' value='1873'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT7_ALT' value='1874'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT8_ALT' value='1875'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT9_ALT' value='1876'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT10_ALT' value='1877'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT11_ALT' value='1878'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT12_ALT' value='1879'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT13_ALT' value='1880'/>
      <enumerator name='BFD_RELOC_XTENSA_SLOT14_ALT' value='1881'/>
      <enumerator name='BFD_RELOC_XTENSA_OP0' value='1882'/>
      <enumerator name='BFD_RELOC_XTENSA_OP1' value='1883'/>
      <enumerator name='BFD_RELOC_XTENSA_OP2' value='1884'/>
      <enumerator name='BFD_RELOC_XTENSA_ASM_EXPAND' value='1885'/>
      <enumerator name='BFD_RELOC_XTENSA_ASM_SIMPLIFY' value='1886'/>
      <enumerator name='BFD_RELOC_XTENSA_TLSDESC_FN' value='1887'/>
      <enumerator name='BFD_RELOC_XTENSA_TLSDESC_ARG' value='1888'/>
      <enumerator name='BFD_RELOC_XTENSA_TLS_DTPOFF' value='1889'/>
      <enumerator name='BFD_RELOC_XTENSA_TLS_TPOFF' value='1890'/>
      <enumerator name='BFD_RELOC_XTENSA_TLS_FUNC' value='1891'/>
      <enumerator name='BFD_RELOC_XTENSA_TLS_ARG' value='1892'/>
      <enumerator name='BFD_RELOC_XTENSA_TLS_CALL' value='1893'/>
      <enumerator name='BFD_RELOC_XTENSA_PDIFF8' value='1894'/>
      <enumerator name='BFD_RELOC_XTENSA_PDIFF16' value='1895'/>
      <enumerator name='BFD_RELOC_XTENSA_PDIFF32' value='1896'/>
      <enumerator name='BFD_RELOC_XTENSA_NDIFF8' value='1897'/>
      <enumerator name='BFD_RELOC_XTENSA_NDIFF16' value='1898'/>
      <enumerator name='BFD_RELOC_XTENSA_NDIFF32' value='1899'/>
      <enumerator name='BFD_RELOC_Z80_DISP8' value='1900'/>
      <enumerator name='BFD_RELOC_Z80_BYTE0' value='1901'/>
      <enumerator name='BFD_RELOC_Z80_BYTE1' value='1902'/>
      <enumerator name='BFD_RELOC_Z80_BYTE2' value='1903'/>
      <enumerator name='BFD_RELOC_Z80_BYTE3' value='1904'/>
      <enumerator name='BFD_RELOC_Z80_WORD0' value='1905'/>
      <enumerator name='BFD_RELOC_Z80_WORD1' value='1906'/>
      <enumerator name='BFD_RELOC_Z80_16_BE' value='1907'/>
      <enumerator name='BFD_RELOC_Z8K_DISP7' value='1908'/>
      <enumerator name='BFD_RELOC_Z8K_CALLR' value='1909'/>
      <enumerator name='BFD_RELOC_Z8K_IMM4L' value='1910'/>
      <enumerator name='BFD_RELOC_LM32_CALL' value='1911'/>
      <enumerator name='BFD_RELOC_LM32_BRANCH' value='1912'/>
      <enumerator name='BFD_RELOC_LM32_16_GOT' value='1913'/>
      <enumerator name='BFD_RELOC_LM32_GOTOFF_HI16' value='1914'/>
      <enumerator name='BFD_RELOC_LM32_GOTOFF_LO16' value='1915'/>
      <enumerator name='BFD_RELOC_LM32_COPY' value='1916'/>
      <enumerator name='BFD_RELOC_LM32_GLOB_DAT' value='1917'/>
      <enumerator name='BFD_RELOC_LM32_JMP_SLOT' value='1918'/>
      <enumerator name='BFD_RELOC_LM32_RELATIVE' value='1919'/>
      <enumerator name='BFD_RELOC_MACH_O_SECTDIFF' value='1920'/>
      <enumerator name='BFD_RELOC_MACH_O_LOCAL_SECTDIFF' value='1921'/>
      <enumerator name='BFD_RELOC_MACH_O_PAIR' value='1922'/>
      <enumerator name='BFD_RELOC_MACH_O_SUBTRACTOR32' value='1923'/>
      <enumerator name='BFD_RELOC_MACH_O_SUBTRACTOR64' value='1924'/>
      <enumerator name='BFD_RELOC_MACH_O_X86_64_BRANCH32' value='1925'/>
      <enumerator name='BFD_RELOC_MACH_O_X86_64_BRANCH8' value='1926'/>
      <enumerator name='BFD_RELOC_MACH_O_X86_64_GOT' value='1927'/>
      <enumerator name='BFD_RELOC_MACH_O_X86_64_GOT_LOAD' value='1928'/>
      <enumerator name='BFD_RELOC_MACH_O_X86_64_PCREL32_1' value='1929'/>
      <enumerator name='BFD_RELOC_MACH_O_X86_64_PCREL32_2' value='1930'/>
      <enumerator name='BFD_RELOC_MACH_O_X86_64_PCREL32_4' value='1931'/>
      <enumerator name='BFD_RELOC_MACH_O_X86_64_TLV' value='1932'/>
      <enumerator name='BFD_RELOC_MACH_O_ARM64_ADDEND' value='1933'/>
      <enumerator name='BFD_RELOC_MACH_O_ARM64_GOT_LOAD_PAGE21' value='1934'/>
      <enumerator name='BFD_RELOC_MACH_O_ARM64_GOT_LOAD_PAGEOFF12' value='1935'/>
      <enumerator name='BFD_RELOC_MACH_O_ARM64_POINTER_TO_GOT' value='1936'/>
      <enumerator name='BFD_RELOC_MICROBLAZE_32_LO' value='1937'/>
      <enumerator name='BFD_RELOC_MICROBLAZE_32_LO_PCREL' value='1938'/>
      <enumerator name='BFD_RELOC_MICROBLAZE_32_ROSDA' value='1939'/>
      <enumerator name='BFD_RELOC_MICROBLAZE_32_RWSDA' value='1940'/>
      <enumerator name='BFD_RELOC_MICROBLAZE_32_SYM_OP_SYM' value='1941'/>
      <enumerator name='BFD_RELOC_MICROBLAZE_64_NONE' value='1942'/>
      <enumerator name='BFD_RELOC_MICROBLAZE_64_GOTPC' value='1943'/>
      <enumerator name='BFD_RELOC_MICROBLAZE_64_GOT' value='1944'/>
      <enumerator name='BFD_RELOC_MICROBLAZE_64_PLT' value='1945'/>
      <enumerator name='BFD_RELOC_MICROBLAZE_64_GOTOFF' value='1946'/>
      <enumerator name='BFD_RELOC_MICROBLAZE_32_GOTOFF' value='1947'/>
      <enumerator name='BFD_RELOC_MICROBLAZE_COPY' value='1948'/>
      <enumerator name='BFD_RELOC_MICROBLAZE_64_TLS' value='1949'/>
      <enumerator name='BFD_RELOC_MICROBLAZE_64_TLSGD' value='1950'/>
      <enumerator name='BFD_RELOC_MICROBLAZE_64_TLSLD' value='1951'/>
      <enumerator name='BFD_RELOC_MICROBLAZE_32_TLSDTPMOD' value='1952'/>
      <enumerator name='BFD_RELOC_MICROBLAZE_32_TLSDTPREL' value='1953'/>
      <enumerator name='BFD_RELOC_MICROBLAZE_64_TLSDTPREL' value='1954'/>
      <enumerator name='BFD_RELOC_MICROBLAZE_64_TLSGOTTPREL' value='1955'/>
      <enumerator name='BFD_RELOC_MICROBLAZE_64_TLSTPREL' value='1956'/>
      <enumerator name='BFD_RELOC_MICROBLAZE_64_TEXTPCREL' value='1957'/>
      <enumerator name='BFD_RELOC_MICROBLAZE_64_TEXTREL' value='1958'/>
      <enumerator name='BFD_RELOC_AARCH64_RELOC_START' value='1959'/>
      <enumerator name='BFD_RELOC_AARCH64_NULL' value='1960'/>
      <enumerator name='BFD_RELOC_AARCH64_NONE' value='1961'/>
      <enumerator name='BFD_RELOC_AARCH64_64' value='1962'/>
      <enumerator name='BFD_RELOC_AARCH64_32' value='1963'/>
      <enumerator name='BFD_RELOC_AARCH64_16' value='1964'/>
      <enumerator name='BFD_RELOC_AARCH64_64_PCREL' value='1965'/>
      <enumerator name='BFD_RELOC_AARCH64_32_PCREL' value='1966'/>
      <enumerator name='BFD_RELOC_AARCH64_16_PCREL' value='1967'/>
      <enumerator name='BFD_RELOC_AARCH64_MOVW_G0' value='1968'/>
      <enumerator name='BFD_RELOC_AARCH64_MOVW_G0_NC' value='1969'/>
      <enumerator name='BFD_RELOC_AARCH64_MOVW_G1' value='1970'/>
      <enumerator name='BFD_RELOC_AARCH64_MOVW_G1_NC' value='1971'/>
      <enumerator name='BFD_RELOC_AARCH64_MOVW_G2' value='1972'/>
      <enumerator name='BFD_RELOC_AARCH64_MOVW_G2_NC' value='1973'/>
      <enumerator name='BFD_RELOC_AARCH64_MOVW_G3' value='1974'/>
      <enumerator name='BFD_RELOC_AARCH64_MOVW_G0_S' value='1975'/>
      <enumerator name='BFD_RELOC_AARCH64_MOVW_G1_S' value='1976'/>
      <enumerator name='BFD_RELOC_AARCH64_MOVW_G2_S' value='1977'/>
      <enumerator name='BFD_RELOC_AARCH64_MOVW_PREL_G0' value='1978'/>
      <enumerator name='BFD_RELOC_AARCH64_MOVW_PREL_G0_NC' value='1979'/>
      <enumerator name='BFD_RELOC_AARCH64_MOVW_PREL_G1' value='1980'/>
      <enumerator name='BFD_RELOC_AARCH64_MOVW_PREL_G1_NC' value='1981'/>
      <enumerator name='BFD_RELOC_AARCH64_MOVW_PREL_G2' value='1982'/>
      <enumerator name='BFD_RELOC_AARCH64_MOVW_PREL_G2_NC' value='1983'/>
      <enumerator name='BFD_RELOC_AARCH64_MOVW_PREL_G3' value='1984'/>
      <enumerator name='BFD_RELOC_AARCH64_LD_LO19_PCREL' value='1985'/>
      <enumerator name='BFD_RELOC_AARCH64_ADR_LO21_PCREL' value='1986'/>
      <enumerator name='BFD_RELOC_AARCH64_ADR_HI21_PCREL' value='1987'/>
      <enumerator name='BFD_RELOC_AARCH64_ADR_HI21_NC_PCREL' value='1988'/>
      <enumerator name='BFD_RELOC_AARCH64_ADD_LO12' value='1989'/>
      <enumerator name='BFD_RELOC_AARCH64_LDST8_LO12' value='1990'/>
      <enumerator name='BFD_RELOC_AARCH64_TSTBR14' value='1991'/>
      <enumerator name='BFD_RELOC_AARCH64_BRANCH19' value='1992'/>
      <enumerator name='BFD_RELOC_AARCH64_JUMP26' value='1993'/>
      <enumerator name='BFD_RELOC_AARCH64_CALL26' value='1994'/>
      <enumerator name='BFD_RELOC_AARCH64_LDST16_LO12' value='1995'/>
      <enumerator name='BFD_RELOC_AARCH64_LDST32_LO12' value='1996'/>
      <enumerator name='BFD_RELOC_AARCH64_LDST64_LO12' value='1997'/>
      <enumerator name='BFD_RELOC_AARCH64_LDST128_LO12' value='1998'/>
      <enumerator name='BFD_RELOC_AARCH64_GOT_LD_PREL19' value='1999'/>
      <enumerator name='BFD_RELOC_AARCH64_ADR_GOT_PAGE' value='2000'/>
      <enumerator name='BFD_RELOC_AARCH64_LD64_GOT_LO12_NC' value='2001'/>
      <enumerator name='BFD_RELOC_AARCH64_LD32_GOT_LO12_NC' value='2002'/>
      <enumerator name='BFD_RELOC_AARCH64_MOVW_GOTOFF_G0_NC' value='2003'/>
      <enumerator name='BFD_RELOC_AARCH64_MOVW_GOTOFF_G1' value='2004'/>
      <enumerator name='BFD_RELOC_AARCH64_LD64_GOTOFF_LO15' value='2005'/>
      <enumerator name='BFD_RELOC_AARCH64_LD32_GOTPAGE_LO14' value='2006'/>
      <enumerator name='BFD_RELOC_AARCH64_LD64_GOTPAGE_LO15' value='2007'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSGD_ADR_PAGE21' value='2008'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSGD_ADR_PREL21' value='2009'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSGD_ADD_LO12_NC' value='2010'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSGD_MOVW_G0_NC' value='2011'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSGD_MOVW_G1' value='2012'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSIE_ADR_GOTTPREL_PAGE21' value='2013'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSIE_LD64_GOTTPREL_LO12_NC' value='2014'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSIE_LD32_GOTTPREL_LO12_NC' value='2015'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSIE_LD_GOTTPREL_PREL19' value='2016'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSIE_MOVW_GOTTPREL_G0_NC' value='2017'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSIE_MOVW_GOTTPREL_G1' value='2018'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLD_ADD_DTPREL_HI12' value='2019'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLD_ADD_DTPREL_LO12' value='2020'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLD_ADD_DTPREL_LO12_NC' value='2021'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLD_ADD_LO12_NC' value='2022'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLD_ADR_PAGE21' value='2023'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLD_ADR_PREL21' value='2024'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLD_LDST16_DTPREL_LO12' value='2025'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLD_LDST16_DTPREL_LO12_NC' value='2026'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLD_LDST32_DTPREL_LO12' value='2027'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLD_LDST32_DTPREL_LO12_NC' value='2028'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLD_LDST64_DTPREL_LO12' value='2029'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLD_LDST64_DTPREL_LO12_NC' value='2030'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLD_LDST8_DTPREL_LO12' value='2031'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLD_LDST8_DTPREL_LO12_NC' value='2032'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLD_MOVW_DTPREL_G0' value='2033'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLD_MOVW_DTPREL_G0_NC' value='2034'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLD_MOVW_DTPREL_G1' value='2035'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLD_MOVW_DTPREL_G1_NC' value='2036'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLD_MOVW_DTPREL_G2' value='2037'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLE_MOVW_TPREL_G2' value='2038'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLE_MOVW_TPREL_G1' value='2039'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLE_MOVW_TPREL_G1_NC' value='2040'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLE_MOVW_TPREL_G0' value='2041'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLE_MOVW_TPREL_G0_NC' value='2042'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLE_ADD_TPREL_HI12' value='2043'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLE_ADD_TPREL_LO12' value='2044'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLE_ADD_TPREL_LO12_NC' value='2045'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLE_LDST16_TPREL_LO12' value='2046'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLE_LDST16_TPREL_LO12_NC' value='2047'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLE_LDST32_TPREL_LO12' value='2048'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLE_LDST32_TPREL_LO12_NC' value='2049'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLE_LDST64_TPREL_LO12' value='2050'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLE_LDST64_TPREL_LO12_NC' value='2051'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLE_LDST8_TPREL_LO12' value='2052'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLE_LDST8_TPREL_LO12_NC' value='2053'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSDESC_LD_PREL19' value='2054'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSDESC_ADR_PREL21' value='2055'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSDESC_ADR_PAGE21' value='2056'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSDESC_LD64_LO12' value='2057'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSDESC_LD32_LO12_NC' value='2058'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSDESC_ADD_LO12' value='2059'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSDESC_OFF_G1' value='2060'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSDESC_OFF_G0_NC' value='2061'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSDESC_LDR' value='2062'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSDESC_ADD' value='2063'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSDESC_CALL' value='2064'/>
      <enumerator name='BFD_RELOC_AARCH64_COPY' value='2065'/>
      <enumerator name='BFD_RELOC_AARCH64_GLOB_DAT' value='2066'/>
      <enumerator name='BFD_RELOC_AARCH64_JUMP_SLOT' value='2067'/>
      <enumerator name='BFD_RELOC_AARCH64_RELATIVE' value='2068'/>
      <enumerator name='BFD_RELOC_AARCH64_TLS_DTPMOD' value='2069'/>
      <enumerator name='BFD_RELOC_AARCH64_TLS_DTPREL' value='2070'/>
      <enumerator name='BFD_RELOC_AARCH64_TLS_TPREL' value='2071'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSDESC' value='2072'/>
      <enumerator name='BFD_RELOC_AARCH64_IRELATIVE' value='2073'/>
      <enumerator name='BFD_RELOC_AARCH64_RELOC_END' value='2074'/>
      <enumerator name='BFD_RELOC_AARCH64_GAS_INTERNAL_FIXUP' value='2075'/>
      <enumerator name='BFD_RELOC_AARCH64_LDST_LO12' value='2076'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLD_LDST_DTPREL_LO12' value='2077'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLD_LDST_DTPREL_LO12_NC' value='2078'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLE_LDST_TPREL_LO12' value='2079'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSLE_LDST_TPREL_LO12_NC' value='2080'/>
      <enumerator name='BFD_RELOC_AARCH64_LD_GOT_LO12_NC' value='2081'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSIE_LD_GOTTPREL_LO12_NC' value='2082'/>
      <enumerator name='BFD_RELOC_AARCH64_TLSDESC_LD_LO12_NC' value='2083'/>
      <enumerator name='BFD_RELOC_TILEPRO_COPY' value='2084'/>
      <enumerator name='BFD_RELOC_TILEPRO_GLOB_DAT' value='2085'/>
      <enumerator name='BFD_RELOC_TILEPRO_JMP_SLOT' value='2086'/>
      <enumerator name='BFD_RELOC_TILEPRO_RELATIVE' value='2087'/>
      <enumerator name='BFD_RELOC_TILEPRO_BROFF_X1' value='2088'/>
      <enumerator name='BFD_RELOC_TILEPRO_JOFFLONG_X1' value='2089'/>
      <enumerator name='BFD_RELOC_TILEPRO_JOFFLONG_X1_PLT' value='2090'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM8_X0' value='2091'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM8_Y0' value='2092'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM8_X1' value='2093'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM8_Y1' value='2094'/>
      <enumerator name='BFD_RELOC_TILEPRO_DEST_IMM8_X1' value='2095'/>
      <enumerator name='BFD_RELOC_TILEPRO_MT_IMM15_X1' value='2096'/>
      <enumerator name='BFD_RELOC_TILEPRO_MF_IMM15_X1' value='2097'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X0' value='2098'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X1' value='2099'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X0_LO' value='2100'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X1_LO' value='2101'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X0_HI' value='2102'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X1_HI' value='2103'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X0_HA' value='2104'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X1_HA' value='2105'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X0_PCREL' value='2106'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X1_PCREL' value='2107'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X0_LO_PCREL' value='2108'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X1_LO_PCREL' value='2109'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X0_HI_PCREL' value='2110'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X1_HI_PCREL' value='2111'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X0_HA_PCREL' value='2112'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X1_HA_PCREL' value='2113'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X0_GOT' value='2114'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X1_GOT' value='2115'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X0_GOT_LO' value='2116'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X1_GOT_LO' value='2117'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X0_GOT_HI' value='2118'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X1_GOT_HI' value='2119'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X0_GOT_HA' value='2120'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X1_GOT_HA' value='2121'/>
      <enumerator name='BFD_RELOC_TILEPRO_MMSTART_X0' value='2122'/>
      <enumerator name='BFD_RELOC_TILEPRO_MMEND_X0' value='2123'/>
      <enumerator name='BFD_RELOC_TILEPRO_MMSTART_X1' value='2124'/>
      <enumerator name='BFD_RELOC_TILEPRO_MMEND_X1' value='2125'/>
      <enumerator name='BFD_RELOC_TILEPRO_SHAMT_X0' value='2126'/>
      <enumerator name='BFD_RELOC_TILEPRO_SHAMT_X1' value='2127'/>
      <enumerator name='BFD_RELOC_TILEPRO_SHAMT_Y0' value='2128'/>
      <enumerator name='BFD_RELOC_TILEPRO_SHAMT_Y1' value='2129'/>
      <enumerator name='BFD_RELOC_TILEPRO_TLS_GD_CALL' value='2130'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM8_X0_TLS_GD_ADD' value='2131'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM8_X1_TLS_GD_ADD' value='2132'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM8_Y0_TLS_GD_ADD' value='2133'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM8_Y1_TLS_GD_ADD' value='2134'/>
      <enumerator name='BFD_RELOC_TILEPRO_TLS_IE_LOAD' value='2135'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X0_TLS_GD' value='2136'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X1_TLS_GD' value='2137'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X0_TLS_GD_LO' value='2138'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X1_TLS_GD_LO' value='2139'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X0_TLS_GD_HI' value='2140'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X1_TLS_GD_HI' value='2141'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X0_TLS_GD_HA' value='2142'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X1_TLS_GD_HA' value='2143'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X0_TLS_IE' value='2144'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X1_TLS_IE' value='2145'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X0_TLS_IE_LO' value='2146'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X1_TLS_IE_LO' value='2147'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X0_TLS_IE_HI' value='2148'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X1_TLS_IE_HI' value='2149'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X0_TLS_IE_HA' value='2150'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X1_TLS_IE_HA' value='2151'/>
      <enumerator name='BFD_RELOC_TILEPRO_TLS_DTPMOD32' value='2152'/>
      <enumerator name='BFD_RELOC_TILEPRO_TLS_DTPOFF32' value='2153'/>
      <enumerator name='BFD_RELOC_TILEPRO_TLS_TPOFF32' value='2154'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X0_TLS_LE' value='2155'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X1_TLS_LE' value='2156'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X0_TLS_LE_LO' value='2157'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X1_TLS_LE_LO' value='2158'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X0_TLS_LE_HI' value='2159'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X1_TLS_LE_HI' value='2160'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X0_TLS_LE_HA' value='2161'/>
      <enumerator name='BFD_RELOC_TILEPRO_IMM16_X1_TLS_LE_HA' value='2162'/>
      <enumerator name='BFD_RELOC_TILEGX_HW0' value='2163'/>
      <enumerator name='BFD_RELOC_TILEGX_HW1' value='2164'/>
      <enumerator name='BFD_RELOC_TILEGX_HW2' value='2165'/>
      <enumerator name='BFD_RELOC_TILEGX_HW3' value='2166'/>
      <enumerator name='BFD_RELOC_TILEGX_HW0_LAST' value='2167'/>
      <enumerator name='BFD_RELOC_TILEGX_HW1_LAST' value='2168'/>
      <enumerator name='BFD_RELOC_TILEGX_HW2_LAST' value='2169'/>
      <enumerator name='BFD_RELOC_TILEGX_COPY' value='2170'/>
      <enumerator name='BFD_RELOC_TILEGX_GLOB_DAT' value='2171'/>
      <enumerator name='BFD_RELOC_TILEGX_JMP_SLOT' value='2172'/>
      <enumerator name='BFD_RELOC_TILEGX_RELATIVE' value='2173'/>
      <enumerator name='BFD_RELOC_TILEGX_BROFF_X1' value='2174'/>
      <enumerator name='BFD_RELOC_TILEGX_JUMPOFF_X1' value='2175'/>
      <enumerator name='BFD_RELOC_TILEGX_JUMPOFF_X1_PLT' value='2176'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM8_X0' value='2177'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM8_Y0' value='2178'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM8_X1' value='2179'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM8_Y1' value='2180'/>
      <enumerator name='BFD_RELOC_TILEGX_DEST_IMM8_X1' value='2181'/>
      <enumerator name='BFD_RELOC_TILEGX_MT_IMM14_X1' value='2182'/>
      <enumerator name='BFD_RELOC_TILEGX_MF_IMM14_X1' value='2183'/>
      <enumerator name='BFD_RELOC_TILEGX_MMSTART_X0' value='2184'/>
      <enumerator name='BFD_RELOC_TILEGX_MMEND_X0' value='2185'/>
      <enumerator name='BFD_RELOC_TILEGX_SHAMT_X0' value='2186'/>
      <enumerator name='BFD_RELOC_TILEGX_SHAMT_X1' value='2187'/>
      <enumerator name='BFD_RELOC_TILEGX_SHAMT_Y0' value='2188'/>
      <enumerator name='BFD_RELOC_TILEGX_SHAMT_Y1' value='2189'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW0' value='2190'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW0' value='2191'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW1' value='2192'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW1' value='2193'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW2' value='2194'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW2' value='2195'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW3' value='2196'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW3' value='2197'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW0_LAST' value='2198'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW0_LAST' value='2199'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW1_LAST' value='2200'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW1_LAST' value='2201'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW2_LAST' value='2202'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW2_LAST' value='2203'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW0_PCREL' value='2204'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW0_PCREL' value='2205'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW1_PCREL' value='2206'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW1_PCREL' value='2207'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW2_PCREL' value='2208'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW2_PCREL' value='2209'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW3_PCREL' value='2210'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW3_PCREL' value='2211'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW0_LAST_PCREL' value='2212'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW0_LAST_PCREL' value='2213'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW1_LAST_PCREL' value='2214'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW1_LAST_PCREL' value='2215'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW2_LAST_PCREL' value='2216'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW2_LAST_PCREL' value='2217'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW0_GOT' value='2218'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW0_GOT' value='2219'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW0_PLT_PCREL' value='2220'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW0_PLT_PCREL' value='2221'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW1_PLT_PCREL' value='2222'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW1_PLT_PCREL' value='2223'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW2_PLT_PCREL' value='2224'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW2_PLT_PCREL' value='2225'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW0_LAST_GOT' value='2226'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW0_LAST_GOT' value='2227'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW1_LAST_GOT' value='2228'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW1_LAST_GOT' value='2229'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW3_PLT_PCREL' value='2230'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW3_PLT_PCREL' value='2231'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW0_TLS_GD' value='2232'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW0_TLS_GD' value='2233'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW0_TLS_LE' value='2234'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW0_TLS_LE' value='2235'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW0_LAST_TLS_LE' value='2236'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW0_LAST_TLS_LE' value='2237'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW1_LAST_TLS_LE' value='2238'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW1_LAST_TLS_LE' value='2239'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW0_LAST_TLS_GD' value='2240'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW0_LAST_TLS_GD' value='2241'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW1_LAST_TLS_GD' value='2242'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW1_LAST_TLS_GD' value='2243'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW0_TLS_IE' value='2244'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW0_TLS_IE' value='2245'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW0_LAST_PLT_PCREL' value='2246'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW0_LAST_PLT_PCREL' value='2247'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW1_LAST_PLT_PCREL' value='2248'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW1_LAST_PLT_PCREL' value='2249'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW2_LAST_PLT_PCREL' value='2250'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW2_LAST_PLT_PCREL' value='2251'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW0_LAST_TLS_IE' value='2252'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW0_LAST_TLS_IE' value='2253'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X0_HW1_LAST_TLS_IE' value='2254'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM16_X1_HW1_LAST_TLS_IE' value='2255'/>
      <enumerator name='BFD_RELOC_TILEGX_TLS_DTPMOD64' value='2256'/>
      <enumerator name='BFD_RELOC_TILEGX_TLS_DTPOFF64' value='2257'/>
      <enumerator name='BFD_RELOC_TILEGX_TLS_TPOFF64' value='2258'/>
      <enumerator name='BFD_RELOC_TILEGX_TLS_DTPMOD32' value='2259'/>
      <enumerator name='BFD_RELOC_TILEGX_TLS_DTPOFF32' value='2260'/>
      <enumerator name='BFD_RELOC_TILEGX_TLS_TPOFF32' value='2261'/>
      <enumerator name='BFD_RELOC_TILEGX_TLS_GD_CALL' value='2262'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM8_X0_TLS_GD_ADD' value='2263'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM8_X1_TLS_GD_ADD' value='2264'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM8_Y0_TLS_GD_ADD' value='2265'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM8_Y1_TLS_GD_ADD' value='2266'/>
      <enumerator name='BFD_RELOC_TILEGX_TLS_IE_LOAD' value='2267'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM8_X0_TLS_ADD' value='2268'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM8_X1_TLS_ADD' value='2269'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM8_Y0_TLS_ADD' value='2270'/>
      <enumerator name='BFD_RELOC_TILEGX_IMM8_Y1_TLS_ADD' value='2271'/>
      <enumerator name='BFD_RELOC_BPF_64' value='2272'/>
      <enumerator name='BFD_RELOC_BPF_32' value='2273'/>
      <enumerator name='BFD_RELOC_BPF_16' value='2274'/>
      <enumerator name='BFD_RELOC_BPF_DISP16' value='2275'/>
      <enumerator name='BFD_RELOC_BPF_DISP32' value='2276'/>
      <enumerator name='BFD_RELOC_EPIPHANY_SIMM8' value='2277'/>
      <enumerator name='BFD_RELOC_EPIPHANY_SIMM24' value='2278'/>
      <enumerator name='BFD_RELOC_EPIPHANY_HIGH' value='2279'/>
      <enumerator name='BFD_RELOC_EPIPHANY_LOW' value='2280'/>
      <enumerator name='BFD_RELOC_EPIPHANY_SIMM11' value='2281'/>
      <enumerator name='BFD_RELOC_EPIPHANY_IMM11' value='2282'/>
      <enumerator name='BFD_RELOC_EPIPHANY_IMM8' value='2283'/>
      <enumerator name='BFD_RELOC_VISIUM_HI16' value='2284'/>
      <enumerator name='BFD_RELOC_VISIUM_LO16' value='2285'/>
      <enumerator name='BFD_RELOC_VISIUM_IM16' value='2286'/>
      <enumerator name='BFD_RELOC_VISIUM_REL16' value='2287'/>
      <enumerator name='BFD_RELOC_VISIUM_HI16_PCREL' value='2288'/>
      <enumerator name='BFD_RELOC_VISIUM_LO16_PCREL' value='2289'/>
      <enumerator name='BFD_RELOC_VISIUM_IM16_PCREL' value='2290'/>
      <enumerator name='BFD_RELOC_WASM32_LEB128' value='2291'/>
      <enumerator name='BFD_RELOC_WASM32_LEB128_GOT' value='2292'/>
      <enumerator name='BFD_RELOC_WASM32_LEB128_GOT_CODE' value='2293'/>
      <enumerator name='BFD_RELOC_WASM32_LEB128_PLT' value='2294'/>
      <enumerator name='BFD_RELOC_WASM32_PLT_INDEX' value='2295'/>
      <enumerator name='BFD_RELOC_WASM32_ABS32_CODE' value='2296'/>
      <enumerator name='BFD_RELOC_WASM32_COPY' value='2297'/>
      <enumerator name='BFD_RELOC_WASM32_CODE_POINTER' value='2298'/>
      <enumerator name='BFD_RELOC_WASM32_INDEX' value='2299'/>
      <enumerator name='BFD_RELOC_WASM32_PLT_SIG' value='2300'/>
      <enumerator name='BFD_RELOC_CKCORE_NONE' value='2301'/>
      <enumerator name='BFD_RELOC_CKCORE_ADDR32' value='2302'/>
      <enumerator name='BFD_RELOC_CKCORE_PCREL_IMM8BY4' value='2303'/>
      <enumerator name='BFD_RELOC_CKCORE_PCREL_IMM11BY2' value='2304'/>
      <enumerator name='BFD_RELOC_CKCORE_PCREL_IMM4BY2' value='2305'/>
      <enumerator name='BFD_RELOC_CKCORE_PCREL32' value='2306'/>
      <enumerator name='BFD_RELOC_CKCORE_PCREL_JSR_IMM11BY2' value='2307'/>
      <enumerator name='BFD_RELOC_CKCORE_GNU_VTINHERIT' value='2308'/>
      <enumerator name='BFD_RELOC_CKCORE_GNU_VTENTRY' value='2309'/>
      <enumerator name='BFD_RELOC_CKCORE_RELATIVE' value='2310'/>
      <enumerator name='BFD_RELOC_CKCORE_COPY' value='2311'/>
      <enumerator name='BFD_RELOC_CKCORE_GLOB_DAT' value='2312'/>
      <enumerator name='BFD_RELOC_CKCORE_JUMP_SLOT' value='2313'/>
      <enumerator name='BFD_RELOC_CKCORE_GOTOFF' value='2314'/>
      <enumerator name='BFD_RELOC_CKCORE_GOTPC' value='2315'/>
      <enumerator name='BFD_RELOC_CKCORE_GOT32' value='2316'/>
      <enumerator name='BFD_RELOC_CKCORE_PLT32' value='2317'/>
      <enumerator name='BFD_RELOC_CKCORE_ADDRGOT' value='2318'/>
      <enumerator name='BFD_RELOC_CKCORE_ADDRPLT' value='2319'/>
      <enumerator name='BFD_RELOC_CKCORE_PCREL_IMM26BY2' value='2320'/>
      <enumerator name='BFD_RELOC_CKCORE_PCREL_IMM16BY2' value='2321'/>
      <enumerator name='BFD_RELOC_CKCORE_PCREL_IMM16BY4' value='2322'/>
      <enumerator name='BFD_RELOC_CKCORE_PCREL_IMM10BY2' value='2323'/>
      <enumerator name='BFD_RELOC_CKCORE_PCREL_IMM10BY4' value='2324'/>
      <enumerator name='BFD_RELOC_CKCORE_ADDR_HI16' value='2325'/>
      <enumerator name='BFD_RELOC_CKCORE_ADDR_LO16' value='2326'/>
      <enumerator name='BFD_RELOC_CKCORE_GOTPC_HI16' value='2327'/>
      <enumerator name='BFD_RELOC_CKCORE_GOTPC_LO16' value='2328'/>
      <enumerator name='BFD_RELOC_CKCORE_GOTOFF_HI16' value='2329'/>
      <enumerator name='BFD_RELOC_CKCORE_GOTOFF_LO16' value='2330'/>
      <enumerator name='BFD_RELOC_CKCORE_GOT12' value='2331'/>
      <enumerator name='BFD_RELOC_CKCORE_GOT_HI16' value='2332'/>
      <enumerator name='BFD_RELOC_CKCORE_GOT_LO16' value='2333'/>
      <enumerator name='BFD_RELOC_CKCORE_PLT12' value='2334'/>
      <enumerator name='BFD_RELOC_CKCORE_PLT_HI16' value='2335'/>
      <enumerator name='BFD_RELOC_CKCORE_PLT_LO16' value='2336'/>
      <enumerator name='BFD_RELOC_CKCORE_ADDRGOT_HI16' value='2337'/>
      <enumerator name='BFD_RELOC_CKCORE_ADDRGOT_LO16' value='2338'/>
      <enumerator name='BFD_RELOC_CKCORE_ADDRPLT_HI16' value='2339'/>
      <enumerator name='BFD_RELOC_CKCORE_ADDRPLT_LO16' value='2340'/>
      <enumerator name='BFD_RELOC_CKCORE_PCREL_JSR_IMM26BY2' value='2341'/>
      <enumerator name='BFD_RELOC_CKCORE_TOFFSET_LO16' value='2342'/>
      <enumerator name='BFD_RELOC_CKCORE_DOFFSET_LO16' value='2343'/>
      <enumerator name='BFD_RELOC_CKCORE_PCREL_IMM18BY2' value='2344'/>
      <enumerator name='BFD_RELOC_CKCORE_DOFFSET_IMM18' value='2345'/>
      <enumerator name='BFD_RELOC_CKCORE_DOFFSET_IMM18BY2' value='2346'/>
      <enumerator name='BFD_RELOC_CKCORE_DOFFSET_IMM18BY4' value='2347'/>
      <enumerator name='BFD_RELOC_CKCORE_GOTOFF_IMM18' value='2348'/>
      <enumerator name='BFD_RELOC_CKCORE_GOT_IMM18BY4' value='2349'/>
      <enumerator name='BFD_RELOC_CKCORE_PLT_IMM18BY4' value='2350'/>
      <enumerator name='BFD_RELOC_CKCORE_PCREL_IMM7BY4' value='2351'/>
      <enumerator name='BFD_RELOC_CKCORE_TLS_LE32' value='2352'/>
      <enumerator name='BFD_RELOC_CKCORE_TLS_IE32' value='2353'/>
      <enumerator name='BFD_RELOC_CKCORE_TLS_GD32' value='2354'/>
      <enumerator name='BFD_RELOC_CKCORE_TLS_LDM32' value='2355'/>
      <enumerator name='BFD_RELOC_CKCORE_TLS_LDO32' value='2356'/>
      <enumerator name='BFD_RELOC_CKCORE_TLS_DTPMOD32' value='2357'/>
      <enumerator name='BFD_RELOC_CKCORE_TLS_DTPOFF32' value='2358'/>
      <enumerator name='BFD_RELOC_CKCORE_TLS_TPOFF32' value='2359'/>
      <enumerator name='BFD_RELOC_CKCORE_PCREL_FLRW_IMM8BY4' value='2360'/>
      <enumerator name='BFD_RELOC_CKCORE_NOJSRI' value='2361'/>
      <enumerator name='BFD_RELOC_CKCORE_CALLGRAPH' value='2362'/>
      <enumerator name='BFD_RELOC_CKCORE_IRELATIVE' value='2363'/>
      <enumerator name='BFD_RELOC_CKCORE_PCREL_BLOOP_IMM4BY4' value='2364'/>
      <enumerator name='BFD_RELOC_CKCORE_PCREL_BLOOP_IMM12BY4' value='2365'/>
      <enumerator name='BFD_RELOC_S12Z_OPR' value='2366'/>
      <enumerator name='BFD_RELOC_UNUSED' value='2367'/>
    </enum-decl>
    <enum-decl name='bfd_architecture' filepath='./../bfd/bfd.h' line='1468' column='1' id='type-id-297'>
      <underlying-type type-id='type-id-97'/>
      <enumerator name='bfd_arch_unknown' value='0'/>
      <enumerator name='bfd_arch_obscure' value='1'/>
      <enumerator name='bfd_arch_m68k' value='2'/>
      <enumerator name='bfd_arch_vax' value='3'/>
      <enumerator name='bfd_arch_or1k' value='4'/>
      <enumerator name='bfd_arch_sparc' value='5'/>
      <enumerator name='bfd_arch_spu' value='6'/>
      <enumerator name='bfd_arch_mips' value='7'/>
      <enumerator name='bfd_arch_i386' value='8'/>
      <enumerator name='bfd_arch_l1om' value='9'/>
      <enumerator name='bfd_arch_k1om' value='10'/>
      <enumerator name='bfd_arch_iamcu' value='11'/>
      <enumerator name='bfd_arch_romp' value='12'/>
      <enumerator name='bfd_arch_convex' value='13'/>
      <enumerator name='bfd_arch_m98k' value='14'/>
      <enumerator name='bfd_arch_pyramid' value='15'/>
      <enumerator name='bfd_arch_h8300' value='16'/>
      <enumerator name='bfd_arch_pdp11' value='17'/>
      <enumerator name='bfd_arch_powerpc' value='18'/>
      <enumerator name='bfd_arch_rs6000' value='19'/>
      <enumerator name='bfd_arch_hppa' value='20'/>
      <enumerator name='bfd_arch_d10v' value='21'/>
      <enumerator name='bfd_arch_d30v' value='22'/>
      <enumerator name='bfd_arch_dlx' value='23'/>
      <enumerator name='bfd_arch_m68hc11' value='24'/>
      <enumerator name='bfd_arch_m68hc12' value='25'/>
      <enumerator name='bfd_arch_m9s12x' value='26'/>
      <enumerator name='bfd_arch_m9s12xg' value='27'/>
      <enumerator name='bfd_arch_s12z' value='28'/>
      <enumerator name='bfd_arch_z8k' value='29'/>
      <enumerator name='bfd_arch_sh' value='30'/>
      <enumerator name='bfd_arch_alpha' value='31'/>
      <enumerator name='bfd_arch_arm' value='32'/>
      <enumerator name='bfd_arch_nds32' value='33'/>
      <enumerator name='bfd_arch_ns32k' value='34'/>
      <enumerator name='bfd_arch_tic30' value='35'/>
      <enumerator name='bfd_arch_tic4x' value='36'/>
      <enumerator name='bfd_arch_tic54x' value='37'/>
      <enumerator name='bfd_arch_tic6x' value='38'/>
      <enumerator name='bfd_arch_v850' value='39'/>
      <enumerator name='bfd_arch_v850_rh850' value='40'/>
      <enumerator name='bfd_arch_arc' value='41'/>
      <enumerator name='bfd_arch_m32c' value='42'/>
      <enumerator name='bfd_arch_m32r' value='43'/>
      <enumerator name='bfd_arch_mn10200' value='44'/>
      <enumerator name='bfd_arch_mn10300' value='45'/>
      <enumerator name='bfd_arch_fr30' value='46'/>
      <enumerator name='bfd_arch_frv' value='47'/>
      <enumerator name='bfd_arch_moxie' value='48'/>
      <enumerator name='bfd_arch_ft32' value='49'/>
      <enumerator name='bfd_arch_mcore' value='50'/>
      <enumerator name='bfd_arch_mep' value='51'/>
      <enumerator name='bfd_arch_metag' value='52'/>
      <enumerator name='bfd_arch_ia64' value='53'/>
      <enumerator name='bfd_arch_ip2k' value='54'/>
      <enumerator name='bfd_arch_iq2000' value='55'/>
      <enumerator name='bfd_arch_bpf' value='56'/>
      <enumerator name='bfd_arch_epiphany' value='57'/>
      <enumerator name='bfd_arch_mt' value='58'/>
      <enumerator name='bfd_arch_pj' value='59'/>
      <enumerator name='bfd_arch_avr' value='60'/>
      <enumerator name='bfd_arch_bfin' value='61'/>
      <enumerator name='bfd_arch_cr16' value='62'/>
      <enumerator name='bfd_arch_crx' value='63'/>
      <enumerator name='bfd_arch_cris' value='64'/>
      <enumerator name='bfd_arch_riscv' value='65'/>
      <enumerator name='bfd_arch_rl78' value='66'/>
      <enumerator name='bfd_arch_rx' value='67'/>
      <enumerator name='bfd_arch_s390' value='68'/>
      <enumerator name='bfd_arch_score' value='69'/>
      <enumerator name='bfd_arch_mmix' value='70'/>
      <enumerator name='bfd_arch_xstormy16' value='71'/>
      <enumerator name='bfd_arch_msp430' value='72'/>
      <enumerator name='bfd_arch_xc16x' value='73'/>
      <enumerator name='bfd_arch_xgate' value='74'/>
      <enumerator name='bfd_arch_xtensa' value='75'/>
      <enumerator name='bfd_arch_z80' value='76'/>
      <enumerator name='bfd_arch_lm32' value='77'/>
      <enumerator name='bfd_arch_microblaze' value='78'/>
      <enumerator name='bfd_arch_tilepro' value='79'/>
      <enumerator name='bfd_arch_tilegx' value='80'/>
      <enumerator name='bfd_arch_aarch64' value='81'/>
      <enumerator name='bfd_arch_nios2' value='82'/>
      <enumerator name='bfd_arch_visium' value='83'/>
      <enumerator name='bfd_arch_wasm32' value='84'/>
      <enumerator name='bfd_arch_pru' value='85'/>
      <enumerator name='bfd_arch_nfp' value='86'/>
      <enumerator name='bfd_arch_csky' value='87'/>
      <enumerator name='bfd_arch_last' value='88'/>
    </enum-decl>
    <typedef-decl name='bfd_byte' type-id='type-id-98' filepath='./../bfd/bfd.h' line='226' column='1' id='type-id-5'/>
    <typedef-decl name='ufile_ptr' type-id='type-id-3' filepath='./../bfd/bfd.h' line='217' column='1' id='type-id-160'/>
    <enum-decl name='bfd_format' filepath='./../bfd/bfd.h' line='230' column='1' id='type-id-162'>
      <underlying-type type-id='type-id-97'/>
      <enumerator name='bfd_unknown' value='0'/>
      <enumerator name='bfd_object' value='1'/>
      <enumerator name='bfd_archive' value='2'/>
      <enumerator name='bfd_core' value='3'/>
      <enumerator name='bfd_type_end' value='4'/>
    </enum-decl>
    <enum-decl name='bfd_direction' filepath='./../bfd/bfd.h' line='6472' column='1' id='type-id-163'>
      <underlying-type type-id='type-id-97'/>
      <enumerator name='no_direction' value='0'/>
      <enumerator name='read_direction' value='1'/>
      <enumerator name='write_direction' value='2'/>
      <enumerator name='both_direction' value='3'/>
    </enum-decl>
    <enum-decl name='bfd_plugin_format' filepath='./../bfd/bfd.h' line='6480' column='1' id='type-id-164'>
      <underlying-type type-id='type-id-97'/>
      <enumerator name='bfd_plugin_unknown' value='0'/>
      <enumerator name='bfd_plugin_yes' value='1'/>
      <enumerator name='bfd_plugin_no' value='2'/>
    </enum-decl>
    <class-decl name='bfd_hash_table' size-in-bits='320' is-struct='yes' visibility='default' filepath='./../bfd/bfd.h' line='338' column='1' id='type-id-19'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='table' type-id='type-id-298' visibility='default' filepath='./../bfd/bfd.h' line='341' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='newfunc' type-id='type-id-299' visibility='default' filepath='./../bfd/bfd.h' line='349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='memory' type-id='type-id-47' visibility='default' filepath='./../bfd/bfd.h' line='353' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='size' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='355' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='count' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='entsize' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='frozen' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='361' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bfd_hash_entry' size-in-bits='192' is-struct='yes' visibility='default' filepath='./../bfd/bfd.h' line='325' column='1' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-300' visibility='default' filepath='./../bfd/bfd.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='string' type-id='type-id-46' visibility='default' filepath='./../bfd/bfd.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hash' type-id='type-id-3' visibility='default' filepath='./../bfd/bfd.h' line='333' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bfd_arch_info' size-in-bits='704' is-struct='yes' visibility='default' filepath='./../bfd/bfd.h' line='1958' column='1' id='type-id-301'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bits_per_word' type-id='type-id-89' visibility='default' filepath='./../bfd/bfd.h' line='1960' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bits_per_address' type-id='type-id-89' visibility='default' filepath='./../bfd/bfd.h' line='1961' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bits_per_byte' type-id='type-id-89' visibility='default' filepath='./../bfd/bfd.h' line='1962' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='arch' type-id='type-id-297' visibility='default' filepath='./../bfd/bfd.h' line='1963' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mach' type-id='type-id-3' visibility='default' filepath='./../bfd/bfd.h' line='1964' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='arch_name' type-id='type-id-46' visibility='default' filepath='./../bfd/bfd.h' line='1965' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='printable_name' type-id='type-id-46' visibility='default' filepath='./../bfd/bfd.h' line='1966' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='section_align_power' type-id='type-id-16' visibility='default' filepath='./../bfd/bfd.h' line='1967' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='the_default' type-id='type-id-241' visibility='default' filepath='./../bfd/bfd.h' line='1971' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='compatible' type-id='type-id-302' visibility='default' filepath='./../bfd/bfd.h' line='1972' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='scan' type-id='type-id-303' visibility='default' filepath='./../bfd/bfd.h' line='1975' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='fill' type-id='type-id-304' visibility='default' filepath='./../bfd/bfd.h' line='1980' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='next' type-id='type-id-167' visibility='default' filepath='./../bfd/bfd.h' line='1983' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='max_reloc_offset_into_insn' type-id='type-id-89' visibility='default' filepath='./../bfd/bfd.h' line='1993' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__5' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='./../bfd/bfd.h' line='6742' column='1' id='type-id-168'>
      <data-member access='private'>
        <var-decl name='next' type-id='type-id-105' visibility='default' filepath='./../bfd/bfd.h' line='6744' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='hash' type-id='type-id-305' visibility='default' filepath='./../bfd/bfd.h' line='6746' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__6' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='./../bfd/bfd.h' line='6750' column='1' id='type-id-169'>
      <data-member access='private'>
