<abi-corpus path='/opt/spack/opt/spack/linux-ubuntu18.04-x86_64/gcc-7.5.0/python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/lib/libpython3.7m.so' architecture='elf-amd-x86_64' soname='libpython3.7m.so.1.0'>
  <elf-needed>
    <dependency name='libintl.so.8'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libutil.so.1'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='PyAST_Check' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_Compile' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_CompileEx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_CompileObject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_FromNode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_FromNodeObject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_Validate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_Py_abstract_hack' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ascii_whitespace' size='128' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_capitalize__doc__' size='124' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_center__doc__' size='163' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_count__doc__' size='199' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_table' size='1024' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_tolower' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_toupper' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_endswith__doc__' size='264' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_expandtabs__doc__' size='173' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_find__doc__' size='239' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_index__doc__' size='270' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isalnum__doc__' size='132' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isalpha__doc__' size='130' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isascii__doc__' size='98' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isdigit__doc__' size='126' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_islower__doc__' size='141' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isspace__doc__' size='130' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_istitle__doc__' size='230' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isupper__doc__' size='141' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ljust__doc__' size='167' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_lower__doc__' size='93' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_maketrans__doc__' size='291' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_open_cloexec_works' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_path_config' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_rfind__doc__' size='241' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_rindex__doc__' size='271' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_rjust__doc__' size='167' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_startswith__doc__' size='268' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_swapcase__doc__' size='123' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_title__doc__' size='155' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_upper__doc__' size='93' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_zfill__doc__' size='139' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_abc.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__abc' mangled-name='PyInit__abc' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_abc.c' line='817' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__abc'>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-1'/>
    <typedef-decl name='PyObject' type-id='type-id-3' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='110' column='1' id='type-id-2'/>
    <class-decl name='_object' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='106' column='1' id='type-id-3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_refcnt' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ob_type' type-id='type-id-5' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-5'/>
    <typedef-decl name='Py_ssize_t' type-id='type-id-7' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pyport.h' line='84' column='1' id='type-id-4'/>
    <class-decl name='_typeobject' size-in-bits='3200' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='346' column='1' id='type-id-6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-8' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='347' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tp_name' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='348' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tp_basicsize' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tp_itemsize' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tp_dealloc' type-id='type-id-10' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='353' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tp_print' type-id='type-id-11' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='354' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='tp_getattr' type-id='type-id-12' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='355' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tp_setattr' type-id='type-id-13' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='356' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='tp_as_async' type-id='type-id-14' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='tp_repr' type-id='type-id-15' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='tp_as_number' type-id='type-id-16' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='363' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='tp_as_sequence' type-id='type-id-17' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='tp_as_mapping' type-id='type-id-18' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='tp_hash' type-id='type-id-19' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='369' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='tp_call' type-id='type-id-20' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='370' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='tp_str' type-id='type-id-15' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='371' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='tp_getattro' type-id='type-id-21' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='tp_setattro' type-id='type-id-22' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='tp_as_buffer' type-id='type-id-23' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='376' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='tp_flags' type-id='type-id-24' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='379' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='tp_doc' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='381' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='tp_traverse' type-id='type-id-25' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='385' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='tp_clear' type-id='type-id-26' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='388' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='tp_richcompare' type-id='type-id-27' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='tp_weaklistoffset' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='395' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='tp_iter' type-id='type-id-28' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='398' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='tp_iternext' type-id='type-id-29' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='tp_methods' type-id='type-id-30' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='tp_members' type-id='type-id-31' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='tp_getset' type-id='type-id-32' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='tp_base' type-id='type-id-5' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='tp_dict' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='tp_descr_get' type-id='type-id-33' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tp_descr_set' type-id='type-id-34' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='tp_dictoffset' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='tp_init' type-id='type-id-35' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='tp_alloc' type-id='type-id-36' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='tp_new' type-id='type-id-37' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='tp_free' type-id='type-id-38' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='tp_is_gc' type-id='type-id-26' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='tp_bases' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='tp_mro' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='tp_cache' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='tp_subclasses' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='tp_weaklist' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='tp_del' type-id='type-id-10' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='tp_version_tag' type-id='type-id-39' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='tp_finalize' type-id='type-id-10' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='425' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ssize_t' type-id='type-id-40' filepath='/usr/include/stdio.h' line='71' column='1' id='type-id-7'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-14'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-23'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-32'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-30'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-16'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-9'/>
    <typedef-decl name='PyVarObject' type-id='type-id-50' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='115' column='1' id='type-id-8'/>
    <typedef-decl name='__ssize_t' type-id='type-id-51' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='181' column='1' id='type-id-40'/>
    <typedef-decl name='allocfunc' type-id='type-id-52' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='341' column='1' id='type-id-36'/>
    <typedef-decl name='descrgetfunc' type-id='type-id-53' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='337' column='1' id='type-id-33'/>
    <typedef-decl name='descrsetfunc' type-id='type-id-54' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='338' column='1' id='type-id-34'/>
    <typedef-decl name='destructor' type-id='type-id-55' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='320' column='1' id='type-id-10'/>
    <typedef-decl name='freefunc' type-id='type-id-56' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='319' column='1' id='type-id-38'/>
    <typedef-decl name='getattrfunc' type-id='type-id-57' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='328' column='1' id='type-id-12'/>
    <typedef-decl name='getattrofunc' type-id='type-id-58' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='329' column='1' id='type-id-21'/>
    <typedef-decl name='getiterfunc' type-id='type-id-59' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='335' column='1' id='type-id-28'/>
    <typedef-decl name='hashfunc' type-id='type-id-60' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='333' column='1' id='type-id-19'/>
    <typedef-decl name='initproc' type-id='type-id-54' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='339' column='1' id='type-id-35'/>
    <typedef-decl name='inquiry' type-id='type-id-61' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='172' column='1' id='type-id-26'/>
    <typedef-decl name='iternextfunc' type-id='type-id-59' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='336' column='1' id='type-id-29'/>
    <typedef-decl name='newfunc' type-id='type-id-62' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='340' column='1' id='type-id-37'/>
    <typedef-decl name='printfunc' type-id='type-id-63' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='326' column='1' id='type-id-11'/>
    <typedef-decl name='reprfunc' type-id='type-id-59' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='332' column='1' id='type-id-15'/>
    <typedef-decl name='richcmpfunc' type-id='type-id-64' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='334' column='1' id='type-id-27'/>
    <typedef-decl name='setattrfunc' type-id='type-id-65' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='330' column='1' id='type-id-13'/>
    <typedef-decl name='setattrofunc' type-id='type-id-54' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='331' column='1' id='type-id-22'/>
    <typedef-decl name='ternaryfunc' type-id='type-id-53' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='171' column='1' id='type-id-20'/>
    <typedef-decl name='traverseproc' type-id='type-id-66' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='237' column='1' id='type-id-25'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-39'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-24'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-59'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-58'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-53'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-64'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-57'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-62'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-52'/>
    <class-decl name='PyGetSetDef' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/descrobject.h' line='11' column='1' id='type-id-43'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/descrobject.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='get' type-id='type-id-74' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/descrobject.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='set' type-id='type-id-75' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/descrobject.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='doc' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/descrobject.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='closure' type-id='type-id-76' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/descrobject.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyMemberDef' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/structmember.h' line='18' column='1' id='type-id-45'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/structmember.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/structmember.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offset' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/structmember.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flags' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/structmember.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='doc' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/structmember.h' line='23' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyMethodDef' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/methodobject.h' line='56' column='1' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ml_name' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/methodobject.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ml_meth' type-id='type-id-78' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/methodobject.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ml_flags' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/methodobject.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ml_doc' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/methodobject.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-8' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='112' column='1' id='type-id-50'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-2' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ob_size' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='114' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-79' const='yes' id='type-id-49'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-61'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-63'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-54'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-65'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-66'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-51'/>
    <typedef-decl name='PyAsyncMethods' type-id='type-id-85' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='311' column='1' id='type-id-41'/>
    <typedef-decl name='PyBufferProcs' type-id='type-id-86' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='316' column='1' id='type-id-42'/>
    <typedef-decl name='PyMappingMethods' type-id='type-id-87' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='305' column='1' id='type-id-44'/>
    <typedef-decl name='PyNumberMethods' type-id='type-id-88' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='285' column='1' id='type-id-47'/>
    <typedef-decl name='PySequenceMethods' type-id='type-id-89' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='299' column='1' id='type-id-48'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-60'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-55'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-56'/>
    <type-decl name='char' size-in-bits='8' id='type-id-79'/>
    <class-decl name='__anonymous_struct__2' size-in-bits='2304' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-47' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='240' column='1' id='type-id-88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_add' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nb_subtract' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nb_multiply' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nb_remainder' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nb_divmod' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nb_power' type-id='type-id-20' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nb_negative' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nb_positive' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nb_absolute' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='nb_bool' type-id='type-id-26' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='nb_invert' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='nb_lshift' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='nb_rshift' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='nb_and' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='nb_xor' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='nb_or' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='nb_int' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='nb_reserved' type-id='type-id-76' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='nb_float' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='nb_inplace_add' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='nb_inplace_subtract' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='nb_inplace_multiply' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='nb_inplace_remainder' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='nb_inplace_power' type-id='type-id-20' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='nb_inplace_lshift' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='nb_inplace_rshift' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='nb_inplace_and' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='nb_inplace_xor' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='nb_inplace_or' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='nb_floor_divide' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='nb_true_divide' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='nb_inplace_floor_divide' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='nb_inplace_true_divide' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='nb_index' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='nb_matrix_multiply' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='nb_inplace_matrix_multiply' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='284' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-42' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='313' column='1' id='type-id-86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bf_getbuffer' type-id='type-id-95' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='314' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bf_releasebuffer' type-id='type-id-96' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='315' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-44' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='301' column='1' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mp_length' type-id='type-id-97' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp_subscript' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mp_ass_subscript' type-id='type-id-98' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='304' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='640' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-48' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='287' column='1' id='type-id-89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sq_length' type-id='type-id-97' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sq_concat' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sq_repeat' type-id='type-id-99' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sq_item' type-id='type-id-99' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='was_sq_slice' type-id='type-id-76' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='sq_ass_item' type-id='type-id-100' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='was_sq_ass_slice' type-id='type-id-76' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='sq_contains' type-id='type-id-101' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='sq_inplace_concat' type-id='type-id-93' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='sq_inplace_repeat' type-id='type-id-99' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='298' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-41' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='307' column='1' id='type-id-85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='am_await' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='am_aiter' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='am_anext' type-id='type-id-94' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='310' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-77'/>
    <typedef-decl name='PyCFunction' type-id='type-id-58' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/methodobject.h' line='18' column='1' id='type-id-78'/>
    <typedef-decl name='getter' type-id='type-id-102' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/descrobject.h' line='8' column='1' id='type-id-74'/>
    <typedef-decl name='setter' type-id='type-id-103' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/descrobject.h' line='9' column='1' id='type-id-75'/>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-76'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-102'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-103'/>
    <typedef-decl name='binaryfunc' type-id='type-id-58' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='170' column='1' id='type-id-93'/>
    <typedef-decl name='getbufferproc' type-id='type-id-107' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='197' column='1' id='type-id-95'/>
    <typedef-decl name='lenfunc' type-id='type-id-108' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='173' column='1' id='type-id-97'/>
    <typedef-decl name='objobjargproc' type-id='type-id-54' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='178' column='1' id='type-id-98'/>
    <typedef-decl name='objobjproc' type-id='type-id-109' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='235' column='1' id='type-id-101'/>
    <typedef-decl name='releasebufferproc' type-id='type-id-110' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='198' column='1' id='type-id-96'/>
    <typedef-decl name='ssizeargfunc' type-id='type-id-111' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='174' column='1' id='type-id-99'/>
    <typedef-decl name='ssizeobjargproc' type-id='type-id-112' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='176' column='1' id='type-id-100'/>
    <typedef-decl name='unaryfunc' type-id='type-id-59' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='169' column='1' id='type-id-94'/>
    <type-decl name='void' id='type-id-104'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-111'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-109'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-107'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-112'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-108'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-110'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_codecsmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__codecs' mangled-name='PyInit__codecs' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_codecsmodule.c' line='1135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__codecs'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_collectionsmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__collections' mangled-name='PyInit__collections' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_collectionsmodule.c' line='2382' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__collections'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_functoolsmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__functools' mangled-name='PyInit__functools' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_functoolsmodule.c' line='1263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__functools'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <typedef-decl name='_PyIO_State' type-id='type-id-119' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='145' column='1' id='type-id-120'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-120' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='140' column='1' id='type-id-119'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='initialized' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='locale_module' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='unsupported_operation' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='144' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='Py_off_t' type-id='type-id-121' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='104' column='1' id='type-id-122'/>
    <typedef-decl name='off_t' type-id='type-id-123' filepath='/usr/include/stdio.h' line='59' column='1' id='type-id-121'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-124'/>
    <var-decl name='_PyIO_str_close' type-id='type-id-1' mangled-name='_PyIO_str_close' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='157' column='1' elf-symbol-id='_PyIO_str_close'/>
    <var-decl name='_PyIO_str_closed' type-id='type-id-1' mangled-name='_PyIO_str_closed' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='158' column='1' elf-symbol-id='_PyIO_str_closed'/>
    <var-decl name='_PyIO_str_decode' type-id='type-id-1' mangled-name='_PyIO_str_decode' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='159' column='1' elf-symbol-id='_PyIO_str_decode'/>
    <var-decl name='_PyIO_str_encode' type-id='type-id-1' mangled-name='_PyIO_str_encode' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='160' column='1' elf-symbol-id='_PyIO_str_encode'/>
    <var-decl name='_PyIO_str_fileno' type-id='type-id-1' mangled-name='_PyIO_str_fileno' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='161' column='1' elf-symbol-id='_PyIO_str_fileno'/>
    <var-decl name='_PyIO_str_flush' type-id='type-id-1' mangled-name='_PyIO_str_flush' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='162' column='1' elf-symbol-id='_PyIO_str_flush'/>
    <var-decl name='_PyIO_str_getstate' type-id='type-id-1' mangled-name='_PyIO_str_getstate' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='163' column='1' elf-symbol-id='_PyIO_str_getstate'/>
    <var-decl name='_PyIO_str_isatty' type-id='type-id-1' mangled-name='_PyIO_str_isatty' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='164' column='1' elf-symbol-id='_PyIO_str_isatty'/>
    <var-decl name='_PyIO_str_newlines' type-id='type-id-1' mangled-name='_PyIO_str_newlines' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='165' column='1' elf-symbol-id='_PyIO_str_newlines'/>
    <var-decl name='_PyIO_str_nl' type-id='type-id-1' mangled-name='_PyIO_str_nl' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='166' column='1' elf-symbol-id='_PyIO_str_nl'/>
    <var-decl name='_PyIO_str_peek' type-id='type-id-1' mangled-name='_PyIO_str_peek' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='167' column='1' elf-symbol-id='_PyIO_str_peek'/>
    <var-decl name='_PyIO_str_read' type-id='type-id-1' mangled-name='_PyIO_str_read' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='168' column='1' elf-symbol-id='_PyIO_str_read'/>
    <var-decl name='_PyIO_str_read1' type-id='type-id-1' mangled-name='_PyIO_str_read1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='169' column='1' elf-symbol-id='_PyIO_str_read1'/>
    <var-decl name='_PyIO_str_readable' type-id='type-id-1' mangled-name='_PyIO_str_readable' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='170' column='1' elf-symbol-id='_PyIO_str_readable'/>
    <var-decl name='_PyIO_str_readall' type-id='type-id-1' mangled-name='_PyIO_str_readall' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='171' column='1' elf-symbol-id='_PyIO_str_readall'/>
    <var-decl name='_PyIO_str_readinto' type-id='type-id-1' mangled-name='_PyIO_str_readinto' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='172' column='1' elf-symbol-id='_PyIO_str_readinto'/>
    <var-decl name='_PyIO_str_readline' type-id='type-id-1' mangled-name='_PyIO_str_readline' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='173' column='1' elf-symbol-id='_PyIO_str_readline'/>
    <var-decl name='_PyIO_str_reset' type-id='type-id-1' mangled-name='_PyIO_str_reset' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='174' column='1' elf-symbol-id='_PyIO_str_reset'/>
    <var-decl name='_PyIO_str_seek' type-id='type-id-1' mangled-name='_PyIO_str_seek' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='175' column='1' elf-symbol-id='_PyIO_str_seek'/>
    <var-decl name='_PyIO_str_seekable' type-id='type-id-1' mangled-name='_PyIO_str_seekable' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='176' column='1' elf-symbol-id='_PyIO_str_seekable'/>
    <var-decl name='_PyIO_str_setstate' type-id='type-id-1' mangled-name='_PyIO_str_setstate' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='177' column='1' elf-symbol-id='_PyIO_str_setstate'/>
    <var-decl name='_PyIO_str_tell' type-id='type-id-1' mangled-name='_PyIO_str_tell' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='178' column='1' elf-symbol-id='_PyIO_str_tell'/>
    <var-decl name='_PyIO_str_truncate' type-id='type-id-1' mangled-name='_PyIO_str_truncate' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='179' column='1' elf-symbol-id='_PyIO_str_truncate'/>
    <var-decl name='_PyIO_str_writable' type-id='type-id-1' mangled-name='_PyIO_str_writable' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='180' column='1' elf-symbol-id='_PyIO_str_writable'/>
    <var-decl name='_PyIO_str_write' type-id='type-id-1' mangled-name='_PyIO_str_write' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='181' column='1' elf-symbol-id='_PyIO_str_write'/>
    <var-decl name='_PyIO_empty_str' type-id='type-id-1' mangled-name='_PyIO_empty_str' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='183' column='1' elf-symbol-id='_PyIO_empty_str'/>
    <var-decl name='_PyIO_empty_bytes' type-id='type-id-1' mangled-name='_PyIO_empty_bytes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='184' column='1' elf-symbol-id='_PyIO_empty_bytes'/>
    <var-decl name='_PyIO_Module' type-id='type-id-125' mangled-name='_PyIO_Module' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='138' column='1' elf-symbol-id='_PyIO_Module'/>
    <function-decl name='PyInit__io' mangled-name='PyInit__io' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.c' line='638' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__io'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyIO_get_locale_module' mangled-name='_PyIO_get_locale_module' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.c' line='560' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIO_get_locale_module'>
      <parameter type-id='type-id-124' name='state' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.c' line='560' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyIO_get_module_state' mangled-name='_PyIO_get_module_state' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.c' line='546' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIO_get_module_state'>
      <return type-id='type-id-124'/>
    </function-decl>
    <function-decl name='PyNumber_AsOff_t' mangled-name='PyNumber_AsOff_t' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.c' line='501' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_AsOff_t'>
      <parameter type-id='type-id-1' name='item' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.c' line='501' column='1'/>
      <parameter type-id='type-id-1' name='err' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.c' line='501' column='1'/>
      <return type-id='type-id-122'/>
    </function-decl>
    <typedef-decl name='PyModuleDef' type-id='type-id-126' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/moduleobject.h' line='84' column='1' id='type-id-125'/>
    <typedef-decl name='__off64_t' type-id='type-id-51' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='141' column='1' id='type-id-123'/>
    <class-decl name='PyModuleDef' size-in-bits='832' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/moduleobject.h' line='74' column='1' id='type-id-126'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_base' type-id='type-id-127' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/moduleobject.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='m_name' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/moduleobject.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='m_doc' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/moduleobject.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='m_size' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/moduleobject.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='m_methods' type-id='type-id-30' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/moduleobject.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='m_slots' type-id='type-id-128' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/moduleobject.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='m_traverse' type-id='type-id-25' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/moduleobject.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='m_clear' type-id='type-id-26' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/moduleobject.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='m_free' type-id='type-id-38' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/moduleobject.h' line='83' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-128'/>
    <typedef-decl name='PyModuleDef_Base' type-id='type-id-130' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/moduleobject.h' line='48' column='1' id='type-id-127'/>
    <class-decl name='PyModuleDef_Base' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/moduleobject.h' line='43' column='1' id='type-id-130'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-2' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/moduleobject.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='m_init' type-id='type-id-131' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/moduleobject.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='m_index' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/moduleobject.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='m_copy' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/moduleobject.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyModuleDef_Slot' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/moduleobject.h' line='60' column='1' id='type-id-129'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='slot' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/moduleobject.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value' type-id='type-id-76' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/moduleobject.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-131'/>
    <function-type size-in-bits='64' id='type-id-132'>
      <return type-id='type-id-1'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/bufferedio.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyBufferedIOBase_Type' type-id='type-id-133' mangled-name='PyBufferedIOBase_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='8' column='1' elf-symbol-id='PyBufferedIOBase_Type'/>
    <var-decl name='PyBufferedReader_Type' type-id='type-id-133' mangled-name='PyBufferedReader_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='15' column='1' elf-symbol-id='PyBufferedReader_Type'/>
    <var-decl name='PyBufferedWriter_Type' type-id='type-id-133' mangled-name='PyBufferedWriter_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='16' column='1' elf-symbol-id='PyBufferedWriter_Type'/>
    <var-decl name='PyBufferedRWPair_Type' type-id='type-id-133' mangled-name='PyBufferedRWPair_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='17' column='1' elf-symbol-id='PyBufferedRWPair_Type'/>
    <var-decl name='PyBufferedRandom_Type' type-id='type-id-133' mangled-name='PyBufferedRandom_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='18' column='1' elf-symbol-id='PyBufferedRandom_Type'/>
    <function-decl name='_PyIO_trap_eintr' mangled-name='_PyIO_trap_eintr' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/bufferedio.c' line='773' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIO_trap_eintr'>
      <return type-id='type-id-77'/>
    </function-decl>
    <typedef-decl name='PyTypeObject' type-id='type-id-6' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='435' column='1' id='type-id-133'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/bytesio.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyBytesIO_Type' type-id='type-id-133' mangled-name='PyBytesIO_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='13' column='1' elf-symbol-id='PyBytesIO_Type'/>
    <var-decl name='_PyBytesIOBuffer_Type' type-id='type-id-133' mangled-name='_PyBytesIOBuffer_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='186' column='1' elf-symbol-id='_PyBytesIOBuffer_Type'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/fileio.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyFileIO_Type' type-id='type-id-133' mangled-name='PyFileIO_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='12' column='1' elf-symbol-id='PyFileIO_Type'/>
    <function-decl name='_PyFileIO_closed' mangled-name='_PyFileIO_closed' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/fileio.c' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyFileIO_closed'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/fileio.c' line='80' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/iobase.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyIOBase_Type' type-id='type-id-133' mangled-name='PyIOBase_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='6' column='1' elf-symbol-id='PyIOBase_Type'/>
    <var-decl name='PyRawIOBase_Type' type-id='type-id-133' mangled-name='PyRawIOBase_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='7' column='1' elf-symbol-id='PyRawIOBase_Type'/>
    <function-decl name='_PyIOBase_finalize' mangled-name='_PyIOBase_finalize' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/iobase.c' line='297' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIOBase_finalize'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/iobase.c' line='297' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='_PyIOBase_check_writable' mangled-name='_PyIOBase_check_writable' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/iobase.c' line='435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIOBase_check_writable'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/iobase.c' line='435' column='1'/>
      <parameter type-id='type-id-1' name='args' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/iobase.c' line='435' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyIOBase_check_readable' mangled-name='_PyIOBase_check_readable' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/iobase.c' line='402' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIOBase_check_readable'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/iobase.c' line='402' column='1'/>
      <parameter type-id='type-id-1' name='args' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/iobase.c' line='402' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyIOBase_check_seekable' mangled-name='_PyIOBase_check_seekable' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/iobase.c' line='369' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIOBase_check_seekable'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/iobase.c' line='369' column='1'/>
      <parameter type-id='type-id-1' name='args' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/iobase.c' line='369' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyIOBase_check_closed' mangled-name='_PyIOBase_check_closed' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/iobase.c' line='200' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIOBase_check_closed'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/iobase.c' line='200' column='1'/>
      <parameter type-id='type-id-1' name='args' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/iobase.c' line='200' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/stringio.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyStringIO_Type' type-id='type-id-133' mangled-name='PyStringIO_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='14' column='1' elf-symbol-id='PyStringIO_Type'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/textio.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <var-decl name='PyTextIOBase_Type' type-id='type-id-133' mangled-name='PyTextIOBase_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='9' column='1' elf-symbol-id='PyTextIOBase_Type'/>
    <var-decl name='PyIncrementalNewlineDecoder_Type' type-id='type-id-133' mangled-name='PyIncrementalNewlineDecoder_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='20' column='1' elf-symbol-id='PyIncrementalNewlineDecoder_Type'/>
    <var-decl name='PyTextIOWrapper_Type' type-id='type-id-133' mangled-name='PyTextIOWrapper_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/_iomodule.h' line='19' column='1' elf-symbol-id='PyTextIOWrapper_Type'/>
    <function-decl name='_PyIO_find_line_ending' mangled-name='_PyIO_find_line_ending' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/textio.c' line='1918' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIO_find_line_ending'>
      <parameter type-id='type-id-77' name='translated' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/textio.c' line='1919' column='1'/>
      <parameter type-id='type-id-77' name='universal' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/textio.c' line='1919' column='1'/>
      <parameter type-id='type-id-1' name='readnl' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/textio.c' line='1919' column='1'/>
      <parameter type-id='type-id-77' name='kind' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/textio.c' line='1920' column='1'/>
      <parameter type-id='type-id-9' name='start' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/textio.c' line='1920' column='1'/>
      <parameter type-id='type-id-9' name='end' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/textio.c' line='1920' column='1'/>
      <parameter type-id='type-id-134' name='consumed' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/textio.c' line='1920' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyIncrementalNewlineDecoder_decode' mangled-name='_PyIncrementalNewlineDecoder_decode' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/textio.c' line='304' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIncrementalNewlineDecoder_decode'>
      <parameter type-id='type-id-1' name='myself' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/textio.c' line='304' column='1'/>
      <parameter type-id='type-id-1' name='input' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/textio.c' line='305' column='1'/>
      <parameter type-id='type-id-77' name='final' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_io/textio.c' line='305' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-134'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_localemodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__locale' mangled-name='PyInit__locale' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_localemodule.c' line='658' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__locale'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_operator.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__operator' mangled-name='PyInit__operator' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_operator.c' line='1733' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__operator'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_sre.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__sre' mangled-name='PyInit__sre' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_sre.c' line='2781' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__sre'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_stat.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__stat' mangled-name='PyInit__stat' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_stat.c' line='508' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__stat'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_threadmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__thread' mangled-name='PyInit__thread' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_threadmodule.c' line='1346' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__thread'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_tracemalloc.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <typedef-decl name='uintptr_t' type-id='type-id-24' filepath='/usr/include/stdint.h' line='100' column='1' id='type-id-135'/>
    <function-decl name='_PyTraceMalloc_GetTraceback' mangled-name='_PyTraceMalloc_GetTraceback' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_tracemalloc.c' line='1717' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyTraceMalloc_GetTraceback'>
      <parameter type-id='type-id-39' name='domain' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_tracemalloc.c' line='1717' column='1'/>
      <parameter type-id='type-id-135' name='ptr' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_tracemalloc.c' line='1717' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyTraceMalloc_Untrack' mangled-name='PyTraceMalloc_Untrack' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_tracemalloc.c' line='1701' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyTraceMalloc_Untrack'>
      <parameter type-id='type-id-39' name='domain' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_tracemalloc.c' line='1701' column='1'/>
      <parameter type-id='type-id-135' name='ptr' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_tracemalloc.c' line='1701' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyTraceMalloc_Track' mangled-name='PyTraceMalloc_Track' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_tracemalloc.c' line='1678' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyTraceMalloc_Track'>
      <parameter type-id='type-id-39' name='domain' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_tracemalloc.c' line='1678' column='1'/>
      <parameter type-id='type-id-135' name='ptr' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_tracemalloc.c' line='1678' column='1'/>
      <parameter type-id='type-id-136' name='size' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_tracemalloc.c' line='1679' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='_PyTraceMalloc_Fini' mangled-name='_PyTraceMalloc_Fini' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_tracemalloc.c' line='1671' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyTraceMalloc_Fini'>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='_PyTraceMalloc_Init' mangled-name='_PyTraceMalloc_Init' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_tracemalloc.c' line='1660' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyTraceMalloc_Init'>
      <parameter type-id='type-id-77' name='nframe' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_tracemalloc.c' line='1660' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyInit__tracemalloc' mangled-name='PyInit__tracemalloc' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_tracemalloc.c' line='1645' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__tracemalloc'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyMem_DumpTraceback' mangled-name='_PyMem_DumpTraceback' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_tracemalloc.c' line='1488' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyMem_DumpTraceback'>
      <parameter type-id='type-id-77' name='fd' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_tracemalloc.c' line='1488' column='1'/>
      <parameter type-id='type-id-76' name='ptr' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_tracemalloc.c' line='1488' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <typedef-decl name='size_t' type-id='type-id-24' filepath='/usr/lib/gcc/x86_64-linux-gnu/7/include/stddef.h' line='216' column='1' id='type-id-136'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_weakref.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__weakref' mangled-name='PyInit__weakref' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/_weakref.c' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__weakref'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/atexitmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit_atexit' mangled-name='PyInit_atexit' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/atexitmodule.c' line='351' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_atexit'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/errnomodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit_errno' mangled-name='PyInit_errno' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/errnomodule.c' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_errno'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/faulthandler.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='_PyFaulthandler_Fini' mangled-name='_PyFaulthandler_Fini' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/faulthandler.c' line='1340' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyFaulthandler_Fini'>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='_PyFaulthandler_Init' mangled-name='_PyFaulthandler_Init' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/faulthandler.c' line='1303' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyFaulthandler_Init'>
      <parameter type-id='type-id-77' name='enable' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/faulthandler.c' line='1303' column='1'/>
      <return type-id='type-id-137'/>
    </function-decl>
    <function-decl name='PyInit_faulthandler' mangled-name='PyInit_faulthandler' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/faulthandler.c' line='1253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_faulthandler'>
      <return type-id='type-id-1'/>
    </function-decl>
    <typedef-decl name='_PyInitError' type-id='type-id-138' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pylifecycle.h' line='15' column='1' id='type-id-137'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-137' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pylifecycle.h' line='11' column='1' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prefix' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pylifecycle.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='msg' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pylifecycle.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='user_err' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pylifecycle.h' line='14' column='1'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-140'/>
    <function-decl name='PyObject_GC_Del' mangled-name='PyObject_GC_Del' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='1770' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_Del'>
      <parameter type-id='type-id-76' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='1770' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='_PyObject_GC_Resize' mangled-name='_PyObject_GC_Resize' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='1754' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_Resize'>
      <parameter type-id='type-id-141' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='1754' column='1'/>
      <parameter type-id='type-id-4' name='nitems' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='1754' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='_PyObject_GC_NewVar' mangled-name='_PyObject_GC_NewVar' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='1737' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_NewVar'>
      <parameter type-id='type-id-142' name='tp' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='1737' column='1'/>
      <parameter type-id='type-id-4' name='nitems' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='1737' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='_PyObject_GC_New' mangled-name='_PyObject_GC_New' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='1728' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_New'>
      <parameter type-id='type-id-142' name='tp' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='1728' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyObject_GC_Calloc' mangled-name='_PyObject_GC_Calloc' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='1722' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_Calloc'>
      <parameter type-id='type-id-136' name='basicsize' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='1722' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyObject_GC_Malloc' mangled-name='_PyObject_GC_Malloc' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='1716' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_Malloc'>
      <parameter type-id='type-id-136' name='basicsize' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='1716' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyObject_GC_UnTrack' mangled-name='PyObject_GC_UnTrack' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='1675' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_UnTrack'>
      <parameter type-id='type-id-76' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='1675' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='PyObject_GC_Track' mangled-name='PyObject_GC_Track' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='1669' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_Track'>
      <parameter type-id='type-id-76' name='op' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='1669' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='_PyGC_Dump' mangled-name='_PyGC_Dump' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='1655' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyGC_Dump'>
      <parameter type-id='type-id-143' name='g' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='1655' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='_PyGC_Fini' mangled-name='_PyGC_Fini' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='1648' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyGC_Fini'>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='_PyGC_DumpShutdownStats' mangled-name='_PyGC_DumpShutdownStats' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='1612' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyGC_DumpShutdownStats'>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='_PyGC_CollectNoFail' mangled-name='_PyGC_CollectNoFail' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='1591' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyGC_CollectNoFail'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyGC_CollectIfEnabled' mangled-name='_PyGC_CollectIfEnabled' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='1582' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyGC_CollectIfEnabled'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyInit_gc' mangled-name='PyInit_gc' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='1524' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_gc'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyGC_Initialize' mangled-name='_PyGC_Initialize' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyGC_Initialize'>
      <parameter type-id='type-id-140' name='state' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='60' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='PyGC_Collect' mangled-name='PyGC_Collect' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/gcmodule.c' line='1563' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyGC_Collect'>
      <return type-id='type-id-4'/>
    </function-decl>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-143'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-142'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-141'/>
    <class-decl name='_gc_runtime_state' size-in-bits='2176' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/mem.h' line='110' column='1' id='type-id-139'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='trash_delete_later' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/mem.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='trash_delete_nesting' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/mem.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='enabled' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/mem.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='debug' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/mem.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='generations' type-id='type-id-145' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/mem.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='generation0' type-id='type-id-143' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/mem.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='permanent_generation' type-id='type-id-146' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/mem.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='generation_stats' type-id='type-id-147' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/mem.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='collecting' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/mem.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='garbage' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/mem.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='callbacks' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/mem.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='long_lived_total' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/mem.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='long_lived_pending' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/mem.h' line='141' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='gc_generation' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/mem.h' line='93' column='1' id='type-id-146'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-144' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/mem.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='threshold' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/mem.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='count' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/mem.h' line='96' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-146' size-in-bits='768' id='type-id-145'>
      <subrange length='3' type-id='type-id-24' id='type-id-148'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-149' size-in-bits='576' id='type-id-147'>
      <subrange length='3' type-id='type-id-24' id='type-id-148'/>
    </array-type-def>
    <typedef-decl name='PyGC_Head' type-id='type-id-150' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/objimpl.h' line='259' column='1' id='type-id-144'/>
    <class-decl name='gc_generation_stats' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/mem.h' line='101' column='1' id='type-id-149'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='collections' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/mem.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='collected' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/mem.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uncollectable' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/mem.h' line='107' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='_gc_head' size-in-bits='192' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/objimpl.h' line='252' column='1' id='type-id-150'>
      <data-member access='private'>
        <var-decl name='gc' type-id='type-id-151' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/objimpl.h' line='257' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='dummy' type-id='type-id-152' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/objimpl.h' line='258' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/objimpl.h' line='253' column='1' id='type-id-151'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gc_next' type-id='type-id-153' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/objimpl.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='gc_prev' type-id='type-id-153' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/objimpl.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='gc_refs' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/objimpl.h' line='256' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='double' size-in-bits='64' id='type-id-152'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-153'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/getbuildinfo.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='type-id-79'/>
    <type-decl name='void' id='type-id-104'/>
    <qualified-type-def type-id='type-id-79' const='yes' id='type-id-49'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-9'/>
    <function-decl name='Py_GetBuildInfo' mangled-name='Py_GetBuildInfo' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/getbuildinfo.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetBuildInfo'>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_Py_gitidentifier' mangled-name='_Py_gitidentifier' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/getbuildinfo.c' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_gitidentifier'>
      <return type-id='type-id-9'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/getpath.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='_PyPathConfig_Calculate' mangled-name='_PyPathConfig_Calculate' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/getpath.c' line='949' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyPathConfig_Calculate'>
      <parameter type-id='type-id-154' name='config' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/getpath.c' line='949' column='1'/>
      <parameter type-id='type-id-155' name='core_config' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/getpath.c' line='949' column='1'/>
      <return type-id='type-id-137'/>
    </function-decl>
    <pointer-type-def type-id='type-id-156' size-in-bits='64' id='type-id-154'/>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-155'/>
    <qualified-type-def type-id='type-id-158' const='yes' id='type-id-157'/>
    <typedef-decl name='_PyPathConfig' type-id='type-id-159' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/pystate.h' line='55' column='1' id='type-id-156'/>
    <class-decl name='__anonymous_struct__' size-in-bits='384' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-156' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/pystate.h' line='40' column='1' id='type-id-159'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='program_full_path' type-id='type-id-160' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/pystate.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prefix' type-id='type-id-160' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/pystate.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='exec_prefix' type-id='type-id-160' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/pystate.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='module_search_path' type-id='type-id-160' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/pystate.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='program_name' type-id='type-id-160' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/pystate.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='home' type-id='type-id-160' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/internal/pystate.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_PyCoreConfig' type-id='type-id-161' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='77' column='1' id='type-id-158'/>
    <class-decl name='__anonymous_struct__6' size-in-bits='1792' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-158' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='29' column='1' id='type-id-161'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='install_signal_handlers' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ignore_environment' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='use_hash_seed' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hash_seed' type-id='type-id-24' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='allocator' type-id='type-id-9' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dev_mode' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='faulthandler' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tracemalloc' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='import_time' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='show_ref_count' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='show_alloc_count' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='dump_refs' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='malloc_stats' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='coerce_c_locale' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='coerce_c_locale_warn' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='utf8_mode' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='program_name' type-id='type-id-160' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='argc' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='argv' type-id='type-id-162' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='program' type-id='type-id-160' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='nxoption' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='xoptions' type-id='type-id-162' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='nwarnoption' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='warnoptions' type-id='type-id-162' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='module_search_path_env' type-id='type-id-160' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='home' type-id='type-id-160' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='nmodule_search_path' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='module_search_paths' type-id='type-id-162' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='executable' type-id='type-id-160' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='prefix' type-id='type-id-160' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='base_prefix' type-id='type-id-160' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='exec_prefix' type-id='type-id-160' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='base_exec_prefix' type-id='type-id-160' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='_disable_importlib' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='76' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-163' size-in-bits='64' id='type-id-160'/>
    <typedef-decl name='wchar_t' type-id='type-id-77' filepath='/usr/lib/gcc/x86_64-linux-gnu/7/include/stddef.h' line='328' column='1' id='type-id-163'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-162'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <typedef-decl name='_Py_hashtable_t' type-id='type-id-164' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.h' line='102' column='1' id='type-id-165'/>
    <class-decl name='_Py_hashtable_t' size-in-bits='576' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.h' line='92' column='1' id='type-id-164'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num_buckets' type-id='type-id-136' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='entries' type-id='type-id-136' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='buckets' type-id='type-id-166' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='key_size' type-id='type-id-136' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='data_size' type-id='type-id-136' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='hash_func' type-id='type-id-167' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='compare_func' type-id='type-id-168' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='alloc' type-id='type-id-169' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.h' line='101' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_Py_slist_t' type-id='type-id-170' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.h' line='14' column='1' id='type-id-171'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-171' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.h' line='12' column='1' id='type-id-170'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-172' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.h' line='13' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_Py_slist_item_t' type-id='type-id-173' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.h' line='10' column='1' id='type-id-174'/>
    <class-decl name='_Py_slist_item_s' size-in-bits='64' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.h' line='8' column='1' id='type-id-173'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-175' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.h' line='9' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_Py_hashtable_hash_func' type-id='type-id-176' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.h' line='75' column='1' id='type-id-167'/>
    <typedef-decl name='Py_uhash_t' type-id='type-id-136' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pyport.h' line='96' column='1' id='type-id-177'/>
    <typedef-decl name='_Py_hashtable_compare_func' type-id='type-id-178' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.h' line='77' column='1' id='type-id-168'/>
    <typedef-decl name='_Py_hashtable_entry_t' type-id='type-id-179' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.h' line='30' column='1' id='type-id-180'/>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-180' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.h' line='23' column='1' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_Py_slist_item' type-id='type-id-174' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='key_hash' type-id='type-id-177' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.h' line='27' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_Py_hashtable_allocator_t' type-id='type-id-181' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.h' line='87' column='1' id='type-id-169'/>
    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-169' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.h' line='81' column='1' id='type-id-181'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='malloc' type-id='type-id-182' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='free' type-id='type-id-56' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.h' line='86' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_Py_hashtable_foreach_func' type-id='type-id-183' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.h' line='136' column='1' id='type-id-184'/>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-185'/>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-186'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-187'/>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' id='type-id-175'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-172'/>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' id='type-id-166'/>
    <qualified-type-def type-id='type-id-180' const='yes' id='type-id-188'/>
    <pointer-type-def type-id='type-id-188' size-in-bits='64' id='type-id-189'/>
    <pointer-type-def type-id='type-id-190' size-in-bits='64' id='type-id-183'/>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' id='type-id-178'/>
    <pointer-type-def type-id='type-id-192' size-in-bits='64' id='type-id-176'/>
    <pointer-type-def type-id='type-id-193' size-in-bits='64' id='type-id-182'/>
    <function-decl name='_Py_hashtable_copy' mangled-name='_Py_hashtable_copy' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='494' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_copy'>
      <parameter type-id='type-id-187' name='src' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='494' column='1'/>
      <return type-id='type-id-187'/>
    </function-decl>
    <function-decl name='_Py_hashtable_destroy' mangled-name='_Py_hashtable_destroy' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='475' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_destroy'>
      <parameter type-id='type-id-187' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='475' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='_Py_hashtable_clear' mangled-name='_Py_hashtable_clear' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='457' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_clear'>
      <parameter type-id='type-id-187' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='457' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='_Py_hashtable_foreach' mangled-name='_Py_hashtable_foreach' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='394' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_foreach'>
      <parameter type-id='type-id-187' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='394' column='1'/>
      <parameter type-id='type-id-184' name='func' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='395' column='1'/>
      <parameter type-id='type-id-76' name='arg' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='396' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='_Py_hashtable_pop' mangled-name='_Py_hashtable_pop' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_pop'>
      <parameter type-id='type-id-187' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='370' column='1'/>
      <parameter type-id='type-id-136' name='key_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='370' column='1'/>
      <parameter type-id='type-id-76' name='pkey' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='370' column='1'/>
      <parameter type-id='type-id-136' name='data_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='371' column='1'/>
      <parameter type-id='type-id-76' name='data' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='371' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='_Py_hashtable_get' mangled-name='_Py_hashtable_get' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='354' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_get'>
      <parameter type-id='type-id-187' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='354' column='1'/>
      <parameter type-id='type-id-136' name='key_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='354' column='1'/>
      <parameter type-id='type-id-76' name='pkey' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='354' column='1'/>
      <parameter type-id='type-id-136' name='data_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='355' column='1'/>
      <parameter type-id='type-id-76' name='data' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='355' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='_Py_hashtable_set' mangled-name='_Py_hashtable_set' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='312' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_set'>
      <parameter type-id='type-id-187' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='312' column='1'/>
      <parameter type-id='type-id-136' name='key_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='312' column='1'/>
      <parameter type-id='type-id-76' name='pkey' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='312' column='1'/>
      <parameter type-id='type-id-136' name='data_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='313' column='1'/>
      <parameter type-id='type-id-76' name='data' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='313' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='_Py_hashtable_get_entry' mangled-name='_Py_hashtable_get_entry' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_get_entry'>
      <parameter type-id='type-id-187' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='253' column='1'/>
      <parameter type-id='type-id-136' name='key_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='254' column='1'/>
      <parameter type-id='type-id-76' name='pkey' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='254' column='1'/>
      <return type-id='type-id-186'/>
    </function-decl>
    <function-decl name='_Py_hashtable_size' mangled-name='_Py_hashtable_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_size'>
      <parameter type-id='type-id-187' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='195' column='1'/>
      <return type-id='type-id-136'/>
    </function-decl>
    <function-decl name='_Py_hashtable_new' mangled-name='_Py_hashtable_new' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='183' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_new'>
      <parameter type-id='type-id-136' name='key_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='183' column='1'/>
      <parameter type-id='type-id-136' name='data_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='183' column='1'/>
      <parameter type-id='type-id-167' name='hash_func' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='184' column='1'/>
      <parameter type-id='type-id-168' name='compare_func' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='185' column='1'/>
      <return type-id='type-id-187'/>
    </function-decl>
    <function-decl name='_Py_hashtable_new_full' mangled-name='_Py_hashtable_new_full' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_new_full'>
      <parameter type-id='type-id-136' name='key_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='141' column='1'/>
      <parameter type-id='type-id-136' name='data_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='141' column='1'/>
      <parameter type-id='type-id-136' name='init_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='142' column='1'/>
      <parameter type-id='type-id-167' name='hash_func' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='143' column='1'/>
      <parameter type-id='type-id-168' name='compare_func' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='144' column='1'/>
      <parameter type-id='type-id-185' name='allocator' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='145' column='1'/>
      <return type-id='type-id-187'/>
    </function-decl>
    <function-decl name='_Py_hashtable_compare_direct' mangled-name='_Py_hashtable_compare_direct' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_compare_direct'>
      <parameter type-id='type-id-187' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='118' column='1'/>
      <parameter type-id='type-id-76' name='pkey' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='118' column='1'/>
      <parameter type-id='type-id-189' name='entry' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='119' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='_Py_hashtable_hash_ptr' mangled-name='_Py_hashtable_hash_ptr' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_hash_ptr'>
      <parameter type-id='type-id-187' name='ht' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='108' column='1'/>
      <parameter type-id='type-id-76' name='pkey' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/hashtable.c' line='108' column='1'/>
      <return type-id='type-id-177'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-190'>
      <parameter type-id='type-id-187'/>
      <parameter type-id='type-id-186'/>
      <parameter type-id='type-id-76'/>
      <return type-id='type-id-77'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-191'>
      <parameter type-id='type-id-187'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-189'/>
      <return type-id='type-id-77'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-192'>
      <parameter type-id='type-id-187'/>
      <parameter type-id='type-id-76'/>
      <return type-id='type-id-177'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-193'>
      <parameter type-id='type-id-136'/>
      <return type-id='type-id-76'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/itertoolsmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit_itertools' mangled-name='PyInit_itertools' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/itertoolsmodule.c' line='4656' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_itertools'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/main.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-194'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-195'/>
    <function-decl name='Py_GetArgcArgv' mangled-name='Py_GetArgcArgv' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/main.c' line='2709' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetArgcArgv'>
      <parameter type-id='type-id-196' name='argc' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/main.c' line='2709' column='1'/>
      <parameter type-id='type-id-195' name='argv' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/main.c' line='2709' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='_Py_UnixMain' mangled-name='_Py_UnixMain' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/main.c' line='2690' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_UnixMain'>
      <parameter type-id='type-id-77' name='argc' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/main.c' line='2690' column='1'/>
      <parameter type-id='type-id-197' name='argv' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/main.c' line='2690' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='Py_Main' mangled-name='Py_Main' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/main.c' line='2678' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_Main'>
      <parameter type-id='type-id-77' name='argc' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/main.c' line='2678' column='1'/>
      <parameter type-id='type-id-162' name='argv' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/main.c' line='2678' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='_PyMainInterpreterConfig_Read' mangled-name='_PyMainInterpreterConfig_Read' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/main.c' line='2399' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyMainInterpreterConfig_Read'>
      <parameter type-id='type-id-198' name='main_config' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/main.c' line='2399' column='1'/>
      <parameter type-id='type-id-155' name='config' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/main.c' line='2400' column='1'/>
      <return type-id='type-id-137'/>
    </function-decl>
    <function-decl name='_PyMainInterpreterConfig_Copy' mangled-name='_PyMainInterpreterConfig_Copy' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/main.c' line='2367' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyMainInterpreterConfig_Copy'>
      <parameter type-id='type-id-198' name='config' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/main.c' line='2367' column='1'/>
      <parameter type-id='type-id-199' name='config2' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/main.c' line='2368' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='_PyMainInterpreterConfig_Clear' mangled-name='_PyMainInterpreterConfig_Clear' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/main.c' line='2328' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyMainInterpreterConfig_Clear'>
      <parameter type-id='type-id-198' name='config' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/main.c' line='2328' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='_PyCoreConfig_Copy' mangled-name='_PyCoreConfig_Copy' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/main.c' line='2264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyCoreConfig_Copy'>
      <parameter type-id='type-id-194' name='config' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/main.c' line='2264' column='1'/>
      <parameter type-id='type-id-155' name='config2' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/main.c' line='2264' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='_PyCoreConfig_Clear' mangled-name='_PyCoreConfig_Clear' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/main.c' line='2226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyCoreConfig_Clear'>
      <parameter type-id='type-id-194' name='config' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/main.c' line='2226' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='_PyCoreConfig_Read' mangled-name='_PyCoreConfig_Read' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/main.c' line='2171' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyCoreConfig_Read'>
      <parameter type-id='type-id-194' name='config' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/main.c' line='2171' column='1'/>
      <return type-id='type-id-137'/>
    </function-decl>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-198'/>
    <pointer-type-def type-id='type-id-201' size-in-bits='64' id='type-id-197'/>
    <pointer-type-def type-id='type-id-202' size-in-bits='64' id='type-id-199'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-196'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-201'/>
    <qualified-type-def type-id='type-id-200' const='yes' id='type-id-202'/>
    <typedef-decl name='_PyMainInterpreterConfig' type-id='type-id-203' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='104' column='1' id='type-id-200'/>
    <class-decl name='__anonymous_struct__7' size-in-bits='640' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-200' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='93' column='1' id='type-id-203'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='install_signal_handlers' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='argv' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='executable' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='prefix' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='base_prefix' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='exec_prefix' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='base_exec_prefix' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='warnoptions' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='xoptions' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='module_search_path' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/pystate.h' line='103' column='1'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/posixmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <typedef-decl name='uid_t' type-id='type-id-204' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='80' column='1' id='type-id-205'/>
    <typedef-decl name='gid_t' type-id='type-id-206' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='65' column='1' id='type-id-207'/>
    <function-decl name='PyInit_posix' mangled-name='PyInit_posix' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/posixmodule.c' line='13408' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_posix'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_Gid_Converter' mangled-name='_Py_Gid_Converter' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/posixmodule.c' line='624' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_Gid_Converter'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/posixmodule.c' line='624' column='1'/>
      <parameter type-id='type-id-76' name='p' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/posixmodule.c' line='624' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='_Py_Uid_Converter' mangled-name='_Py_Uid_Converter' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/posixmodule.c' line='518' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_Uid_Converter'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/posixmodule.c' line='518' column='1'/>
      <parameter type-id='type-id-76' name='p' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/posixmodule.c' line='518' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyOS_AfterFork' mangled-name='PyOS_AfterFork' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/posixmodule.c' line='473' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_AfterFork'>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='PyOS_AfterFork_Child' mangled-name='PyOS_AfterFork_Child' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/posixmodule.c' line='447' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_AfterFork_Child'>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='PyOS_AfterFork_Parent' mangled-name='PyOS_AfterFork_Parent' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/posixmodule.c' line='438' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_AfterFork_Parent'>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='PyOS_BeforeFork' mangled-name='PyOS_BeforeFork' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/posixmodule.c' line='430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_BeforeFork'>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='_PyLong_FromUid' mangled-name='_PyLong_FromUid' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/posixmodule.c' line='502' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyLong_FromUid'>
      <parameter type-id='type-id-205' name='uid' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/posixmodule.c' line='502' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyLong_FromGid' mangled-name='_PyLong_FromGid' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/posixmodule.c' line='510' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyLong_FromGid'>
      <parameter type-id='type-id-207' name='gid' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/posixmodule.c' line='510' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyOS_FSPath' mangled-name='PyOS_FSPath' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/posixmodule.c' line='12481' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_FSPath'>
      <parameter type-id='type-id-1' name='path' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/posixmodule.c' line='12481' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <typedef-decl name='__gid_t' type-id='type-id-39' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='135' column='1' id='type-id-206'/>
    <typedef-decl name='__uid_t' type-id='type-id-39' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='134' column='1' id='type-id-204'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/pwdmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit_pwd' mangled-name='PyInit_pwd' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/pwdmodule.c' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_pwd'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/signalmodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='_PyOS_IsMainThread' mangled-name='_PyOS_IsMainThread' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/signalmodule.c' line='1625' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyOS_IsMainThread'>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='_PySignal_AfterFork' mangled-name='_PySignal_AfterFork' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/signalmodule.c' line='1614' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySignal_AfterFork'>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='PyOS_InterruptOccurred' mangled-name='PyOS_InterruptOccurred' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/signalmodule.c' line='1590' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_InterruptOccurred'>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyOS_FiniInterrupts' mangled-name='PyOS_FiniInterrupts' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/signalmodule.c' line='1584' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_FiniInterrupts'>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='PyOS_InitInterrupts' mangled-name='PyOS_InitInterrupts' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/signalmodule.c' line='1575' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_InitInterrupts'>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='PyErr_SetInterrupt' mangled-name='PyErr_SetInterrupt' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/signalmodule.c' line='1569' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_SetInterrupt'>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='PyInit__signal' mangled-name='PyInit__signal' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/signalmodule.c' line='1213' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__signal'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySignal_SetWakeupFd' mangled-name='PySignal_SetWakeupFd' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/signalmodule.c' line='656' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySignal_SetWakeupFd'>
      <parameter type-id='type-id-77' name='fd' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/signalmodule.c' line='656' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyErr_CheckSignals' mangled-name='PyErr_CheckSignals' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/signalmodule.c' line='1511' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_CheckSignals'>
      <return type-id='type-id-77'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/symtablemodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit__symtable' mangled-name='PyInit__symtable' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/symtablemodule.c' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__symtable'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/timemodule.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit_time' mangled-name='PyInit_time' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/timemodule.c' line='1686' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_time'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/xxsubtype.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit_xxsubtype' mangled-name='PyInit_xxsubtype' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/xxsubtype.c' line='311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_xxsubtype'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/zipimport.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <function-decl name='PyInit_zipimport' mangled-name='PyInit_zipimport' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Modules/zipimport.c' line='1626' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_zipimport'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <qualified-type-def type-id='type-id-201' const='yes' id='type-id-208'/>
    <pointer-type-def type-id='type-id-208' size-in-bits='64' id='type-id-209'/>
    <qualified-type-def type-id='type-id-210' const='yes' id='type-id-211'/>
    <pointer-type-def type-id='type-id-211' size-in-bits='64' id='type-id-212'/>
    <qualified-type-def type-id='type-id-4' const='yes' id='type-id-213'/>
    <pointer-type-def type-id='type-id-213' size-in-bits='64' id='type-id-214'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-215'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-216'/>
    <function-decl name='_Py_FreeCharPArray' mangled-name='_Py_FreeCharPArray' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2626' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_FreeCharPArray'>
      <parameter type-id='type-id-209' name='array' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2626' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='_PySequence_BytesToCharpArray' mangled-name='_PySequence_BytesToCharpArray' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2567' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySequence_BytesToCharpArray'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2567' column='1'/>
      <return type-id='type-id-209'/>
    </function-decl>
    <function-decl name='_PyObject_RealIsSubclass' mangled-name='_PyObject_RealIsSubclass' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2506' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_RealIsSubclass'>
      <parameter type-id='type-id-1' name='derived' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2506' column='1'/>
      <parameter type-id='type-id-1' name='cls' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2506' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='_PyObject_RealIsInstance' mangled-name='_PyObject_RealIsInstance' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2500' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_RealIsInstance'>
      <parameter type-id='type-id-1' name='inst' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2500' column='1'/>
      <parameter type-id='type-id-1' name='cls' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2500' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyObject_IsSubclass' mangled-name='PyObject_IsSubclass' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2444' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_IsSubclass'>
      <parameter type-id='type-id-1' name='derived' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2444' column='1'/>
      <parameter type-id='type-id-1' name='cls' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2444' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyObject_IsInstance' mangled-name='PyObject_IsInstance' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2369' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_IsInstance'>
      <parameter type-id='type-id-1' name='inst' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2369' column='1'/>
      <parameter type-id='type-id-1' name='cls' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2369' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyMapping_Values' mangled-name='PyMapping_Values' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Values'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2223' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyMapping_Items' mangled-name='PyMapping_Items' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Items'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2209' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyMapping_Keys' mangled-name='PyMapping_Keys' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Keys'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2195' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyMapping_HasKey' mangled-name='PyMapping_HasKey' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_HasKey'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2150' column='1'/>
      <parameter type-id='type-id-1' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2150' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyMapping_HasKeyString' mangled-name='PyMapping_HasKeyString' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2136' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_HasKeyString'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2136' column='1'/>
      <parameter type-id='type-id-9' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2136' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyMapping_SetItemString' mangled-name='PyMapping_SetItemString' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_SetItemString'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2117' column='1'/>
      <parameter type-id='type-id-9' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2117' column='1'/>
      <parameter type-id='type-id-1' name='value' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2117' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyMapping_Length' mangled-name='PyMapping_Length' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2093' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Length'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2093' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyMapping_Check' mangled-name='PyMapping_Check' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2064' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Check'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2064' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PySequence_Index' mangled-name='PySequence_Index' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2056' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Index'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2056' column='1'/>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2056' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySequence_In' mangled-name='PySequence_In' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2050' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_In'>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2050' column='1'/>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2050' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PySequence_Count' mangled-name='PySequence_Count' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2028' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Count'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2028' column='1'/>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2028' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySequence_Fast' mangled-name='PySequence_Fast' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1912' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Fast'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1912' column='1'/>
      <parameter type-id='type-id-9' name='m' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1912' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_Tuple' mangled-name='PySequence_Tuple' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1805' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Tuple'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1805' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_DelSlice' mangled-name='PySequence_DelSlice' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1781' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_DelSlice'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1781' column='1'/>
      <parameter type-id='type-id-4' name='i1' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1781' column='1'/>
      <parameter type-id='type-id-4' name='i2' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1781' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PySequence_SetSlice' mangled-name='PySequence_SetSlice' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1756' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_SetSlice'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1756' column='1'/>
      <parameter type-id='type-id-4' name='i1' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1756' column='1'/>
      <parameter type-id='type-id-4' name='i2' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1756' column='1'/>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1756' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PySequence_GetSlice' mangled-name='PySequence_GetSlice' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1675' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_GetSlice'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1675' column='1'/>
      <parameter type-id='type-id-4' name='i1' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1675' column='1'/>
      <parameter type-id='type-id-4' name='i2' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1675' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_InPlaceRepeat' mangled-name='PySequence_InPlaceRepeat' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1618' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_InPlaceRepeat'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1618' column='1'/>
      <parameter type-id='type-id-4' name='count' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1618' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_InPlaceConcat' mangled-name='PySequence_InPlaceConcat' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1593' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_InPlaceConcat'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1593' column='1'/>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1593' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_Repeat' mangled-name='PySequence_Repeat' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1563' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Repeat'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1563' column='1'/>
      <parameter type-id='type-id-4' name='count' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1563' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_Concat' mangled-name='PySequence_Concat' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1538' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Concat'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1538' column='1'/>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1538' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_Length' mangled-name='PySequence_Length' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1531' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Length'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1531' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySequence_Check' mangled-name='PySequence_Check' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1500' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Check'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1500' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyNumber_ToBase' mangled-name='PyNumber_ToBase' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1478' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_ToBase'>
      <parameter type-id='type-id-1' name='n' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1478' column='1'/>
      <parameter type-id='type-id-77' name='base' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1478' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Float' mangled-name='PyNumber_Float' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1431' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Float'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1431' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Long' mangled-name='PyNumber_Long' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1339' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Long'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1339' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_AsSsize_t' mangled-name='PyNumber_AsSsize_t' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_AsSsize_t'>
      <parameter type-id='type-id-1' name='item' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1294' column='1'/>
      <parameter type-id='type-id-1' name='err' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1294' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyNumber_Index' mangled-name='PyNumber_Index' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1252' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Index'>
      <parameter type-id='type-id-1' name='item' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1252' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Absolute' mangled-name='PyNumber_Absolute' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Absolute'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1232' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Invert' mangled-name='PyNumber_Invert' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1216' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Invert'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1216' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Positive' mangled-name='PyNumber_Positive' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1200' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Positive'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1200' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Negative' mangled-name='PyNumber_Negative' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1184' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Negative'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1184' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlacePower' mangled-name='PyNumber_InPlacePower' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1169' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlacePower'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1169' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1169' column='1'/>
      <parameter type-id='type-id-1' name='z' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1169' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceRemainder' mangled-name='PyNumber_InPlaceRemainder' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1162' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceRemainder'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1162' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1162' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceMultiply' mangled-name='PyNumber_InPlaceMultiply' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1126' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceMultiply'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1126' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1126' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceAdd' mangled-name='PyNumber_InPlaceAdd' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceAdd'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1105' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1105' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceTrueDivide' mangled-name='PyNumber_InPlaceTrueDivide' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1098' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceTrueDivide'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1098' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1098' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceFloorDivide' mangled-name='PyNumber_InPlaceFloorDivide' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1091' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceFloorDivide'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1091' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1091' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceSubtract' mangled-name='PyNumber_InPlaceSubtract' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1087' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceSubtract'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1087' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1087' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceRshift' mangled-name='PyNumber_InPlaceRshift' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1086' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceRshift'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1086' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1086' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceLshift' mangled-name='PyNumber_InPlaceLshift' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1085' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceLshift'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1085' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1085' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceAnd' mangled-name='PyNumber_InPlaceAnd' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1084' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceAnd'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1084' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1084' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceXor' mangled-name='PyNumber_InPlaceXor' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1083' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceXor'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1083' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1083' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceOr' mangled-name='PyNumber_InPlaceOr' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1082' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceOr'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1082' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1082' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Power' mangled-name='PyNumber_Power' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1026' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Power'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1026' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1026' column='1'/>
      <parameter type-id='type-id-1' name='z' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1026' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Remainder' mangled-name='PyNumber_Remainder' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1020' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Remainder'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1020' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1020' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_TrueDivide' mangled-name='PyNumber_TrueDivide' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1014' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_TrueDivide'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1014' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1014' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_FloorDivide' mangled-name='PyNumber_FloorDivide' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1008' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_FloorDivide'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1008' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1008' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_MatrixMultiply' mangled-name='PyNumber_MatrixMultiply' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1002' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_MatrixMultiply'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1002' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1002' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Multiply' mangled-name='PyNumber_Multiply' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='983' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Multiply'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='983' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='983' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Add' mangled-name='PyNumber_Add' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='952' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Add'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='952' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='952' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Divmod' mangled-name='PyNumber_Divmod' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='949' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Divmod'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='949' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='949' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Subtract' mangled-name='PyNumber_Subtract' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='948' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Subtract'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='948' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='948' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Rshift' mangled-name='PyNumber_Rshift' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='947' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Rshift'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='947' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='947' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Lshift' mangled-name='PyNumber_Lshift' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='946' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Lshift'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='946' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='946' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_And' mangled-name='PyNumber_And' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='945' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_And'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='945' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='945' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Xor' mangled-name='PyNumber_Xor' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='944' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Xor'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='944' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='944' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Or' mangled-name='PyNumber_Or' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='943' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Or'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='943' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='943' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Check' mangled-name='PyNumber_Check' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='756' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Check'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='756' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyObject_Format' mangled-name='PyObject_Format' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='695' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Format'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='695' column='1'/>
      <parameter type-id='type-id-1' name='format_spec' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='695' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyBuffer_Release' mangled-name='PyBuffer_Release' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='681' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_Release'>
      <parameter type-id='type-id-217' name='view' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='681' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='PyBuffer_FillInfo' mangled-name='PyBuffer_FillInfo' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='642' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FillInfo'>
      <parameter type-id='type-id-217' name='view' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='642' column='1'/>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='642' column='1'/>
      <parameter type-id='type-id-76' name='buf' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='642' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='642' column='1'/>
      <parameter type-id='type-id-77' name='readonly' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='643' column='1'/>
      <parameter type-id='type-id-77' name='flags' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='643' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyBuffer_FillContiguousStrides' mangled-name='PyBuffer_FillContiguousStrides' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='618' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FillContiguousStrides'>
      <parameter type-id='type-id-77' name='nd' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='618' column='1'/>
      <parameter type-id='type-id-134' name='shape' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='618' column='1'/>
      <parameter type-id='type-id-134' name='strides' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='619' column='1'/>
      <parameter type-id='type-id-77' name='itemsize' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='619' column='1'/>
      <parameter type-id='type-id-79' name='fort' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='620' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='PyObject_CopyData' mangled-name='PyObject_CopyData' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='547' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CopyData'>
      <parameter type-id='type-id-1' name='dest' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='547' column='1'/>
      <parameter type-id='type-id-1' name='src' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='547' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyBuffer_FromContiguous' mangled-name='PyBuffer_FromContiguous' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='496' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FromContiguous'>
      <parameter type-id='type-id-217' name='view' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='496' column='1'/>
      <parameter type-id='type-id-76' name='buf' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='496' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='496' column='1'/>
      <parameter type-id='type-id-79' name='fort' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='496' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='_Py_add_one_to_index_C' mangled-name='_Py_add_one_to_index_C' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='480' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_add_one_to_index_C'>
      <parameter type-id='type-id-77' name='nd' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='480' column='1'/>
      <parameter type-id='type-id-134' name='index' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='480' column='1'/>
      <parameter type-id='type-id-214' name='shape' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='480' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='_Py_add_one_to_index_F' mangled-name='_Py_add_one_to_index_F' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='464' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_add_one_to_index_F'>
      <parameter type-id='type-id-77' name='nd' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='464' column='1'/>
      <parameter type-id='type-id-134' name='index' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='464' column='1'/>
      <parameter type-id='type-id-214' name='shape' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='464' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='PyBuffer_GetPointer' mangled-name='PyBuffer_GetPointer' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='448' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_GetPointer'>
      <parameter type-id='type-id-217' name='view' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='448' column='1'/>
      <parameter type-id='type-id-134' name='indices' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='448' column='1'/>
      <return type-id='type-id-76'/>
    </function-decl>
    <function-decl name='PyObject_GetBuffer' mangled-name='PyObject_GetBuffer' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='351' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetBuffer'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='351' column='1'/>
      <parameter type-id='type-id-217' name='view' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='351' column='1'/>
      <parameter type-id='type-id-77' name='flags' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='351' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyObject_AsWriteBuffer' mangled-name='PyObject_AsWriteBuffer' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='322' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsWriteBuffer'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='322' column='1'/>
      <parameter type-id='type-id-216' name='buffer' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='323' column='1'/>
      <parameter type-id='type-id-134' name='buffer_len' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='324' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyObject_AsReadBuffer' mangled-name='PyObject_AsReadBuffer' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='315' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsReadBuffer'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='315' column='1'/>
      <parameter type-id='type-id-216' name='buffer' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='316' column='1'/>
      <parameter type-id='type-id-134' name='buffer_len' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='317' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyObject_AsCharBuffer' mangled-name='PyObject_AsCharBuffer' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='308' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsCharBuffer'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='308' column='1'/>
      <parameter type-id='type-id-215' name='buffer' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='309' column='1'/>
      <parameter type-id='type-id-134' name='buffer_len' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='310' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyObject_CheckReadBuffer' mangled-name='PyObject_CheckReadBuffer' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CheckReadBuffer'>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='273' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyObject_DelItemString' mangled-name='PyObject_DelItemString' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='252' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_DelItemString'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='252' column='1'/>
      <parameter type-id='type-id-9' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='252' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='_PyObject_HasLen' mangled-name='_PyObject_HasLen' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_HasLen'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='74' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyObject_Length' mangled-name='PyObject_Length' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Length'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='67' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_Type' mangled-name='PyObject_Type' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Type'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='32' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyBuffer_IsContiguous' mangled-name='PyBuffer_IsContiguous' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_IsContiguous'>
      <parameter type-id='type-id-212' name='view' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='432' column='1'/>
      <parameter type-id='type-id-79' name='order' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='432' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceMatrixMultiply' mangled-name='PyNumber_InPlaceMatrixMultiply' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceMatrixMultiply'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1155' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1155' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_Size' mangled-name='PySequence_Size' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1509' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Size'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1509' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySequence_GetItem' mangled-name='PySequence_GetItem' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1648' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_GetItem'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1648' column='1'/>
      <parameter type-id='type-id-4' name='i' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1648' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyObject_GetItem' mangled-name='PyObject_GetItem' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetItem'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='143' column='1'/>
      <parameter type-id='type-id-1' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='143' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_SetItem' mangled-name='PySequence_SetItem' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1698' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_SetItem'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1698' column='1'/>
      <parameter type-id='type-id-4' name='i' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1698' column='1'/>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1698' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyObject_SetItem' mangled-name='PyObject_SetItem' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_SetItem'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='188' column='1'/>
      <parameter type-id='type-id-1' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='188' column='1'/>
      <parameter type-id='type-id-1' name='value' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='188' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PySequence_DelItem' mangled-name='PySequence_DelItem' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1727' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_DelItem'>
      <parameter type-id='type-id-1' name='s' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1727' column='1'/>
      <parameter type-id='type-id-4' name='i' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1727' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyObject_DelItem' mangled-name='PyObject_DelItem' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_DelItem'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='220' column='1'/>
      <parameter type-id='type-id-1' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='220' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PySequence_List' mangled-name='PySequence_List' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1889' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_List'>
      <parameter type-id='type-id-1' name='v' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1889' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyMapping_Size' mangled-name='PyMapping_Size' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2071' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Size'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2071' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_Size' mangled-name='PyObject_Size' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Size'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='46' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_LengthHint' mangled-name='PyObject_LengthHint' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_LengthHint'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='86' column='1'/>
      <parameter type-id='type-id-4' name='defaultvalue' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='86' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyMapping_GetItemString' mangled-name='PyMapping_GetItemString' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2100' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_GetItemString'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2100' column='1'/>
      <parameter type-id='type-id-9' name='key' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2100' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyObject_GetIter' mangled-name='PyObject_GetIter' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2513' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetIter'>
      <parameter type-id='type-id-1' name='o' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2513' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyIter_Next' mangled-name='PyIter_Next' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2546' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyIter_Next'>
      <parameter type-id='type-id-1' name='iter' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2546' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PySequence_IterSearch' mangled-name='_PySequence_IterSearch' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1945' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySequence_IterSearch'>
      <parameter type-id='type-id-1' name='seq' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1945' column='1'/>
      <parameter type-id='type-id-1' name='obj' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1945' column='1'/>
      <parameter type-id='type-id-77' name='operation' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='1945' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySequence_Contains' mangled-name='PySequence_Contains' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2037' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Contains'>
      <parameter type-id='type-id-1' name='seq' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2037' column='1'/>
      <parameter type-id='type-id-1' name='ob' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/abstract.c' line='2037' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <pointer-type-def type-id='type-id-210' size-in-bits='64' id='type-id-217'/>
    <typedef-decl name='Py_buffer' type-id='type-id-218' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='195' column='1' id='type-id-210'/>
    <class-decl name='bufferinfo' size-in-bits='640' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='182' column='1' id='type-id-218'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf' type-id='type-id-76' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='obj' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='len' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='itemsize' type-id='type-id-4' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='readonly' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ndim' type-id='type-id-77' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='format' type-id='type-id-201' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='shape' type-id='type-id-134' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='strides' type-id='type-id-134' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='suboffsets' type-id='type-id-134' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='internal' type-id='type-id-76' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='194' column='1'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/accu.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <typedef-decl name='_PyAccu' type-id='type-id-219' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/accu.h' line='24' column='1' id='type-id-220'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-220' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/accu.h' line='21' column='1' id='type-id-219'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='large' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/accu.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='small' type-id='type-id-1' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/accu.h' line='23' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-221'/>
    <function-decl name='_PyAccu_Destroy' mangled-name='_PyAccu_Destroy' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/accu.c' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Destroy'>
      <parameter type-id='type-id-221' name='acc' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/accu.c' line='111' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='_PyAccu_Finish' mangled-name='_PyAccu_Finish' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/accu.c' line='93' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Finish'>
      <parameter type-id='type-id-221' name='acc' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/accu.c' line='93' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyAccu_Accumulate' mangled-name='_PyAccu_Accumulate' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/accu.c' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Accumulate'>
      <parameter type-id='type-id-221' name='acc' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/accu.c' line='55' column='1'/>
      <parameter type-id='type-id-1' name='unicode' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/accu.c' line='55' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='_PyAccu_Init' mangled-name='_PyAccu_Init' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/accu.c' line='18' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Init'>
      <parameter type-id='type-id-221' name='acc' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/accu.c' line='18' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='_PyAccu_FinishAsList' mangled-name='_PyAccu_FinishAsList' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/accu.c' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_FinishAsList'>
      <parameter type-id='type-id-221' name='acc' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/accu.c' line='76' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/boolobject.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-222' size-in-bits='32' id='type-id-223'>
      <subrange length='1' type-id='type-id-24' id='type-id-224'/>
    </array-type-def>
    <typedef-decl name='PyTypeObject' type-id='type-id-6' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/object.h' line='435' column='1' id='type-id-133'/>
    <class-decl name='_longobject' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/longintrepr.h' line='85' column='1' id='type-id-225'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-8' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/longintrepr.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ob_digit' type-id='type-id-223' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/longintrepr.h' line='87' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='digit' type-id='type-id-226' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/longintrepr.h' line='45' column='1' id='type-id-222'/>
    <typedef-decl name='uint32_t' type-id='type-id-227' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-226'/>
    <typedef-decl name='__uint32_t' type-id='type-id-39' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='41' column='1' id='type-id-227'/>
    <var-decl name='PyBool_Type' type-id='type-id-133' mangled-name='PyBool_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/boolobject.h' line='10' column='1' elf-symbol-id='PyBool_Type'/>
    <var-decl name='_Py_FalseStruct' type-id='type-id-225' mangled-name='_Py_FalseStruct' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/boolobject.h' line='18' column='1' elf-symbol-id='_Py_FalseStruct'/>
    <var-decl name='_Py_TrueStruct' type-id='type-id-225' mangled-name='_Py_TrueStruct' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/boolobject.h' line='18' column='1' elf-symbol-id='_Py_TrueStruct'/>
    <function-decl name='PyBool_FromLong' mangled-name='PyBool_FromLong' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/boolobject.c' line='28' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBool_FromLong'>
      <parameter type-id='type-id-51' name='ok' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/boolobject.c' line='28' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytearrayobject.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-79' size-in-bits='infinite' id='type-id-228'>
      <subrange length='infinite' id='type-id-229'/>
    </array-type-def>
    <var-decl name='_PyByteArray_empty_string' type-id='type-id-228' mangled-name='_PyByteArray_empty_string' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytearrayobject.h' line='56' column='1' elf-symbol-id='_PyByteArray_empty_string'/>
    <var-decl name='PyByteArray_Type' type-id='type-id-133' mangled-name='PyByteArray_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytearrayobject.h' line='34' column='1' elf-symbol-id='PyByteArray_Type'/>
    <var-decl name='PyByteArrayIter_Type' type-id='type-id-133' mangled-name='PyByteArrayIter_Type' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytearrayobject.h' line='35' column='1' elf-symbol-id='PyByteArrayIter_Type'/>
    <function-decl name='PyByteArray_Concat' mangled-name='PyByteArray_Concat' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytearrayobject.c' line='269' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Concat'>
      <parameter type-id='type-id-1' name='a' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytearrayobject.c' line='269' column='1'/>
      <parameter type-id='type-id-1' name='b' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytearrayobject.c' line='269' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyByteArray_Resize' mangled-name='PyByteArray_Resize' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytearrayobject.c' line='190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Resize'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytearrayobject.c' line='190' column='1'/>
      <parameter type-id='type-id-4' name='requested_size' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytearrayobject.c' line='190' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyByteArray_AsString' mangled-name='PyByteArray_AsString' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytearrayobject.c' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_AsString'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytearrayobject.c' line='181' column='1'/>
      <return type-id='type-id-201'/>
    </function-decl>
    <function-decl name='PyByteArray_Size' mangled-name='PyByteArray_Size' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytearrayobject.c' line='172' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Size'>
      <parameter type-id='type-id-1' name='self' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytearrayobject.c' line='172' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyByteArray_FromObject' mangled-name='PyByteArray_FromObject' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytearrayobject.c' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_FromObject'>
      <parameter type-id='type-id-1' name='input' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytearrayobject.c' line='101' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyByteArray_Init' mangled-name='PyByteArray_Init' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytearrayobject.c' line='25' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Init'>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='PyByteArray_Fini' mangled-name='PyByteArray_Fini' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytearrayobject.c' line='20' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Fini'>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='PyByteArray_FromStringAndSize' mangled-name='PyByteArray_FromStringAndSize' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytearrayobject.c' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_FromStringAndSize'>
      <parameter type-id='type-id-9' name='bytes' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytearrayobject.c' line='128' column='1'/>
      <parameter type-id='type-id-4' name='size' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytearrayobject.c' line='128' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' comp-dir-path='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/spack-build' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-49' size-in-bits='infinite' id='type-id-230'>
      <subrange length='infinite' id='type-id-229'/>
    </array-type-def>
    <var-decl name='_Py_isspace__doc__' type-id='type-id-230' mangled-name='_Py_isspace__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytes_methods.h' line='38' column='1' elf-symbol-id='_Py_isspace__doc__'/>
    <var-decl name='_Py_isalpha__doc__' type-id='type-id-230' mangled-name='_Py_isalpha__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytes_methods.h' line='39' column='1' elf-symbol-id='_Py_isalpha__doc__'/>
    <var-decl name='_Py_isalnum__doc__' type-id='type-id-230' mangled-name='_Py_isalnum__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytes_methods.h' line='40' column='1' elf-symbol-id='_Py_isalnum__doc__'/>
    <var-decl name='_Py_isascii__doc__' type-id='type-id-230' mangled-name='_Py_isascii__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytes_methods.h' line='41' column='1' elf-symbol-id='_Py_isascii__doc__'/>
    <var-decl name='_Py_isdigit__doc__' type-id='type-id-230' mangled-name='_Py_isdigit__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytes_methods.h' line='42' column='1' elf-symbol-id='_Py_isdigit__doc__'/>
    <var-decl name='_Py_islower__doc__' type-id='type-id-230' mangled-name='_Py_islower__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytes_methods.h' line='43' column='1' elf-symbol-id='_Py_islower__doc__'/>
    <var-decl name='_Py_isupper__doc__' type-id='type-id-230' mangled-name='_Py_isupper__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytes_methods.h' line='44' column='1' elf-symbol-id='_Py_isupper__doc__'/>
    <var-decl name='_Py_istitle__doc__' type-id='type-id-230' mangled-name='_Py_istitle__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytes_methods.h' line='45' column='1' elf-symbol-id='_Py_istitle__doc__'/>
    <var-decl name='_Py_lower__doc__' type-id='type-id-230' mangled-name='_Py_lower__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytes_methods.h' line='46' column='1' elf-symbol-id='_Py_lower__doc__'/>
    <var-decl name='_Py_upper__doc__' type-id='type-id-230' mangled-name='_Py_upper__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytes_methods.h' line='47' column='1' elf-symbol-id='_Py_upper__doc__'/>
    <var-decl name='_Py_title__doc__' type-id='type-id-230' mangled-name='_Py_title__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytes_methods.h' line='48' column='1' elf-symbol-id='_Py_title__doc__'/>
    <var-decl name='_Py_capitalize__doc__' type-id='type-id-230' mangled-name='_Py_capitalize__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytes_methods.h' line='49' column='1' elf-symbol-id='_Py_capitalize__doc__'/>
    <var-decl name='_Py_swapcase__doc__' type-id='type-id-230' mangled-name='_Py_swapcase__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytes_methods.h' line='50' column='1' elf-symbol-id='_Py_swapcase__doc__'/>
    <var-decl name='_Py_maketrans__doc__' type-id='type-id-230' mangled-name='_Py_maketrans__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytes_methods.h' line='58' column='1' elf-symbol-id='_Py_maketrans__doc__'/>
    <var-decl name='_Py_find__doc__' type-id='type-id-230' mangled-name='_Py_find__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytes_methods.h' line='52' column='1' elf-symbol-id='_Py_find__doc__'/>
    <var-decl name='_Py_index__doc__' type-id='type-id-230' mangled-name='_Py_index__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytes_methods.h' line='53' column='1' elf-symbol-id='_Py_index__doc__'/>
    <var-decl name='_Py_rfind__doc__' type-id='type-id-230' mangled-name='_Py_rfind__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytes_methods.h' line='54' column='1' elf-symbol-id='_Py_rfind__doc__'/>
    <var-decl name='_Py_rindex__doc__' type-id='type-id-230' mangled-name='_Py_rindex__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytes_methods.h' line='55' column='1' elf-symbol-id='_Py_rindex__doc__'/>
    <var-decl name='_Py_count__doc__' type-id='type-id-230' mangled-name='_Py_count__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytes_methods.h' line='51' column='1' elf-symbol-id='_Py_count__doc__'/>
    <var-decl name='_Py_startswith__doc__' type-id='type-id-230' mangled-name='_Py_startswith__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytes_methods.h' line='56' column='1' elf-symbol-id='_Py_startswith__doc__'/>
    <var-decl name='_Py_endswith__doc__' type-id='type-id-230' mangled-name='_Py_endswith__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytes_methods.h' line='57' column='1' elf-symbol-id='_Py_endswith__doc__'/>
    <var-decl name='_Py_expandtabs__doc__' type-id='type-id-230' mangled-name='_Py_expandtabs__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytes_methods.h' line='59' column='1' elf-symbol-id='_Py_expandtabs__doc__'/>
    <var-decl name='_Py_ljust__doc__' type-id='type-id-230' mangled-name='_Py_ljust__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytes_methods.h' line='60' column='1' elf-symbol-id='_Py_ljust__doc__'/>
    <var-decl name='_Py_rjust__doc__' type-id='type-id-230' mangled-name='_Py_rjust__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytes_methods.h' line='61' column='1' elf-symbol-id='_Py_rjust__doc__'/>
    <var-decl name='_Py_center__doc__' type-id='type-id-230' mangled-name='_Py_center__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytes_methods.h' line='62' column='1' elf-symbol-id='_Py_center__doc__'/>
    <var-decl name='_Py_zfill__doc__' type-id='type-id-230' mangled-name='_Py_zfill__doc__' visibility='default' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Include/bytes_methods.h' line='63' column='1' elf-symbol-id='_Py_zfill__doc__'/>
    <function-decl name='_Py_bytes_endswith' mangled-name='_Py_bytes_endswith' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='844' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_endswith'>
      <parameter type-id='type-id-9' name='str' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='844' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='844' column='1'/>
      <parameter type-id='type-id-1' name='args' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='844' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_startswith' mangled-name='_Py_bytes_startswith' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='830' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_startswith'>
      <parameter type-id='type-id-9' name='str' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='830' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='830' column='1'/>
      <parameter type-id='type-id-1' name='args' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='830' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_contains' mangled-name='_Py_bytes_contains' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='710' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_contains'>
      <parameter type-id='type-id-9' name='str' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='710' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='710' column='1'/>
      <parameter type-id='type-id-1' name='arg' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='710' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='_Py_bytes_count' mangled-name='_Py_bytes_count' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='670' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_count'>
      <parameter type-id='type-id-9' name='str' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='670' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='670' column='1'/>
      <parameter type-id='type-id-1' name='args' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='670' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_rindex' mangled-name='_Py_bytes_rindex' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='649' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_rindex'>
      <parameter type-id='type-id-9' name='str' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='649' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='649' column='1'/>
      <parameter type-id='type-id-1' name='args' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='649' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_rfind' mangled-name='_Py_bytes_rfind' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='631' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_rfind'>
      <parameter type-id='type-id-9' name='str' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='631' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='631' column='1'/>
      <parameter type-id='type-id-1' name='args' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='631' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_index' mangled-name='_Py_bytes_index' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='608' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_index'>
      <parameter type-id='type-id-9' name='str' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='608' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='608' column='1'/>
      <parameter type-id='type-id-1' name='args' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='608' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_find' mangled-name='_Py_bytes_find' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='590' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_find'>
      <parameter type-id='type-id-9' name='str' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='590' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='590' column='1'/>
      <parameter type-id='type-id-1' name='args' filepath='/tmp/root/spack-stage/spack-stage-python-3.7.0-5wjzdkprv3ndi77c3bqn3mgkg4wmtekf/spack-src/Objects/bytes_methods.c' line='590' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
